Revit 2026 API

# DXFExportOptions Class

---

The export options used by exporting DXF format file.

SystemObject Autodesk.Revit.DBBaseExportOptions Autodesk.Revit.DBACADExportOptions Autodesk.Revit.DBDXFExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DXFExportOptions : ACADExportOptions
```
```vb
Public Class DXFExportOptions
	Inherits ACADExportOptions
```
```cpp
public ref class DXFExportOptions : public ACADExportOptions
```
```fsharp
type DXFExportOptions =
    class
        inherit ACADExportOptions
    end
```

The DXFExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DXFExportOptions | Constructs a new instance of DXFImportOptions with default values of all properties. |
|  | DXFExportOptions(DXFExportOptions) | Constructs a new instance of DXFImportOptions as a copy of the export options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetPredefinedOptions | Returns an instance DXFExportOptions containing settings from a predefined export setup. |

#### Reference

Autodesk.Revit.DB Namespace