Revit 2026 API

# MeshTriangle Class

---

One triangle of a mesh.

SystemObject Autodesk.Revit.DBMeshTriangle

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MeshTriangle
```
```vb
Public Class MeshTriangle
```
```cpp
public ref class MeshTriangle
```
```fsharp
type MeshTriangle = class end
```

The MeshTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Index | The index of the vertex in the Vertices array of the mesh, for indexed access. |
|  | Vertex | A vertex of the triangle. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace