Revit 2026 API

# RoofType Class

---

Represents a specific type of roof.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBRoofType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoofType : HostObjAttributes
```
```vb
Public Class RoofType
	Inherits HostObjAttributes
```
```cpp
public ref class RoofType : public HostObjAttributes
```
```fsharp
type RoofType =
    class
        inherit HostObjAttributes
    end
```

The RoofType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the RoofType |

|  | Name | Description |
| --- | --- | --- |

All roof type objects available in the project can be retrieved from the Document object via the RoofTypes property. Every Roof object has a RoofType property that returns a RoofType object representing the type. This same RoofType property can also be used to change the type of the roof by setting it to a different type.

#### Reference

Autodesk.Revit.DB Namespace