Revit 2026 API

# ValueAtPoint Class

---

Stores values at one domain point. Each value corresponds to a "measurement" for which this value was calculated.

SystemObject Autodesk.Revit.DBValueAtPointBase Autodesk.Revit.DB.AnalysisValueAtPoint

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ValueAtPoint : ValueAtPointBase
```
```vb
Public Class ValueAtPoint
	Inherits ValueAtPointBase
```
```cpp
public ref class ValueAtPoint : public ValueAtPointBase
```
```fsharp
type ValueAtPoint =
    class
        inherit ValueAtPointBase
    end
```

The ValueAtPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ValueAtPoint(IListDouble) | Initializes a new instance of the ValueAtPoint class |
|  | ValueAtPoint(ValueAtPoint) | Creates a copy of the given ValueAtPoint instance. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Analysis Namespace