Revit 2026 API

# ContourSettingItem Class

---

Contour setting item that stores the information of a single contour or a set of contours.

SystemObject Autodesk.Revit.DBContourSettingItem

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ContourSettingItem : IDisposable
```
```vb
Public Class ContourSettingItem
	Implements IDisposable
```
```cpp
public ref class ContourSettingItem : IDisposable
```
```fsharp
type ContourSettingItem =
    class
        interface IDisposable
    end
```

The ContourSettingItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Start | The contour range start elevation. |
|  | Step | The increment elevation of the contour range. |
|  | Stop | The contour range stop elevation. |
|  | SubCategoryId | The contour line style subcategory id. |
|  | Type | The contour setting item type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ContourSettingItem |

#### Reference

Autodesk.Revit.DB Namespace