Revit 2026 API

# Curve Methods

---

The Curve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this curve. |
|  | ComputeClosestPoints |  |
|  | ComputeDerivatives | Returns the vectors describing the curve at the specified parameter. |
|  | ComputeNormalizedParameter | Computes the normalized curve parameter from the raw parameter. |
|  | ComputeRawParameter | Computes the raw parameter from the normalized parameter. |
|  | CreateOffset | Creates a new curve that is an offset of the existing curve. |
|  | CreateReversed | Creates a new curve with the opposite orientation of the existing curve. |
|  | CreateTransformed | Crates a new instance of a curve as a transformation of this curve. |
|  | Distance | Returns the shortest distance from the specified point to this curve. |
|  | Evaluate | Evaluates and returns the point that matches a parameter along the curve. |
|  | GetEndParameter | Returns the raw parameter value at the start or end of this curve. |
|  | GetEndPoint | Returns the 3D point at the start or end of this curve. |
|  | GetEndPointReference | Returns a stable reference to the start point or the end point of the curve. |
|  | Intersect(Curve) | **Obsolete.** Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, CurveIntersectResultOption) | Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, IntersectionResultArray) | **Obsolete.** Calculates the intersection of this curve with the specified curve and returns the intersection results. |
|  | IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds. |
|  | IsInside(Double, Int32) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index. |
|  | MakeBound | Changes the bounds of this curve to the specified values. |
|  | MakeUnbound | Makes this curve unbound. |
|  | Project | Projects the specified point on this curve. |
|  | SetGraphicsStyleId | Sets the graphics style id for this curve. |
|  | Tessellate | Valid only if the curve is bound. Returns a polyline approximation to the curve. |

#### Reference

Curve Class

Autodesk.Revit.DB Namespace