Revit 2026 API

# TextNoteOptions Methods

---

The TextNoteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

TextNoteOptions Class

Autodesk.Revit.DB Namespace