Revit 2026 API

# AnalyticalSurfaceBase Properties

---

The AnalyticalSurfaceBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchId | Sketch associated to this Revit element. |

#### Reference

AnalyticalSurfaceBase Class

Autodesk.Revit.DB.Structure Namespace