Revit 2026 API

# SpatialElementCalculationPoint Class

---

SpatialElementCalculationPoint is used as the search point for family instances placement inside rooms and spaces.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElementCalculationLocation Autodesk.Revit.DBSpatialElementCalculationPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementCalculationPoint : SpatialElementCalculationLocation
```
```vb
Public Class SpatialElementCalculationPoint
	Inherits SpatialElementCalculationLocation
```
```cpp
public ref class SpatialElementCalculationPoint : public SpatialElementCalculationLocation
```
```fsharp
type SpatialElementCalculationPoint =
    class
        inherit SpatialElementCalculationLocation
    end
```

The SpatialElementCalculationPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | The position of the "in" spatial element calculation point. |

|  | Name | Description |
| --- | --- | --- |

The Spatial Element Calculation Point is graphically showed as a location point marker with a "snake" line from the origin of the family. If the Spatial Element Calculation Point is turned on, this point will be used as a search point for room and space relations for all instances of this family.

#### Reference

Autodesk.Revit.DB Namespace