Revit 2026 API

# DoubleClickOptions Methods

---

The DoubleClickOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetAction | Returns the active user's desired action for a particular double-click target. |
|  | GetDoubleClickOptions | Returns the current user's DoubleClickOptions. |
|  | GetRenameOnSlowDoubleClickInProjectBrowser | Returns the user's desire to rename item in project browser on slow double-click. |
|  | IsSupportedAction | Checks whether the specified double-click target supports the specified action. |
|  | SetAction | Changes the double-click action associated with a specified target. |
|  | SetRenameOnSlowDoubleClickInProjectBrowser | Sets whether the desired action is to rename item in project browser on slow double-click. |

#### Reference

DoubleClickOptions Class

Autodesk.Revit.UI Namespace