Revit 2026 API

# RegenerationAttribute Class

---

The custom regeneration attribute to control the regeneration behavior of the external command or external application.

SystemObject SystemAttribute Autodesk.Revit.AttributesRegenerationAttribute

**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RegenerationAttribute : Attribute
```
```vb
Public Class RegenerationAttribute
	Inherits Attribute
```
```cpp
public ref class RegenerationAttribute : public Attribute
```
```fsharp
type RegenerationAttribute =
    class
        inherit Attribute
    end
```

The RegenerationAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RegenerationAttribute | Constructs a new RegenerationAttribute. |

|  | Name | Description |
| --- | --- | --- |
|  | Option | Regeneration option. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.Attributes Namespace