Revit 2026 API

# SpaceSetIterator Properties

---

The SpaceSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

SpaceSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace