Revit 2026 API

# IntegerParameterValue Properties

---

The IntegerParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

#### Reference

IntegerParameterValue Class

Autodesk.Revit.DB Namespace