Revit 2026 API

# CombinableElementArrayIterator Properties

---

The CombinableElementArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CombinableElementArrayIterator Class

Autodesk.Revit.DB Namespace