Revit 2026 API

# ExternalServiceOptions Methods

---

The ExternalServiceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExternalServiceOptions Class

Autodesk.Revit.DB.ExternalService Namespace