Revit 2026 API

# AssemblyDifferenceMemberCount Class

---

The two assemblies being compared have different number of members

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceMemberCount

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceMemberCount : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceMemberCount
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceMemberCount : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceMemberCount =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceMemberCount type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count1 | Number of members in the first assembly |
|  | Count2 | Number of members in the second assembly |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace