Revit 2026 API

# ModelCurveNode Class

---

A base class of output nodes that represent various model curves.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBModelCurveNode Autodesk.Revit.DBCurveNode Autodesk.Revit.DBPointNode Autodesk.Revit.DBPolylineNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelCurveNode : RenderNode
```
```vb
Public Class ModelCurveNode
	Inherits RenderNode
```
```cpp
public ref class ModelCurveNode : public RenderNode
```
```fsharp
type ModelCurveNode =
    class
        inherit RenderNode
    end
```

The ModelCurveNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace