Revit 2026 API

# PointNode Class

---

An output node that represents a 3D point.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBModelCurveNode Autodesk.Revit.DBPointNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointNode : ModelCurveNode
```
```vb
Public Class PointNode
	Inherits ModelCurveNode
```
```cpp
public ref class PointNode : public ModelCurveNode
```
```fsharp
type PointNode =
    class
        inherit ModelCurveNode
    end
```

The PointNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetPoint | Returns the point object corresponding to the node. |

See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPoint].

#### Reference

Autodesk.Revit.DB Namespace