Revit 2026 API

# ViewOrientation3D Class

---

Container for the point and vectors which define View3D's orientation.

SystemObject Autodesk.Revit.DBViewOrientation3D

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewOrientation3D : IDisposable
```
```vb
Public Class ViewOrientation3D
	Implements IDisposable
```
```cpp
public ref class ViewOrientation3D : IDisposable
```
```fsharp
type ViewOrientation3D =
    class
        interface IDisposable
    end
```

The ViewOrientation3D type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewOrientation3D | Constructs a new ViewOrientation3D using the input eye position, up and forward directions. |

|  | Name | Description |
| --- | --- | --- |
|  | EyePosition | The eye position point |
|  | ForwardDirection | The forward direction vector |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | UpDirection | The up direction vector |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ViewOrientation3D |

#### Reference

Autodesk.Revit.DB Namespace