Revit 2026 API

# AssetPropertyDistance Properties

---

The AssetPropertyDistance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Value of the property. |

#### Reference

AssetPropertyDistance Class

Autodesk.Revit.DB.Visual Namespace