Revit 2026 API

# ExtElemChangeBeamSectionRegistry Methods

---

The ExtElemChangeBeamSectionRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | RegisterInterface | Registers a IExtElemChangeBeamSection |
|  | Unregister | Unregisters IExtElemChangeBeamSection. |

#### Reference

ExtElemChangeBeamSectionRegistry Class

Autodesk.Revit.DB.Structure Namespace