Revit 2026 API

# OBJImportOptions Class

---

The import options used to import OBJ format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBOBJImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class OBJImportOptions : BaseImportOptions
```
```vb
Public Class OBJImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class OBJImportOptions : public BaseImportOptions
```
```fsharp
type OBJImportOptions =
    class
        inherit BaseImportOptions
    end
```

The OBJImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OBJImportOptions | Constructs a new instance of OBJImportOptions with default values of all properties. |
|  | OBJImportOptions(OBJImportOptions) | Constructs a new instance of OBJImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace