Revit 2026 API

# ArgumentException Methods

---

The ArgumentException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ArgumentException Class

Autodesk.Revit.Exceptions Namespace