Revit 2026 API

# RevitServerUnauthorizedException Methods

---

The RevitServerUnauthorizedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerUnauthorizedException Class

Autodesk.Revit.Exceptions Namespace