Revit 2026 API

# InitialLuminousIntensity Properties

---

The InitialLuminousIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Luminosity | The luminosity value. |

#### Reference

InitialLuminousIntensity Class

Autodesk.Revit.DB.Lighting Namespace