Revit 2026 API

# EnergyAnalysisConstruction Methods

---

The EnergyAnalysisConstruction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetMaterialIds | Returns a list of ids of the associated materials to analytical construction. |

#### Reference

EnergyAnalysisConstruction Class

Autodesk.Revit.DB.Analysis Namespace