Revit 2026 API

# ConicalFace Properties

---

The ConicalFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | HalfAngle | Half angle of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radii of the surface. |

#### Reference

ConicalFace Class

Autodesk.Revit.DB Namespace