Revit 2026 API

# WireConduitTypeSetIterator Methods

---

The WireConduitTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

WireConduitTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace