Revit 2026 API

# IFCConnectedWallData Methods

---

The IFCConnectedWallData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCConnectedWallData Class

Autodesk.Revit.DB.IFC Namespace