Revit 2026 API

# Vertex Class

---

The base class for DirectContext3D vertices.

SystemObject Autodesk.Revit.DB.DirectContext3DVertex Autodesk.Revit.DB.DirectContext3DVertexPosition Autodesk.Revit.DB.DirectContext3DVertexPositionColored Autodesk.Revit.DB.DirectContext3DVertexPositionNormal Autodesk.Revit.DB.DirectContext3DVertexPositionNormalColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Vertex : IDisposable
```
```vb
Public Class Vertex
	Implements IDisposable
```
```cpp
public ref class Vertex : IDisposable
```
```fsharp
type Vertex =
    class
        interface IDisposable
    end
```

The Vertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the Vertex |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace