Revit 2026 API

# FilterStringContains Class

---

Tests whether string values from the document contain a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringContains

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringContains : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringContains
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringContains : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringContains =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringContains type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringContains | Constructs an instance of FilterStringContains. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace