Revit 2026 API

# CategoryNameMapIterator Methods

---

The CategoryNameMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the map. |

#### Reference

CategoryNameMapIterator Class

Autodesk.Revit.DB Namespace