Revit 2026 API

# TemporaryGraphicsCommandData Methods

---

The TemporaryGraphicsCommandData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

TemporaryGraphicsCommandData Class

Autodesk.Revit.UI Namespace