Revit 2026 API

# ServerInternalException Methods

---

The ServerInternalException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ServerInternalException Class

Autodesk.Revit.Exceptions Namespace