Revit 2026 API

# RebarReinforcementData Class

---

class containing the id and the end of rebar on which the coupler stays

SystemObject Autodesk.Revit.DB.StructureReinforcementData Autodesk.Revit.DB.StructureRebarReinforcementData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarReinforcementData : ReinforcementData
```
```vb
Public Class RebarReinforcementData
	Inherits ReinforcementData
```
```cpp
public ref class RebarReinforcementData : public ReinforcementData
```
```fsharp
type RebarReinforcementData =
    class
        inherit ReinforcementData
    end
```

The RebarReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | End | The end of the rebar. The end should be 0 or 1. |
|  | RebarId | The id of the Rebar |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarReinforcementData, or  if the operation fails. |

#### Reference

Autodesk.Revit.DB.Structure Namespace