Revit 2026 API

# DisabledDisciplineException Methods

---

The DisabledDisciplineException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

DisabledDisciplineException Class

Autodesk.Revit.Exceptions Namespace