Revit 2026 API

# Fascia Class

---

An object that represents a fascia within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBHostedSweep Autodesk.Revit.DB.ArchitectureFascia

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Fascia : HostedSweep
```
```vb
Public Class Fascia
	Inherits HostedSweep
```
```cpp
public ref class Fascia : public HostedSweep
```
```fsharp
type Fascia =
    class
        inherit HostedSweep
    end
```

The Fascia type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FasciaType | Retrieves/set an object that represents the type of the Fascia. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSegment | Add segments to the fascia.(Overrides HostedSweepAddSegment(Reference)) |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

#### Reference

Autodesk.Revit.DB.Architecture Namespace