Revit 2026 API

# FilterStringLess Class

---

Tests whether string values from the document would sort before a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringLess

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringLess : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringLess
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringLess : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringLess =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringLess type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringLess | Constructs an instance of FilterStringLess. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace