Revit 2026 API

# FilterGlobalParameterAssociationRule Class

---

A filter rule that operates on global parameters ElementId values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterGlobalParameterAssociationRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterGlobalParameterAssociationRule : FilterNumericValueRule
```
```vb
Public Class FilterGlobalParameterAssociationRule
	Inherits FilterNumericValueRule
```
```cpp
public ref class FilterGlobalParameterAssociationRule : public FilterNumericValueRule
```
```fsharp
type FilterGlobalParameterAssociationRule =
    class
        inherit FilterNumericValueRule
    end
```

The FilterGlobalParameterAssociationRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterGlobalParameterAssociationRule | Constructs an instance of FilterGlobalParameterAssociationRule. |

|  | Name | Description |
| --- | --- | --- |
|  | RuleValue | The user-supplied global parameter value against which values from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace