Revit 2026 API

# ExportLineweightInfo Methods

---

The ExportLineweightInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportLineweightInfo Class

Autodesk.Revit.DB Namespace