Revit 2026 API

# ProjectBrowserOptions Methods

---

The ProjectBrowserOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetProjectBrowserOptions | Returns the current Revit instance's ProjectBrowserOptions. |

#### Reference

ProjectBrowserOptions Class

Autodesk.Revit.UI Namespace