Revit 2026 API

# CurveByPointsArray Class

---

An array that can contain CurveByPoints elements.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurveByPointsArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveByPointsArray : APIObject,
	IEnumerable
```
```vb
Public Class CurveByPointsArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class CurveByPointsArray : public APIObject,
	IEnumerable
```
```fsharp
type CurveByPointsArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The CurveByPointsArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveByPointsArray | Initializes a new instance of the CurveByPointsArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a curve at a specified index within the array. |
|  | Size | Returns the number of curves that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every curve from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace