Revit 2026 API

# LocationPoint Properties

---

The LocationPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Point | The physical location of the element. |
|  | Rotation | The angle of rotation around the insertion point, in radians. |

#### Reference

LocationPoint Class

Autodesk.Revit.DB Namespace