Revit 2026 API

# AnalyticalToPhysicalAssociationManager Properties

---

The AnalyticalToPhysicalAssociationManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EnableAssistedAssociation | Indicates if associations between Analytical and Physical Elements should be created automatically. |

#### Reference

AnalyticalToPhysicalAssociationManager Class

Autodesk.Revit.DB.Structure Namespace