Revit 2026 API

# ValidateCurveLoopsOptions Methods

---

The ValidateCurveLoopsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ValidateCurveLoopsOptions Class

Autodesk.Revit.DB Namespace