Revit 2026 API

# AssetPropertyFloat Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyFloat

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyFloat : AssetProperty
```
```vb
Public Class AssetPropertyFloat
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyFloat : public AssetProperty
```
```fsharp
type AssetPropertyFloat =
    class
        inherit AssetProperty
    end
```

The AssetPropertyFloat type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

Autodesk.Revit.DB.Visual Namespace