Revit 2026 API

# TabbedDialogExtension Class

---

Contains the information required to create and implement the behavior for the new tab inside the Revit options dialog.

SystemObject Autodesk.Revit.UITabbedDialogExtension

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TabbedDialogExtension
```
```vb
Public Class TabbedDialogExtension
```
```cpp
public ref class TabbedDialogExtension
```
```fsharp
type TabbedDialogExtension = class end
```

The TabbedDialogExtension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TabbedDialogExtension | Constructs a extension instance with a control and ok action handler. |

|  | Name | Description |
| --- | --- | --- |
|  | Control | The control. |
|  | OnCancelAction | The cancel handler. |
|  | OnOKAction | The ok handler. |
|  | OnRestoreDefaultsAction | The restore defaults handler. |

|  | Name | Description |
| --- | --- | --- |
|  | GetContextualHelp | Gets the contextual help. |
|  | SetContextualHelp | Sets the contextual help. |

Each page has an associated user interface control and the handlers of buttons Cancel, Restore Defaults and help can optionally be set. The size of the control is limited to 305 (height) x 288 (width) in physical pixels.

#### Reference

Autodesk.Revit.UI Namespace