Revit 2026 API

# DeleteWorksetSettings Methods

---

The DeleteWorksetSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

DeleteWorksetSettings Class

Autodesk.Revit.DB Namespace