Revit 2026 API

# ViewNode Properties

---

The ViewNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LevelOfDetail | The level of detail the view is going to be rendered at. |
|  | ViewId | The Id of the view element. |

#### Reference

ViewNode Class

Autodesk.Revit.DB Namespace