Revit 2026 API

# FamilyTypeSetIterator Class

---

An iterator to a FamilyType set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyTypeSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class FamilyTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class FamilyTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class FamilyTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type FamilyTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The FamilyTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace