Revit 2026 API

# PDFExportOptions Methods

---

The PDFExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetExportInBackground | Execute PDF export as a background process. |
|  | GetNamingRule | Gets a copy of the naming rule. |
|  | IsValidNamingRule |  |
|  | SetExportInBackground | Execute PDF export as a background process. |
|  | SetNamingRule |  |

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace