Revit 2026 API

# AssemblyCodeTable Class

---

AssemblyCodeTable represents the collection of ClassificationEntries for a document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBKeyBasedTreeEntryTable Autodesk.Revit.DBAssemblyCodeTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyCodeTable : KeyBasedTreeEntryTable
```
```vb
Public Class AssemblyCodeTable
	Inherits KeyBasedTreeEntryTable
```
```cpp
public ref class AssemblyCodeTable : public KeyBasedTreeEntryTable
```
```fsharp
type AssemblyCodeTable =
    class
        inherit KeyBasedTreeEntryTable
    end
```

The AssemblyCodeTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetAssemblyCodeTable | Returns the AssemblyCodeTable for the specified document. |

#### Reference

Autodesk.Revit.DB Namespace