Revit 2026 API

# AnalyticalNodeData Methods

---

The AnalyticalNodeData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetAnalyticalNodeData | Returns AnalyticalNodeData associated with this element, if it exists. |
|  | GetConnectionStatus | Returns the Connection Status for this Analytical Node. |

#### Reference

AnalyticalNodeData Class

Autodesk.Revit.DB.Structure Namespace