Revit 2026 API

# MullionTypeSetIterator Methods

---

The MullionTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

MullionTypeSetIterator Class

Autodesk.Revit.DB Namespace