Revit 2026 API

# Instance Class

---

The base class for all instance objects.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInstance More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Instance : Element
```
```vb
Public Class Instance
	Inherits Element
```
```cpp
public ref class Instance : public Element
```
```fsharp
type Instance =
    class
        inherit Element
    end
```

The Instance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetTotalTransform | Gets the total transform, which includes the true north transform for instances like import instances. |
|  | GetTransform | Gets the transform of the instance. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInstance Autodesk.Revit.DBFamilyInstance Autodesk.Revit.DBImportInstance Autodesk.Revit.DBPointCloudInstance Autodesk.Revit.DBProjectLocation Autodesk.Revit.DBRevitLinkInstance