Revit 2026 API

# ExternallyTaggedNonBRep Methods

---

The ExternallyTaggedNonBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SetUsage | Controls the usage of this ExternallyTaggedNonBRep. |

#### Reference

ExternallyTaggedNonBRep Class

Autodesk.Revit.DB Namespace