Revit 2026 API

# FaceSplitter Properties

---

The FaceSplitter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SplitElementId | The id of the element whose face is split by this element. |

#### Reference

FaceSplitter Class

Autodesk.Revit.DB Namespace