Revit 2026 API

# RebarCurvesData Methods

---

The RebarCurvesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddBarGeometry(CurveLoop) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
|  | AddBarGeometry(IListCurve) |  |
|  | CanAddBarGeometry | If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true. |
|  | ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
|  | Dispose |  |
|  | GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
|  | GetDistributionPath | Gets the distribution path currently stored in the rebar. |
|  | GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
|  | GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |
|  | SetDistributionPath |  |

#### Reference

RebarCurvesData Class

Autodesk.Revit.DB.Structure Namespace