Revit 2026 API

# RenderNode Methods

---

The RenderNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RenderNode Class

Autodesk.Revit.DB Namespace