Revit 2026 API

# TemporaryGraphicsCommandData Class

---

The context data that can be provided to OnClick(TemporaryGraphicsCommandData).

SystemObject Autodesk.Revit.UITemporaryGraphicsCommandData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
```
```vb
Public Class TemporaryGraphicsCommandData
	Implements IExternalData, IDisposable
```
```cpp
public ref class TemporaryGraphicsCommandData : IExternalData,
	IDisposable
```
```fsharp
type TemporaryGraphicsCommandData =
    class
        interface IExternalData
        interface IDisposable
    end
```

The TemporaryGraphicsCommandData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document. |
|  | Index | The unique index of the temporary graphics object managed by TemporaryGraphicsManager. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TemporaryGraphicsCommandData |

#### Reference

Autodesk.Revit.UI Namespace