Revit 2026 API

# RebarConstrainedHandle Class

---

A class representing a handle on a Rebar that can be joined to a reference, such as a host Element's surface or cover, another Rebar's handle or to a generic surface.

SystemObject Autodesk.Revit.DB.StructureRebarConstrainedHandle

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarConstrainedHandle : IDisposable
```
```vb
Public Class RebarConstrainedHandle
	Implements IDisposable
```
```cpp
public ref class RebarConstrainedHandle : IDisposable
```
```fsharp
type RebarConstrainedHandle =
    class
        interface IDisposable
    end
```

The RebarConstrainedHandle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HandleBehavior | Identifies the handle behavior. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CanSetBehavior | Checks if the input behavior can be set for this RebarConstrainedHandle. |
|  | Dispose | Releases all resources used by the RebarConstrainedHandle |
|  | GetCustomHandleTag | Returns the tag of the handle. The type of the handle should be 'CustomHandle'. |
|  | GetEdgeNumber | If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle. |
|  | GetHandleName | Gets the name of the handle. |
|  | GetHandleSurface | Gets the surface of this handle. |
|  | GetHandleType | Returns the RebarHandleType of a RebarConstrainedHandle. |
|  | GetPossibleHandleBehaviors | Gets a list of possible handle behaviors for the current handle. |
|  | IsCustomHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'. |
|  | IsEdgeHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'. |
|  | IsEqual | Checks if the specified RebarConstrainedHandle is the same as 'this'. |
|  | IsValid | Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid. |
|  | Move | Moves the handle with the specified vector. This function applies only for shape driven rebar. |

A rebar element's flexible geometry is controlled by several handles. The shape of the bar is controlled by a handle at each end of the bar and a handle each edge. Another handle is used to control the location of the plane in which the rebar lies. An additional handle controls the length of a set of rebar.

RebarConstrainedHandles can only be constructed internally by Revit. They are available to the API by querying a Rebar element's RebarConstraintsManager.

#### Reference

Autodesk.Revit.DB.Structure Namespace