Revit 2026 API

# AreaTag Properties

---

The AreaTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The area that the tag is associated with. |
|  | AreaTagType | The tag type. |

#### Reference

AreaTag Class

Autodesk.Revit.DB Namespace