Revit 2026 API

# RebarContainerIterator Methods

---

The RebarContainerIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |

#### Reference

RebarContainerIterator Class

Autodesk.Revit.DB.Structure Namespace