Revit 2026 API

# FilterStringBeginsWith Class

---

Tests whether string values from the document begin with a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringBeginsWith

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringBeginsWith : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringBeginsWith
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringBeginsWith : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringBeginsWith =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringBeginsWith type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringBeginsWith | Constructs an instance of FilterStringBeginsWith. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace