Revit 2026 API

# CurveByPointsArrayIterator Methods

---

The CurveByPointsArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

CurveByPointsArrayIterator Class

Autodesk.Revit.DB Namespace