Revit 2026 API

# LayoutRuleClearSpacing Class

---

This class indicate the layout rule of a Beam System is Clear-Spacing.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleClearSpacing

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LayoutRuleClearSpacing : LayoutRule
```
```vb
Public Class LayoutRuleClearSpacing
	Inherits LayoutRule
```
```cpp
public ref class LayoutRuleClearSpacing : public LayoutRule
```
```fsharp
type LayoutRuleClearSpacing =
    class
        inherit LayoutRule
    end
```

The LayoutRuleClearSpacing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LayoutRuleClearSpacing | Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in. |

|  | Name | Description |
| --- | --- | --- |
|  | JustifyType | Get or set the type of justification. |
|  | Spacing | Get or set the spacing of the beam system. |

|  | Name | Description |
| --- | --- | --- |

To use this type of LayoutRule, the distance between the beams and the justify-type must be set.

#### Reference

Autodesk.Revit.DB Namespace