Revit 2026 API

# GeometryElement Class

---

Geometric representation of an element.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBGeometryElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GeometryElement : GeometryObject,
	IEnumerable<GeometryObject>
```
```vb
Public Class GeometryElement
	Inherits GeometryObject
	Implements IEnumerable(Of GeometryObject)
```
```cpp
public ref class GeometryElement : public GeometryObject,
	IEnumerable<GeometryObject^>
```
```fsharp
type GeometryElement =
    class
        inherit GeometryObject
        interface IEnumerable<GeometryObject>
    end
```

The GeometryElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MaterialElement | Element describing the material from which this element is composed. |

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundingBox | Retrieves a box that encloses the geometry element. |
|  | GetEnumerator | Returns an enumerator that iterates through the collection. |
|  | GetEnumeratorNG | Returns an enumerator that iterates through the collection. |
|  | GetTransformed | Returns a transformed copy of the geometry in this element. |

This class contains geometric primitives that are generated from the parametric description of the element. The member geometric primitives can be obtained directly from this object using the capabilities of IEnumerable.

#### Reference

Autodesk.Revit.DB Namespace