Revit 2026 API

# SpatialElementTag Class

---

A tag attached to a SpatialElement (room, space or area) in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElementTag Autodesk.Revit.DB.ArchitectureRoomTag Autodesk.Revit.DBAreaTag Autodesk.Revit.DB.MechanicalSpaceTag

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementTag : Element
```
```vb
Public Class SpatialElementTag
	Inherits Element
```
```cpp
public ref class SpatialElementTag : public Element
```
```fsharp
type SpatialElementTag =
    class
        inherit Element
    end
```

The SpatialElementTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HasElbow | Identifies if the tag's leader has an elbow point or not. |
|  | HasLeader | Identifies if a leader is displayed for the tag or not. |
|  | IsOrphaned | Identifies if the tag is orphaned or not. |
|  | IsTaggingLink | Identifies if the tag has reference to a spatial element in a linked document or not. |
|  | LeaderElbow | The position of the leader's elbow (middle point). |
|  | LeaderEnd | The position of the leader's end. |
|  | Location | The location of the tag.(Overrides ElementLocation) |
|  | RotationAngle | The rotation angle of the tag relative to its view |
|  | TagHeadPosition | The position of the tag's head. |
|  | TagOrientation | The orientation of the tag. |
|  | TagText | The text displayed by the tag. |
|  | View | The view in which the tag was placed. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveToReferenceLocation | Moves the SpatialElementTag to the location of SpatialElement that the tag is associated with. |

SpatialElementTag is the base class for RoomTag, SpaceTag and AreaTag. Zone tag is not derived from SpatialElementTag. See IndependentTag for more information.

#### Reference

Autodesk.Revit.DB Namespace