Revit 2026 API

# IndexLine Properties

---

The IndexLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Index0 | The index of the line segment's first vertex. |
|  | Index1 | The index of the line segment's second vertex. |

#### Reference

IndexLine Class

Autodesk.Revit.DB.DirectContext3D Namespace