Revit 2026 API

# LocationPoint Class

---

Provides location functionality for all elements that have a single insertion point.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLocation Autodesk.Revit.DBLocationPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LocationPoint : Location
```
```vb
Public Class LocationPoint
	Inherits Location
```
```cpp
public ref class LocationPoint : public Location
```
```fsharp
type LocationPoint =
    class
        inherit Location
    end
```

The LocationPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Point | The physical location of the element. |
|  | Rotation | The angle of rotation around the insertion point, in radians. |

|  | Name | Description |
| --- | --- | --- |

The location point objects adds additional functionality to its base location object class. This includes setting the elements location to a specific point and retrieving its rotation around its insertion point. Inplace families do not have a single insertion point and therefore do not have meaningful LocationPoint data.

#### Reference

Autodesk.Revit.DB Namespace