Revit 2026 API

# Truss Properties

---

The Truss type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curves | Get all the truss curves. |
|  | Members | Get all the members of truss. |
|  | TrussType | Retrieve/set an object that represents the type of the truss. |

#### Reference

Truss Class

Autodesk.Revit.DB.Structure Namespace