Revit 2026 API

# SpatialFieldManager Class

---

Exposes all API for an external analysis application. Its primary role is creation, deletion and modification of SpatialFieldElement elements.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisSpatialFieldManager

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialFieldManager : Element
```
```vb
Public Class SpatialFieldManager
	Inherits Element
```
```cpp
public ref class SpatialFieldManager : public Element
```
```fsharp
type SpatialFieldManager =
    class
        inherit Element
    end
```

The SpatialFieldManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllowInteractiveSettings | If true interactive settings dialog and pick deletion are allowed. |
|  | CurrentMeasurement | Stores the currently displayed measurement |
|  | LegendPosition | Stores current position of analysis results legend element in view |
|  | LegendShowConfigurationName | If true legend contains analysis configuration name. |
|  | LegendShowDescription | If true legend contains analysis description. |
|  | LegendTextTypeId | Stores element id of text associated with common (result-independent) part of legend in view. |
|  | NumberOfMeasurements | Stores the total number of measurements |
|  | ResultsVisibleInView | Enables analysis results visibility in the view. |
|  | UseRangeForAllMeasurements | Governs how minimum and maximum values (the data range) are calculated. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSpatialFieldPrimitive | Creates empty analysis results primitive not associated with any geometry element |
|  | AddSpatialFieldPrimitive(Reference) | Creates an empty analysis results primitive associated with a reference. |
|  | AddSpatialFieldPrimitive(Curve, Transform) | Creates empty analysis results primitive associated with a curve and a transform. |
|  | AddSpatialFieldPrimitive(Face, Transform) | Creates empty analysis results primitive associated with a face and a transform. |
|  | AddSpatialFieldPrimitive(Reference, SpatialFieldPrimitiveHideMode) | Creates an empty analysis results primitive associated with a reference, with the option to control how the reference element is hidden. |
|  | Clear | Clear all analysis results managed by this manager object |
|  | CreateSpatialFieldManager | Factory method - creates manager object for the given view |
|  | GetLegend | Returns legend element or NULL |
|  | GetMaximum | Calculates the maximum value for all primitives |
|  | GetMinimum | Calculates the minimum value for all primitives |
|  | GetRegisteredResults | Returns an array of indices of all registered results |
|  | GetResultSchema | Returns result schema by index |
|  | GetSpatialFieldManager | Retrieves manager object for the given view or returns NULL |
|  | IsResultSchemaNameUnique | Verify the uniqueness of the name among all registered result schemas. |
|  | IsTextTypeIdValid | Verify if text type id is valid. |
|  | RegisterResult | Registers result and assigns it a unique result index |
|  | RemoveSpatialFieldPrimitive | Removes analysis results primitive identified by the unique index |
|  | SetMeasurementDescriptions |  |
|  | SetMeasurementNames |  |
|  | SetResultSchema | Sets a new value for an existing result schema in the result registry |
|  | UpdateSpatialFieldPrimitive | Populates analysis results data (or replaces the existing data) in the existing primitive identified by the unique index |

#### Reference

Autodesk.Revit.DB.Analysis Namespace