Revit 2026 API

# ApplicationEntryPoint Properties

---

The ApplicationEntryPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddinFolder | The full path to the Revit Macros module. |

#### Reference

ApplicationEntryPoint Class

Autodesk.Revit.UI.Macros Namespace