Revit 2026 API

# Polyloop Methods

---

The Polyloop type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComputeArea | Gets the area for this polygon. |
|  | Dispose |  |
|  | GetPoints | Gets the array of points in the polygon. |

#### Reference

Polyloop Class

Autodesk.Revit.DB.Analysis Namespace