Revit 2026 API

# Workset Properties

---

The Workset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEditable | Whether the workset is editable. |
|  | IsOpen | Whether the workset is open (rather than closed). |
|  | IsVisibleByDefault | Whether the workset is visible by default. |
|  | Kind | Kind of the workset. |

#### Reference

Workset Class

Autodesk.Revit.DB Namespace