Revit 2026 API

# LoadUsage Class

---

An object that represents a load usage.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureLoadUsage

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LoadUsage : Element
```
```vb
Public Class LoadUsage
	Inherits Element
```
```cpp
public ref class LoadUsage : public Element
```
```fsharp
type LoadUsage =
    class
        inherit Element
    end
```

The LoadUsage type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new LoadUsage. |

#### Reference

Autodesk.Revit.DB.Structure Namespace