Revit 2026 API

# ReloadLatestOptions Class

---

Options to control behavior of pure reload latest (not part of synchronize with central).

SystemObject Autodesk.Revit.DBReloadLatestOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReloadLatestOptions : IDisposable
```
```vb
Public Class ReloadLatestOptions
	Implements IDisposable
```
```cpp
public ref class ReloadLatestOptions : IDisposable
```
```fsharp
type ReloadLatestOptions =
    class
        interface IDisposable
    end
```

The ReloadLatestOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReloadLatestOptions | Constructs a new ReloadLatestOptions object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ReloadLatestOptions |

#### Reference

Autodesk.Revit.DB Namespace