Revit 2026 API

# DWFXExportOptions Class

---

DWFX Export options.

SystemObject Autodesk.Revit.DBCADExportOptions Autodesk.Revit.DBDWFExportOptions Autodesk.Revit.DBDWFXExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DWFXExportOptions : DWFExportOptions
```
```vb
Public Class DWFXExportOptions
	Inherits DWFExportOptions
```
```cpp
public ref class DWFXExportOptions : public DWFExportOptions
```
```fsharp
type DWFXExportOptions =
    class
        inherit DWFExportOptions
    end
```

The DWFXExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DWFXExportOptions | Default constructor. Sets all options to their default values. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace