Revit 2026 API

# AirSystemData Methods

---

The AirSystemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

AirSystemData Class

Autodesk.Revit.DB.Mechanical Namespace