Revit 2026 API

# ProjectLocationSet Properties

---

The ProjectLocationSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of project locations that are in the set. |

#### Reference

ProjectLocationSet Class

Autodesk.Revit.DB Namespace