Revit 2026 API

# StructuralSectionConcreteT Properties

---

The StructuralSectionConcreteT type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CantileverHeight | Flange cantilever thickness. |
|  | CantileverLength | Flange cantilever length. |

#### Reference

StructuralSectionConcreteT Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace