Revit 2026 API

# RebarShapeConstraintDiameter Properties

---

The RebarShapeConstraintDiameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the diameter. |

#### Reference

RebarShapeConstraintDiameter Class

Autodesk.Revit.DB.Structure Namespace