Revit 2026 API

# ElementSetIterator Properties

---

The ElementSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ElementSetIterator Class

Autodesk.Revit.DB Namespace