Revit 2026 API

# SolidGeometryOptions Class

---

A class containing optional information to control the geometry generation of the Solid by the SolidUtils routines.

SystemObject Autodesk.Revit.DBSolidGeometryOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SolidGeometryOptions : IDisposable
```
```vb
Public Class SolidGeometryOptions
	Implements IDisposable
```
```cpp
public ref class SolidGeometryOptions : IDisposable
```
```fsharp
type SolidGeometryOptions =
    class
        interface IDisposable
    end
```

The SolidGeometryOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SolidGeometryOptions | Creates a new SolidOptions class with solid tag settings. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SolidTag | Optional solid tag for the Solid. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SolidGeometryOptions |

#### Reference

Autodesk.Revit.DB Namespace