Revit 2026 API

# CorrectionFactorSetIterator Properties

---

The CorrectionFactorSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CorrectionFactorSetIterator Class

Autodesk.Revit.DB.Electrical Namespace