Revit 2026 API

# LoadNature Class

---

An object that represents a load nature.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureLoadNature

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LoadNature : Element
```
```vb
Public Class LoadNature
	Inherits Element
```
```cpp
public ref class LoadNature : public Element
```
```fsharp
type LoadNature =
    class
        inherit Element
    end
```

The LoadNature type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new LoadNature. |

#### Reference

Autodesk.Revit.DB.Structure Namespace