Revit 2026 API

# SpotLightDistribution Properties

---

The SpotLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SpotBeamAngle | The spot beam angle. |
|  | SpotFieldAngle | The spot field angle. |
|  | TiltAngle | The tilt angle. |

#### Reference

SpotLightDistribution Class

Autodesk.Revit.DB.Lighting Namespace