Revit 2026 API

# RadialDimension Methods

---

The RadialDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of an Radial Dimension element within the project. |

#### Reference

RadialDimension Class

Autodesk.Revit.DB Namespace