Revit 2026 API

# City Properties

---

The City type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Latitude | Latitude of the city |
|  | Longitude | Longitude of the city |
|  | Name | The name of the city |
|  | TimeZone | Time-zone in which the city resides |
|  | WeatherStation | An identifier for the nearest weather station |

#### Reference

City Class

Autodesk.Revit.DB Namespace