Revit 2026 API

# CheckoutElementsRequestTooLargeException Methods

---

The CheckoutElementsRequestTooLargeException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CheckoutElementsRequestTooLargeException Class

Autodesk.Revit.Exceptions Namespace