Revit 2026 API

# FormulaManager Methods

---

The FormulaManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Evaluate | Evaluates value of the formula |
|  | GetFunctions | Gets list of function names supported by formula engine |
|  | GetOperators | Gets list of operator names supported by formula engine |
|  | Validate | Validates the formuls |

#### Reference

FormulaManager Class

Autodesk.Revit.DB Namespace