Revit 2026 API

# ModelCurveArrArray Class

---

An array that can contain any type of object.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBModelCurveArrArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelCurveArrArray : APIObject,
	IEnumerable
```
```vb
Public Class ModelCurveArrArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ModelCurveArrArray : public APIObject,
	IEnumerable
```
```fsharp
type ModelCurveArrArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ModelCurveArrArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ModelCurveArrArray | Initializes a new instance of the ModelCurveArrArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets an item at a specified index within the array. |
|  | Size | Returns the number of objects that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every item from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace