Revit 2026 API

# ExportLinetypeKey Methods

---

The ExportLinetypeKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportLinetypeKey Class

Autodesk.Revit.DB Namespace