Revit 2026 API

# STLImportOptions Class

---

The import options used to import STL format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBSTLImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class STLImportOptions : BaseImportOptions
```
```vb
Public Class STLImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class STLImportOptions : public BaseImportOptions
```
```fsharp
type STLImportOptions =
    class
        inherit BaseImportOptions
    end
```

The STLImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | STLImportOptions | Constructs a new instance of STLImportOptions with default values of all properties. |
|  | STLImportOptions(STLImportOptions) | Constructs a new instance of STLImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace