Revit 2026 API

# Workset Methods

---

The Workset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new workset. |

#### Reference

Workset Class

Autodesk.Revit.DB Namespace