Revit 2026 API

# RebarSpliceGeometry Methods

---

The RebarSpliceGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RebarSpliceGeometry Class

Autodesk.Revit.DB.Structure Namespace