Revit 2026 API

# FaceToposolid Class

---

An object that represents a face-based Toposolid within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBFaceToposolid

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceToposolid : HostObject
```
```vb
Public Class FaceToposolid
	Inherits HostObject
```
```cpp
public ref class FaceToposolid : public HostObject
```
```fsharp
type FaceToposolid =
    class
        inherit HostObject
    end
```

The FaceToposolid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | GetReferencedFaces | Gets the referenced faces of the face toposolid |
|  | SetFaceReferences |  |
|  | UpdateToFace | Resets the face toposolid to its defining faces. |

#### Reference

Autodesk.Revit.DB Namespace