Revit 2026 API

# RibbonButton Class

---

This class is the base class of PushButton and PulldownButton.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRibbonButton Autodesk.Revit.UIPulldownButton Autodesk.Revit.UIPushButton

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RibbonButton : RibbonItem
```
```vb
Public Class RibbonButton
	Inherits RibbonItem
```
```cpp
public ref class RibbonButton : public RibbonItem
```
```fsharp
type RibbonButton =
    class
        inherit RibbonItem
    end
```

The RibbonButton type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image of the button. |
|  | IsEnabledByContext | Indicates if this button can be executed. True if the pushbutton is permitted to be executed based on the current Revit context (active document, active view and active tool). False if the pushbutton is disabled because of the active context. |
|  | LargeImage | The large image shown on the button. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace