Revit 2026 API

# HVACLoadSpaceType Class

---

The type element of space.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisHVACLoadType Autodesk.Revit.DB.AnalysisHVACLoadSpaceType

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HVACLoadSpaceType : HVACLoadType
```
```vb
Public Class HVACLoadSpaceType
	Inherits HVACLoadType
```
```cpp
public ref class HVACLoadSpaceType : public HVACLoadType
```
```fsharp
type HVACLoadSpaceType =
    class
        inherit HVACLoadType
    end
```

The HVACLoadSpaceType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPlenum | True if the space type is plenum. |
|  | SpaceTypeName | The space type name. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a space type. |
|  | IsNameUnique(String) | Determines whether a potential space type name is unique. |
|  | IsNameUnique(Document, String) | Determines whether a potential space type name is unique. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace