Revit 2026 API

# GenericZone Class

---

Provides access to the GenericZone Element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisGenericZone

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GenericZone : Element
```
```vb
Public Class GenericZone
	Inherits Element
```
```cpp
public ref class GenericZone : public Element
```
```fsharp
type GenericZone =
    class
        inherit Element
    end
```

The GenericZone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The area for the zone, in square feet. |
|  | GeometricDefinition | The geometric definition for this generic zone. |
|  | LevelOffset | The offset distance from this zone to the associated level. |
|  | OccupiedArea | The occupied area for the zone, in square feet. |
|  | OccupiedVolume | The occupied volume for the zone, in cubic feet. |
|  | Perimeter | The perimeter for the zone, in feet. |
|  | Volume | The volume for the zone, in cubic feet. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSpaces |  |
|  | ConvertSpaceBasedToSketchBased | Converts a space-based generic zone to a sketch-based generic zone. |
|  | Create | **Obsolete.** |
|  | CreateSketchBased |  |
|  | CreateSpaceBased |  |
|  | GetBoundaries | Gets the boundaries for the generic zone. |
|  | GetDomainData | Gets the domain data for the generic zone. |
|  | GetSketchId | Gets the sketch id for the generic zone. |
|  | GetSpaceIds | Gets a list of ElementIds of the associated spaces for the zone. |
|  | RemoveSpaces |  |

A generic zone is a tool that provides for a method of selecting elements that somehow come in contact with the zone object. A zone is a non-hierarchical structure of geometric information, area or volume definitions for the purpose of analysis. A generic zone will contain specific domain requirements provided at creation of the element.

#### Reference

Autodesk.Revit.DB.Analysis Namespace