Revit 2026 API

# ConnectorManager Class

---

Provides access to the Connector Manager

SystemObject Autodesk.Revit.DBConnectorManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConnectorManager : IDisposable
```
```vb
Public Class ConnectorManager
	Implements IDisposable
```
```cpp
public ref class ConnectorManager : IDisposable
```
```fsharp
type ConnectorManager =
    class
        interface IDisposable
    end
```

The ConnectorManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Connectors | Return all the Connectors of the Connector Manager. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Owner | This property is used to retrieve the owner of the Connector Manager. |
|  | UnusedConnectors | Return all the unused Connectors of the Connector Manager. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConnectorManager |
|  | Lookup | Lookup the connector using the unique index value that identify this connector. |

#### Reference

Autodesk.Revit.DB Namespace