Revit 2026 API

# GroupNode Methods

---

The GroupNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetTransform | A transformation matrix associated with the node. |

#### Reference

GroupNode Class

Autodesk.Revit.DB Namespace