Revit 2026 API

# EndTreatmentType Class

---

An end treatment type object that is used to hold information about the end treatment applied to bars that are connected to a coupler.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureEndTreatmentType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EndTreatmentType : ElementType
```
```vb
Public Class EndTreatmentType
	Inherits ElementType
```
```cpp
public ref class EndTreatmentType : public ElementType
```
```fsharp
type EndTreatmentType =
    class
        inherit ElementType
    end
```

The EndTreatmentType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndTreatment | String describing the end treatment |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document) | Creates a new EndTreatmentType in the specified document. |
|  | Create(Document, String) | Creates a new EndTreatmentType in the specified document and adds the input string to the endTreatment parameter. |
|  | CreateDefaultEndTreatmentType | Creates a new EndTreatmentType object with a default name. |

#### Reference

Autodesk.Revit.DB.Structure Namespace