Revit 2026 API

# DuctSizeSettings Properties

---

The DuctSizeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Item | Get the DuctSizes for this DuctShape. |

#### Reference

DuctSizeSettings Class

Autodesk.Revit.DB.Mechanical Namespace