Revit 2026 API

# Zone Methods

---

The Zone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddSpaces | **Obsolete.** Add a set of existing spaces to Zone element. |
|  | CreateAreaBasedLoad | Creates a new instance of an area based load and adds it to the document. |
|  | GetDomainData | Gets the domain data for the zone. |
|  | RemoveSpaces | **Obsolete.** Remove a set of existing spaces to the current Zone element. |

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace