Revit 2026 API

# BoundarySegment Methods

---

The BoundarySegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurve | Get a copy of the curve that is formed along this boundary. |

#### Reference

BoundarySegment Class

Autodesk.Revit.DB Namespace