Revit 2026 API

# RebarSpliceRules Methods

---

The RebarSpliceRules type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarSpliceRules with the default options. |
|  | Dispose |  |
|  | SetMaximumAndMinimumBarLength | Sets the maximum and minimum bar length. |

#### Reference

RebarSpliceRules Class

Autodesk.Revit.DB.Structure Namespace