Revit 2026 API

# PanelTypeSetIterator Class

---

An iterator to a panel type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPanelTypeSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PanelTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class PanelTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class PanelTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type PanelTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The PanelTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PanelTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace