Revit 2026 API

# ArgumentOutOfRangeException Methods

---

The ArgumentOutOfRangeException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ArgumentOutOfRangeException Class

Autodesk.Revit.Exceptions Namespace