Revit 2026 API

# WireTypeSetIterator Properties

---

The WireTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

WireTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace