Revit 2026 API

# WrongUserException Methods

---

The WrongUserException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

WrongUserException Class

Autodesk.Revit.Exceptions Namespace