Revit 2026 API

# TemperatureRatingTypeSetIterator Class

---

An iterator to a TemperatureRating type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalTemperatureRatingTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class TemperatureRatingTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class TemperatureRatingTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class TemperatureRatingTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type TemperatureRatingTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The TemperatureRatingTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TemperatureRatingTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace