Revit 2026 API

# KeyBasedTreeEntry Class

---

A key-based tree entry, containing the key, parent key, and children keys (if applicable).

SystemObject Autodesk.Revit.DBKeyBasedTreeEntry Autodesk.Revit.DBClassificationEntry Autodesk.Revit.DBKeynoteEntry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeyBasedTreeEntry : IDisposable
```
```vb
Public Class KeyBasedTreeEntry
	Implements IDisposable
```
```cpp
public ref class KeyBasedTreeEntry : IDisposable
```
```fsharp
type KeyBasedTreeEntry =
    class
        interface IDisposable
    end
```

The KeyBasedTreeEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Key | The key of this entry. |
|  | ParentKey | The parent key of this entry. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the KeyBasedTreeEntry |
|  | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. |

#### Reference

Autodesk.Revit.DB Namespace