Revit 2026 API

# IntersectionResultArrayIterator Properties

---

The IntersectionResultArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

IntersectionResultArrayIterator Class

Autodesk.Revit.DB Namespace