Revit 2026 API

# SketchBase Class

---

Provides access to the SketchBase in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSketchBase Autodesk.Revit.DBPath3d Autodesk.Revit.DBSketch

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SketchBase : Element
```
```vb
Public Class SketchBase
	Inherits Element
```
```cpp
public ref class SketchBase : public Element
```
```fsharp
type SketchBase =
    class
        inherit Element
    end
```

The SketchBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

SketchBase is the base class of Sketch.

#### Reference

Autodesk.Revit.DB Namespace