Revit 2026 API

# ClassificationEntry Class

---

Represents an entry in the classification table.

SystemObject Autodesk.Revit.DBKeyBasedTreeEntry Autodesk.Revit.DBClassificationEntry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ClassificationEntry : KeyBasedTreeEntry
```
```vb
Public Class ClassificationEntry
	Inherits KeyBasedTreeEntry
```
```cpp
public ref class ClassificationEntry : public KeyBasedTreeEntry
```
```fsharp
type ClassificationEntry =
    class
        inherit KeyBasedTreeEntry
    end
```

The ClassificationEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ClassificationEntry | Constructs a ClassificationEntry object |

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | The id of the category associated with this entry. |
|  | Description | The description associated with this entry. |
|  | Level | The entry level in the classification table. The expected range is between 1 and 5 inclusive. |

|  | Name | Description |
| --- | --- | --- |
|  | HasBadCategoryId | Checks if the category id is Revit BuiltInCategory id. |
|  | HasBadLevel | Checks if the level is an integer in range between 1 and 5 inclusive. |
|  | HasInvalidKey | Checks if the key matches the level and parent key. |

#### Reference

Autodesk.Revit.DB Namespace