Revit 2026 API

# VoltageTypeSet Properties

---

The VoltageTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of voltage types that are in the set. |

#### Reference

VoltageTypeSet Class

Autodesk.Revit.DB.Electrical Namespace