Revit 2026 API

# DuctPressureDropData Methods

---

The DuctPressureDropData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

DuctPressureDropData Class

Autodesk.Revit.DB.Mechanical Namespace