Revit 2026 API

# StairsLanding Properties

---

The StairsLanding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BaseElevation | The base elevation of the landing. |
|  | IsAutomaticLanding | True if the landing is an automatic landing, False otherwise. |
|  | Thickness | The thickness of the landing. |

#### Reference

StairsLanding Class

Autodesk.Revit.DB.Architecture Namespace