Revit 2026 API

# ProjectLocation Class

---

A representation of a specific instance and location of the current project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInstance Autodesk.Revit.DBProjectLocation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ProjectLocation : Instance
```
```vb
Public Class ProjectLocation
	Inherits Instance
```
```cpp
public ref class ProjectLocation : public Instance
```
```fsharp
type ProjectLocation =
    class
        inherit Instance
    end
```

The ProjectLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create an instance of ProjectLocation in the document. |
|  | Duplicate | Generate a copy of this project location with the specified name. |
|  | GetProjectPosition | Gets the coordinates of a point in the ProjectLocation's coordinate system. |
|  | GetSiteLocation | Gets the site location to which this project location refers. |
|  | IsProjectLocationNameUnique | Verifies that there is no existing ProjectLocation with the given name belonging to the given SiteLocation. |
|  | SetProjectPosition | Sets the coordinates of a point in the ProjectLocation's coordinate system. |

When using shared coordinates, ProjectLocations can be used to specify specific locations for instances of a linked model. A ProjectLocation keeps track of the position of an instance in relationship to the project's SiteLocation.

By default, each Revit project contains at least one named location, called Internal. Existing ProjectLocation objects can be found by using the ProjectLocations property on the Document object. New project locations can be created by duplicating an existing project location using the Duplicate method, and modifying the location's project position.

See also SiteLocation

#### Reference

Autodesk.Revit.DB Namespace