Revit 2026 API

# AssemblyMemberDifferentType Class

---

The two assembly members being compared have different type

SystemObject Autodesk.Revit.DBAssemblyMemberDifference Autodesk.Revit.DBAssemblyMemberDifferentType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyMemberDifferentType : AssemblyMemberDifference
```
```vb
Public Class AssemblyMemberDifferentType
	Inherits AssemblyMemberDifference
```
```cpp
public ref class AssemblyMemberDifferentType : public AssemblyMemberDifference
```
```fsharp
type AssemblyMemberDifferentType =
    class
        inherit AssemblyMemberDifference
    end
```

The AssemblyMemberDifferentType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TypeId1 | Type id of the first assembly member |
|  | TypeId2 | Type id of the second assembly member |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace