Revit 2026 API

# ElementArrayIterator Methods

---

The ElementArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ElementArrayIterator Class

Autodesk.Revit.DB Namespace