Revit 2026 API

# PointOnFace Methods

---

The PointOnFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFaceReference | Get a copy of the face reference. |
|  | SetFaceReference | Change the face reference. |

#### Reference

PointOnFace Class

Autodesk.Revit.DB Namespace