Revit 2026 API

# TilePattern Properties

---

The TilePattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TilePatternType | The built-in system tile pattern specified by this object. |
|  | TilesPerSeedNode | Get the number of tiles located at each seed node. |

#### Reference

TilePattern Class

Autodesk.Revit.DB Namespace