Revit 2026 API

# DocumentPrintedEventArgs Methods

---

The DocumentPrintedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFailedViewElementIds | Returns ElementIds of the views that that failed to print (if any). |
|  | GetPrintedViewElementIds | Returns ElementIds of the views that printed successfully. |

#### Reference

DocumentPrintedEventArgs Class

Autodesk.Revit.DB.Events Namespace