Revit 2026 API

# AssetSetIterator Methods

---

The AssetSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext |  |
|  | Reset |  |

#### Reference

AssetSetIterator Class

Autodesk.Revit.DB.Visual Namespace