Revit 2026 API

# FilterNumericEquals Class

---

Tests whether numeric values from the document are equal to a certain value

SystemObject Autodesk.Revit.DBFilterNumericRuleEvaluator Autodesk.Revit.DBFilterNumericEquals

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericEquals : FilterNumericRuleEvaluator
```
```vb
Public Class FilterNumericEquals
	Inherits FilterNumericRuleEvaluator
```
```cpp
public ref class FilterNumericEquals : public FilterNumericRuleEvaluator
```
```fsharp
type FilterNumericEquals =
    class
        inherit FilterNumericRuleEvaluator
    end
```

The FilterNumericEquals type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericEquals | Constructs an instance of FilterNumericEquals. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace