Revit 2026 API

# FilterElementIdRule Properties

---

The FilterElementIdRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

#### Reference

FilterElementIdRule Class

Autodesk.Revit.DB Namespace