Revit 2026 API

# EdgeArrayArrayIterator Class

---

An iterator to an array or edge arrays.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBEdgeArrayArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class EdgeArrayArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class EdgeArrayArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class EdgeArrayArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type EdgeArrayArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The EdgeArrayArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EdgeArrayArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace