Revit 2026 API

# DocumentPrintingEventArgs Methods

---

The DocumentPrintingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSettings | Gets the print settings of the active printing session. |
|  | GetViewElementIds | Returns ElementIds of the views to be printed. |

#### Reference

DocumentPrintingEventArgs Class

Autodesk.Revit.DB.Events Namespace