Revit 2026 API

# KeynoteEntries Class

---

A collection of KeynoteEntry objects that make up the keynote table.

SystemObject Autodesk.Revit.DBKeyBasedTreeEntries Autodesk.Revit.DBKeynoteEntries

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeynoteEntries : KeyBasedTreeEntries
```
```vb
Public Class KeynoteEntries
	Inherits KeyBasedTreeEntries
```
```cpp
public ref class KeynoteEntries : public KeyBasedTreeEntries
```
```fsharp
type KeynoteEntries =
    class
        inherit KeyBasedTreeEntries
    end
```

The KeynoteEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |

#### Reference

Autodesk.Revit.DB Namespace