Revit 2026 API

# ConnectorSetIterator Properties

---

The ConnectorSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ConnectorSetIterator Class

Autodesk.Revit.DB Namespace