Revit 2026 API

# FileArgumentNotFoundException Methods

---

The FileArgumentNotFoundException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

FileArgumentNotFoundException Class

Autodesk.Revit.Exceptions Namespace