Revit 2026 API

# RebarTrimExtendData Methods

---

The RebarTrimExtendData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddBarGeometry(CurveLoop) | Adds a new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
|  | AddBarGeometry(IListCurve) |  |
|  | CanAddBarGeometry | Returns true if getNumberOfBarGeometry() is less than GetNumberOfBars(), false otherwise. |
|  | ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
|  | CreateEndConstraint |  |
|  | CreateStartConstraint |  |
|  | Dispose |  |
|  | GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
|  | GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
|  | GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |

#### Reference

RebarTrimExtendData Class

Autodesk.Revit.DB.Structure Namespace