Revit 2026 API

# IntegerParameterValue Class

---

A class that holds an Integer value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBIntegerParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IntegerParameterValue : ParameterValue
```
```vb
Public Class IntegerParameterValue
	Inherits ParameterValue
```
```cpp
public ref class IntegerParameterValue : public ParameterValue
```
```fsharp
type IntegerParameterValue =
    class
        inherit ParameterValue
    end
```

The IntegerParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntegerParameterValue | Default constructor |
|  | IntegerParameterValue(Int32) | Value constructor |

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace