Revit 2026 API

# Ceiling Class

---

Represents a ceiling in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCeilingAndFloor Autodesk.Revit.DBCeiling

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Ceiling : CeilingAndFloor
```
```vb
Public Class Ceiling
	Inherits CeilingAndFloor
```
```cpp
public ref class Ceiling : public CeilingAndFloor
```
```fsharp
type Ceiling =
    class
        inherit CeilingAndFloor
    end
```

The Ceiling type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchId | Returns id of the sketch. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop, ElementId, ElementId) |  |
|  | Create(Document, IListCurveLoop, ElementId, ElementId, Line, Double) |  |
|  | GetCeilingGridLines | Get the geometric representation of the ceiling grid, optionally including the ceiling boundary. |

#### Reference

Autodesk.Revit.DB Namespace