Revit 2026 API

# DockableFrameFocusChangedEventArgs Properties

---

The DockableFrameFocusChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FocusGained | True if the pane is being activated, false if it is being inactivated. |
|  | PaneId | The identifier for dockable pane. |

#### Reference

DockableFrameFocusChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace