Revit 2026 API

# Line Methods

---

The Line type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateBound | Creates a new instance of a bound linear curve. |
|  | CreateUnbound | Creates a new instance of an unbound linear curve. |

#### Reference

Line Class

Autodesk.Revit.DB Namespace