Revit 2026 API

# SpanDirectionSymbol Class

---

Represents an instance of a Span Direction Symbol in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBIndependentTag Autodesk.Revit.DBSpanDirectionSymbol

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpanDirectionSymbol : IndependentTag
```
```vb
Public Class SpanDirectionSymbol
	Inherits IndependentTag
```
```cpp
public ref class SpanDirectionSymbol : public IndependentTag
```
```fsharp
type SpanDirectionSymbol =
    class
        inherit IndependentTag
    end
```

The SpanDirectionSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Places a new instance of the Span Direction Symbol into the project relative to a particular host element and view. |
|  | GetDefaultPlacementPoint | Gets the default placement point for the input element. The default position is in the middle of the bounding box of the top face. |

#### Reference

Autodesk.Revit.DB Namespace