Revit 2026 API

# AnalyticalPanel Properties

---

The AnalyticalPanel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Thickness | Panel thickness, in the Revit default units. |

#### Reference

AnalyticalPanel Class

Autodesk.Revit.DB.Structure Namespace