Revit 2026 API

# PathReinforcement Class

---

An object that represents an Path Reinforcement within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructurePathReinforcement

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PathReinforcement : Element
```
```vb
Public Class PathReinforcement
	Inherits Element
```
```cpp
public ref class PathReinforcement : public Element
```
```fsharp
type PathReinforcement =
    class
        inherit Element
    end
```

The PathReinforcement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AdditionalOffset | Additional offset of rebars in the Path Reinforcement. |
|  | AlternatingBarOrientation | Orientation of alternating bars of Path Reinforcement. |
|  | AlternatingBarShapeId | The RebarShape element that defines the shape of the alternating bars of the Path Reinforcement. |
|  | PathReinforcementType | Retrieves the type of the Path Reinforcement. |
|  | PrimaryBarOrientation | Orientation of primary bars of Path Reinforcement. |
|  | PrimaryBarShapeId | The RebarShape element that defines the shape of the primary bars of the Path Reinforcement. |

|  | Name | Description |
| --- | --- | --- |
|  | ConvertRebarInSystemToRebars | Converts all RebarInSystem elements owned by the input PathReinforcement to equivalent Rebar elements. |
|  | Create(Document, Element, IListCurve, Boolean, ElementId, ElementId, ElementId, ElementId) |  |
|  | Create(Document, Element, IListCurve, Boolean, ElementId, ElementId, ElementId, ElementId, ElementId) |  |
|  | GetCurveElementIds | Retrieves the set of ElementIds of curves forming the boundary of the Path Reinforcement. |
|  | GetHostId | The element that contains the Path Reinforcement. |
|  | GetOrCreateDefaultRebarShape | Creates a new RebarShape object with a default name or returns existing one which fulfills Path Reinforcement bending data requirements. |
|  | GetRebarInSystemIds | Returns the ids of the RebarInSystem elements owned by the PathReinforcement element. |
|  | IsAlternatingLayerEnabled | Checks if alternating bars are present in Path Reinforcement. |
|  | IsUnobscuredInView | Checks if Path Reinforcement is shown unobscured in a view. |
|  | IsValidAlternatingBarOrientation | Checks if orientation for alternating bars is valid. |
|  | IsValidPrimaryBarOrientation | Checks if orientation for primary bars is valid. |
|  | IsValidRebarShapeId | Identifies whether an element id corresponds to a Rebar Shape element which can be used in Path Reinforcement. |
|  | RemovePathReinforcementSystem | Deletes the specified PathReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements. |
|  | SetUnobscuredInView | Sets Path Reinforcement to be shown unobscured in a view. |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

#### Reference

Autodesk.Revit.DB.Structure Namespace