Revit 2026 API

# MEPAnalyticalSystem Class

---

Represents an analytical system where the air or water is circulated to satisfy building energy requirements.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.MechanicalMEPAnalyticalSystem

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPAnalyticalSystem : Element
```
```vb
Public Class MEPAnalyticalSystem
	Inherits Element
```
```cpp
public ref class MEPAnalyticalSystem : public Element
```
```fsharp
type MEPAnalyticalSystem =
    class
        inherit Element
    end
```

The MEPAnalyticalSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalyticalSystemDomain | The type of analytical system. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new analytical system |
|  | GetAirSystemData | Returns the air system data, null if not available. |
|  | GetWaterLoopData | Returns the water loop data, null if not available. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace