Revit 2026 API

# WireMaterialTypeSetIterator Methods

---

The WireMaterialTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

WireMaterialTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace