Revit 2026 API

# EnergyAnalysisDetailModelOptions Methods

---

The EnergyAnalysisDetailModelOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

EnergyAnalysisDetailModelOptions Class

Autodesk.Revit.DB.Analysis Namespace