Revit 2026 API

# FabricationPartRouteEnd Methods

---

The FabricationPartRouteEnd type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateFromCenterline | Create fabrication routing end from centerline point on straight element. |
|  | CreateFromConnector | Create fabrication routing end from connector end point. |
|  | Dispose |  |

#### Reference

FabricationPartRouteEnd Class

Autodesk.Revit.DB.Fabrication Namespace