Revit 2026 API

# FilterStringGreater Class

---

Tests whether string values from the document would sort after a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringGreater

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringGreater : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringGreater
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringGreater : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringGreater =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringGreater type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringGreater | Constructs an instance of FilterStringGreater. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace