Revit 2026 API

# JournalingAttribute Class

---

The custom journaling attribute to control the journaling behavior of the external command.

SystemObject SystemAttribute Autodesk.Revit.AttributesJournalingAttribute

**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class JournalingAttribute : Attribute
```
```vb
Public Class JournalingAttribute
	Inherits Attribute
```
```cpp
public ref class JournalingAttribute : public Attribute
```
```fsharp
type JournalingAttribute =
    class
        inherit Attribute
    end
```

The JournalingAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | JournalingAttribute | Constructs a new JournalingAttribute. |

|  | Name | Description |
| --- | --- | --- |
|  | Mode | Journaling mode. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.Attributes Namespace