Revit 2026 API

# ElementBinding Class

---

A base class for all types of binding that attach to an element.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBBinding Autodesk.Revit.DBElementBinding Autodesk.Revit.DBInstanceBinding Autodesk.Revit.DBTypeBinding

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ElementBinding : Binding
```
```vb
Public MustInherit Class ElementBinding
	Inherits Binding
```
```cpp
public ref class ElementBinding abstract : public Binding
```
```fsharp
[<AbstractClassAttribute>]
type ElementBinding =
    class
        inherit Binding
    end
```

The ElementBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieve or set the categories to which a parameter definition will be bound. |

|  | Name | Description |
| --- | --- | --- |

This base class provides methods that are common to all types of binding that work with elements.

#### Reference

Autodesk.Revit.DB Namespace