Revit 2026 API

# StructuralInstanceUsageFilter Properties

---

The StructuralInstanceUsageFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralUsage | The family instance structural usage. |

#### Reference

StructuralInstanceUsageFilter Class

Autodesk.Revit.DB.Structure Namespace