Revit 2026 API

# FilterStringRule Class

---

A filter rule that operates on string values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterStringRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringRule : FilterValueRule
```
```vb
Public Class FilterStringRule
	Inherits FilterValueRule
```
```cpp
public ref class FilterStringRule : public FilterValueRule
```
```fsharp
type FilterStringRule =
    class
        inherit FilterValueRule
    end
```

The FilterStringRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringRule | Constructs an instance of FilterStringRule. |

|  | Name | Description |
| --- | --- | --- |
|  | RuleString | The user-supplied string against which strings from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace