Revit 2026 API

# Ceiling Methods

---

The Ceiling type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop, ElementId, ElementId) |  |
|  | Create(Document, IListCurveLoop, ElementId, ElementId, Line, Double) |  |
|  | GetCeilingGridLines | Get the geometric representation of the ceiling grid, optionally including the ceiling boundary. |

#### Reference

Ceiling Class

Autodesk.Revit.DB Namespace