Revit 2026 API

# TableCellCalculatedValueData Methods

---

The TableCellCalculatedValueData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetName | Gets the name of the calculated value. |

#### Reference

TableCellCalculatedValueData Class

Autodesk.Revit.DB Namespace