Revit 2026 API

# UpdaterId Class

---

A unique identifier of an Updater

SystemObject Autodesk.Revit.DBUpdaterId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UpdaterId : IDisposable
```
```vb
Public Class UpdaterId
	Implements IDisposable
```
```cpp
public ref class UpdaterId : IDisposable
```
```fsharp
type UpdaterId =
    class
        interface IDisposable
    end
```

The UpdaterId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UpdaterId | creates an instance of UpdaterId for given AddInId and a given GUID value |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the UpdaterId |
|  | GetAddInId | AddInId of the UpdaterId |
|  | GetGUID | GUID value of the UpdaterId |

UpdaterID used as a key to register and unregister Updaters and UpdateTriggers in Revit application

#### Reference

Autodesk.Revit.DB Namespace