Revit 2026 API

# FilterOperatorAndTextString Methods

---

The FilterOperatorAndTextString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FilterOperatorAndTextString Class

Autodesk.Revit.DB Namespace