Revit 2026 API

# RebarShapeConstraintArcLength Class

---

An arc-length constraint associated with an arc in a RebarShapeDefinition.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintArcLength

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintArcLength : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintArcLength
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintArcLength : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintArcLength =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintArcLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintArcLength | Create an arc-length constraint. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Structure Namespace