Revit 2026 API

# DuctLining Methods

---

The DuctLining type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of duct lining. |

#### Reference

DuctLining Class

Autodesk.Revit.DB.Mechanical Namespace