Revit 2026 API

# RepeaterCoordinates Class

---

Represents coordinates in the array of repeating references in 0, 1, or 2 dimensions.

SystemObject Autodesk.Revit.DBRepeaterCoordinates

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RepeaterCoordinates : IDisposable
```
```vb
Public Class RepeaterCoordinates
	Implements IDisposable
```
```cpp
public ref class RepeaterCoordinates : IDisposable
```
```fsharp
type RepeaterCoordinates =
    class
        interface IDisposable
    end
```

The RepeaterCoordinates type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RepeaterCoordinates | Creates zero dimensional coordinates. |
|  | RepeaterCoordinates(Int32) | Creates one dimensional coordinates. |
|  | RepeaterCoordinates(Int32, Int32) | Creates two dimensional coordinates. |

|  | Name | Description |
| --- | --- | --- |
|  | DimensionCount | The number of dimensions of the coordinates (0, 1 or 2 for zero, one or two dimensional arrays.) |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RepeaterCoordinates |
|  | GetCoordinate | Returns the coordinate in the given dimension. |

#### Reference

Autodesk.Revit.DB Namespace