Revit 2026 API

# InsulationTypeSetIterator Class

---

An iterator to a insulation type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalInsulationTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class InsulationTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class InsulationTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class InsulationTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type InsulationTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The InsulationTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InsulationTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace