Revit 2026 API

# TableCellStyleOverrideOptions Methods

---

The TableCellStyleOverrideOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | SetAllOverrides | Sets all overrides to a specific value. |

#### Reference

TableCellStyleOverrideOptions Class

Autodesk.Revit.DB Namespace