Revit 2026 API

# ExportPatternInfo Class

---

A value used to represent the info stored in the ExportPatternTable.

SystemObject Autodesk.Revit.DBExportPatternInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportPatternInfo : IDisposable
```
```vb
Public Class ExportPatternInfo
	Implements IDisposable
```
```cpp
public ref class ExportPatternInfo : IDisposable
```
```fsharp
type ExportPatternInfo =
    class
        interface IDisposable
    end
```

The ExportPatternInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportPatternInfo | Constructs a new default ExportPatternInfo. |
|  | ExportPatternInfo(ExportPatternInfo) | Constructs a new copy of the input ExportPatternInfo object. |
|  | ExportPatternInfo(String) | Constructs a new ExportPatternInfo using the destination pattern name as input. |

|  | Name | Description |
| --- | --- | --- |
|  | DestinationPatternName | The destination pattern name (the name of the pattern in the exported format). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportPatternInfo |

#### Reference

Autodesk.Revit.DB Namespace