Revit 2026 API

# RibbonItemData Properties

---

The RibbonItemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LongDescription | Long description of the command tooltip |
|  | ToolTipImage | The image to show as a part of the button extended tooltip |

#### Reference

RibbonItemData Class

Autodesk.Revit.UI Namespace