Revit 2026 API

# SymbolicCurve Methods

---

The SymbolicCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the symbolic curve. |
|  | SetVisibility | Sets the visibility for the symbolic curve. |

#### Reference

SymbolicCurve Class

Autodesk.Revit.DB Namespace