Revit 2026 API

# PaperSource Class

---

An object that represents a Paper Source of Print Setup within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPaperSource

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PaperSource : APIObject
```
```vb
Public Class PaperSource
	Inherits APIObject
```
```cpp
public ref class PaperSource : public APIObject
```
```fsharp
type PaperSource =
    class
        inherit APIObject
    end
```

The PaperSource type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | Retrieve the paper source name of current project. |

|  | Name | Description |
| --- | --- | --- |

This object derived from the APIObject base object.

#### Reference

Autodesk.Revit.DB Namespace