Revit 2026 API

# RebarShapeConstraintRadius Class

---

A radius constraint associated with an arc in a RebarShapeDefinition.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintRadius

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintRadius : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintRadius
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintRadius : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintRadius =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintRadius type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintRadius | Create a radius constraint. |

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the radius. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Structure Namespace