Revit 2026 API

# EnergyAnalysisDetailModelOptions Class

---

Options that govern the calculations for the generation of the energy analysis detail model.

SystemObject Autodesk.Revit.DB.AnalysisEnergyAnalysisDetailModelOptions

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EnergyAnalysisDetailModelOptions : IDisposable
```
```vb
Public Class EnergyAnalysisDetailModelOptions
	Implements IDisposable
```
```cpp
public ref class EnergyAnalysisDetailModelOptions : IDisposable
```
```fsharp
type EnergyAnalysisDetailModelOptions =
    class
        interface IDisposable
    end
```

The EnergyAnalysisDetailModelOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EnergyAnalysisDetailModelOptions | Constructs default options for energy analysis detailed model creation. |

|  | Name | Description |
| --- | --- | --- |
|  | EnergyModelType | It indicates whether the energy model is based on rooms/spaces or building elements. |
|  | ExportMullions | Indicates if to specify the setting for exporting mullions. |
|  | IncludeShadingSurfaces | Indicates if to set and get the setting for if shading surfaces should be included. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SimplifyCurtainSystems | Indicates if to specify the setting for simplified curtain systems. |
|  | Tier | Level of computation for energy analysis model. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the EnergyAnalysisDetailModelOptions |

#### Reference

Autodesk.Revit.DB.Analysis Namespace