Revit 2026 API

# PointOnEdge Methods

---

The PointOnEdge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetEdgeReference | Get a copy of the edge or curve reference. |
|  | SetEdgeReference | Change the edge or curve reference. |

#### Reference

PointOnEdge Class

Autodesk.Revit.DB Namespace