Revit 2026 API

# BRepBuilderSurfaceGeometry Methods

---

The BRepBuilderSurfaceGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface. |
|  | CreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, Boolean, BoundingBoxUV) |  |
|  | CreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, IListDouble, Boolean, BoundingBoxUV) |  |
|  | Dispose |  |

#### Reference

BRepBuilderSurfaceGeometry Class

Autodesk.Revit.DB Namespace