Revit 2026 API

# LeaderArrayIterator Class

---

An iterator to an array of leaders.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLeaderArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class LeaderArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class LeaderArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class LeaderArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type LeaderArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The LeaderArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LeaderArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace