Revit 2026 API

# FlexDuct Methods

---

The FlexDuct type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IListXYZ) |  |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IListXYZ) |  |
|  | IsFlexDuctTypeId | Checks if given type is valid flexible duct type. |
|  | IsHVACSystemTypeId | Checks if given type is valid HVAC system type. |

#### Reference

FlexDuct Class

Autodesk.Revit.DB.Mechanical Namespace