Revit 2026 API

# DeleteWorksetSettings Class

---

This class represents the settings used to delete a workset.

SystemObject Autodesk.Revit.DBDeleteWorksetSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DeleteWorksetSettings : IDisposable
```
```vb
Public Class DeleteWorksetSettings
	Implements IDisposable
```
```cpp
public ref class DeleteWorksetSettings : IDisposable
```
```fsharp
type DeleteWorksetSettings =
    class
        interface IDisposable
    end
```

The DeleteWorksetSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DeleteWorksetSettings | Constructs a DeleteWorksetSettings object with DeleteWorksetOption::DeleteAllElements option. |
|  | DeleteWorksetSettings(DeleteWorksetOption, WorksetId) | Constructs a DeleteWorksetSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | DeleteWorksetOption | The current delete workset option. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | WorksetId | The target worksetId for those elements under the deleted workset, which is used for DeleteWorksetOption::MoveElementsToWorkset. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DeleteWorksetSettings |

#### Reference

Autodesk.Revit.DB Namespace