Revit 2026 API

# NumberingSchema Properties

---

The NumberingSchema type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MaximumStartingNumber | A static property defining the maximum number a numbering sequence can use as its starting number (the lowest number in the sequence). |
|  | NumberingParameterId | Id of the parameter that stores values of the numbers on enumerated elements. |
|  | SchemaType | Identifies the kind of elements/objects this numbering schema is used for. |

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace