Revit 2026 API

# SymbolicCurveArrayIterator Methods

---

The SymbolicCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

SymbolicCurveArrayIterator Class

Autodesk.Revit.DB Namespace