Revit 2026 API

# BackgroundTaskCancelledException Methods

---

The BackgroundTaskCancelledException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

BackgroundTaskCancelledException Class

Autodesk.Revit.Exceptions Namespace