Revit 2026 API

# RebarShapeConstraint Methods

---

The RebarShapeConstraint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetParamId | Return the Id of the parameter associated with this constraint. |

#### Reference

RebarShapeConstraint Class

Autodesk.Revit.DB.Structure Namespace