Revit 2026 API

# FaceDetailNode Methods

---

The FaceDetailNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetInstanceTransform | Returns instance transform of the object being drawn. |
|  | GetLinkTransform | Returns link transform of the object being drawn. |

#### Reference

FaceDetailNode Class

Autodesk.Revit.DB Namespace