Revit 2026 API

# StructuralSectionGeneralLA Properties

---

The StructuralSectionGeneralLA type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LipLength | Lip segment length. |

#### Reference

StructuralSectionGeneralLA Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace