Revit 2026 API

# DockablePaneProviderData Methods

---

The DockablePaneProviderData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFrameworkElement | Wrapper function that returns the FrameworkElement for this provider. |

#### Reference

DockablePaneProviderData Class

Autodesk.Revit.UI Namespace