Revit 2026 API

# StructuralConnectionHandlerType Properties

---

The StructuralConnectionHandlerType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionGuid | The GUID to use for identifying connection geometry generation algorithm. |

#### Reference

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace