Revit 2026 API

# IFCAggregateIterator Methods

---

The IFCAggregateIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | MoveNext | Increments the iterator to the next object in the IFCAggregate. |
|  | Reset | Resets the iterator to the beginning of the aggregate. |

#### Reference

IFCAggregateIterator Class

Autodesk.Revit.DB.IFC Namespace