Revit 2026 API

# CentralFileCommunicationException Methods

---

The CentralFileCommunicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CentralFileCommunicationException Class

Autodesk.Revit.Exceptions Namespace