Revit 2026 API

# RuledFace Class

---

A ruled face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBRuledFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RuledFace : Face
```
```vb
Public Class RuledFace
	Inherits Face
```
```cpp
public ref class RuledFace : public Face
```
```fsharp
type RuledFace =
    class
        inherit Face
    end
```

The RuledFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curve | Profile curves of the surface. |
|  | IsExtruded | Determines if this is an extruded ruled surface. |
|  | Point | Profile points of the surface. |
|  | RulingsAreParallel | Determines if the rulings of this ruled surface are parallel. |

|  | Name | Description |
| --- | --- | --- |

A ruled surface is created by sweeping a line between two profile curves or between a curve and a point (a point and a curve). For details on the parameterization, refer to the documentation for RuledSurface.

#### Reference

Autodesk.Revit.DB Namespace