Revit 2026 API

# MassSurfaceData Properties

---

The MassSurfaceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | Area of the references that the MassSurfaceData provides properties for. |
|  | CategoryIdForConceptualSurfaceType | Returns the mass subcategory ElementId used for ConceptualSurfaceType for this MassSurfaceData. |
|  | ConceptualConstructionId | The id of the conceptual construction associated with the reference surface. |
|  | IsConceptualConstructionByEnergyData | True when the ConceptualConstructionType id is synchronized to the EnergyDataSettings. False when the ConceptualConstructionType id is overridden for this MassSurfaceData. |
|  | IsGlazingShaded | Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing. |
|  | IsSlab | Indicates if a floor is a slab. |
|  | IsUnderground | Indicates if the roof, floor, slab, or wall surface reference is underground. |
|  | MassLevelDataId | The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData related to the same mass as the referenced face. |
|  | MaterialId | The visualization material used for the surface for displaying the energy analytical model. |
|  | MaterialType | material type of mass zone |
|  | PercentageGlazing | The target percentage of the reference wall surface that is to be covered with automatically generated windows. Revit will use this number when determining the size, shape, and location of automatically generated windows. |
|  | PercentageSkylights | The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights. |
|  | ReferenceElementId | The ElementId of the element whose face the MassSurfaceData primarily refers to. |
|  | ShadeDepth | How far any auto-generated shades should extend from the wall surface. |
|  | SillHeight | The height above the level where the bottoms of auto-generated windows will be located. |
|  | SkylightWidth | The length dimension to be used for the sides of each individual square skylight produced in the grid of auto-generated skylights. |
|  | SurfaceDataSource | Indicates whether the MassSurfaceData properties are driven by the EnergyDataSettings of the Document or are overridden for the surface. |

#### Reference

MassSurfaceData Class

Autodesk.Revit.DB.Analysis Namespace