Revit 2026 API

# AssetSet Methods

---

The AssetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear |  |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator |  |
|  | GetEnumerator |  |
|  | Insert |  |
|  | ReverseIterator |  |

#### Reference

AssetSet Class

Autodesk.Revit.DB.Visual Namespace