Revit 2026 API

# CableTrayType Methods

---

The CableTrayType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidBendMultiplier | Identifies if the input bend multiplier is valid. |

#### Reference

CableTrayType Class

Autodesk.Revit.DB.Electrical Namespace