Revit 2026 API

# ViewDisplaySketchyLines Methods

---

The ViewDisplaySketchyLines type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ViewDisplaySketchyLines Class

Autodesk.Revit.DB Namespace