Revit 2026 API

# Blend Methods

---

The Blend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles. |
|  | SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles. |

#### Reference

Blend Class

Autodesk.Revit.DB Namespace