Revit 2026 API

# MEPBuildingConstructionSetIterator Class

---

An iterator to a MEPBuildingConstruction set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.MechanicalMEPBuildingConstructionSetIterator

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class MEPBuildingConstructionSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class MEPBuildingConstructionSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class MEPBuildingConstructionSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type MEPBuildingConstructionSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The MEPBuildingConstructionSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MEPBuildingConstructionSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace