Revit 2026 API

# SystemZoneData Methods

---

The SystemZoneData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a system-zone data domain class. |

#### Reference

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace