Revit 2026 API

# ComboBox Properties

---

The ComboBox type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets or sets the current checked ComboBox member of the ComboBox. |
|  | Image | The image shown on the ComboBox. |

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace