Revit 2026 API

# ComboBoxCurrentChangedEventArgs Properties

---

The ComboBoxCurrentChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NewValue | The current item for the ComboBox after the change. |
|  | OldValue | The current item for the ComboBox before the change. |

#### Reference

ComboBoxCurrentChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace