Revit 2026 API

# ExternalCommandsData Methods

---

The ExternalCommandsData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExternalCommandsData Class

Autodesk.Revit.UI Namespace