Revit 2026 API

# CustomInitialColor Properties

---

The CustomInitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Temperature | The custom color temperature value. |

#### Reference

CustomInitialColor Class

Autodesk.Revit.DB.Lighting Namespace