Revit 2026 API

# ThinLinesOptions Class

---

A utility class containing setting related to the Thin Lines option which affects the display in the UI.

SystemObject Autodesk.Revit.UIThinLinesOptions

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ThinLinesOptions : IDisposable
```
```vb
Public Class ThinLinesOptions
	Implements IDisposable
```
```cpp
public ref class ThinLinesOptions : IDisposable
```
```fsharp
type ThinLinesOptions =
    class
        interface IDisposable
    end
```

The ThinLinesOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreThinLinesEnabled | A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ThinLinesOptions |

#### Reference

Autodesk.Revit.UI Namespace