Revit 2026 API

# ModelEllipse Class

---

Represents a ModelEllipse within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve Autodesk.Revit.DBModelEllipse

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelEllipse : ModelCurve
```
```vb
Public Class ModelEllipse
	Inherits ModelCurve
```
```cpp
public ref class ModelEllipse : public ModelCurve
```
```fsharp
type ModelEllipse =
    class
        inherit ModelCurve
    end
```

The ModelEllipse type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from ModelCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace