Revit 2026 API

# Extrusion Class

---

A extrusion solid or void form.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBExtrusion

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Extrusion : GenericForm
```
```vb
Public Class Extrusion
	Inherits GenericForm
```
```cpp
public ref class Extrusion : public GenericForm
```
```fsharp
type Extrusion =
    class
        inherit GenericForm
    end
```

The Extrusion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndOffset | The offset of the end of the extrusion relative to the sketch plane. |
|  | Sketch | Returns the Sketch of the Extrusion. |
|  | StartOffset | The offset of the start of the extrusion relative to the sketch plane. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace