Revit 2026 API

# RevitServerException Methods

---

The RevitServerException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerException Class

Autodesk.Revit.Exceptions Namespace