Revit 2026 API

# Ellipse Methods

---

The Ellipse type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateCurve | Creates a new geometric ellipse or elliptical arc object. |

#### Reference

Ellipse Class

Autodesk.Revit.DB Namespace