Revit 2026 API

# PolylineSegments Methods

---

The PolylineSegments type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetVertices | Returns an array of vertices of the polyline segments. |

#### Reference

PolylineSegments Class

Autodesk.Revit.DB Namespace