Revit 2026 API

# FunctionId Methods

---

The FunctionId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object. |

#### Reference

FunctionId Class

Autodesk.Revit.Exceptions Namespace