Revit 2026 API

# BuildingPad Class

---

Represents a BuildingPad element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCeilingAndFloor Autodesk.Revit.DB.ArchitectureBuildingPad

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BuildingPad : CeilingAndFloor
```
```vb
Public Class BuildingPad
	Inherits CeilingAndFloor
```
```cpp
public ref class BuildingPad : public CeilingAndFloor
```
```fsharp
type BuildingPad =
    class
        inherit CeilingAndFloor
    end
```

The BuildingPad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssociatedTopographySurfaceId | The element id of a topography surface created by the introduction of this building pad. |
|  | HostId | The element id of the topography surface hosting this BuidlingPad. |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | GetBoundary | Gets the boundary of current BuildingPad element. |
|  | SetBoundary |  |

#### Reference

Autodesk.Revit.DB.Architecture Namespace