Revit 2026 API

# CitySetIterator Properties

---

The CitySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CitySetIterator Class

Autodesk.Revit.DB Namespace