Revit 2026 API

# ExportPatternTableIterator Methods

---

The ExportPatternTableIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |

#### Reference

ExportPatternTableIterator Class

Autodesk.Revit.DB Namespace