Revit 2026 API

# ElementIntersectsSolidFilter Methods

---

The ElementIntersectsSolidFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSolid | Gets the target solid geometry. |

#### Reference

ElementIntersectsSolidFilter Class

Autodesk.Revit.DB Namespace