Revit 2026 API

# Arc Class

---

A circular arc.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBArc

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Arc : Curve
```
```vb
Public Class Arc
	Inherits Curve
```
```cpp
public ref class Arc : public Curve
```
```fsharp
type Arc =
    class
        inherit Curve
    end
```

The Arc type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Center | Returns the center of the arc. |
|  | Normal | Returns the normal to the plane in which the arc is defined. |
|  | Radius | Returns the radius of the arc. |
|  | XDirection | Returns the X direction. |
|  | YDirection | Returns the Y direction. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(XYZ, XYZ, XYZ) | Creates a new geometric arc object based on three points. |
|  | Create(Plane, Double, Double, Double) | Creates a new geometric arc object based on plane, radius, and angles. |
|  | Create(XYZ, Double, Double, Double, XYZ, XYZ) | Creates a new geometric arc object based on center, radius, unit vectors, and angles. |

The arc lies in the plane defined by center and normal.

#### Reference

Autodesk.Revit.DB Namespace