Revit 2026 API

# WorksharingTooltipInfo Methods

---

The WorksharingTooltipInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetRequesters | The ordered list of unique user names of users who have outstanding editing requests for the specified element. |

#### Reference

WorksharingTooltipInfo Class

Autodesk.Revit.DB Namespace