Revit 2026 API

# AreaReinforcementType Class

---

An object that specifies the type of a Structural Area Reinforcement element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureAreaReinforcementType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaReinforcementType : ElementType
```
```vb
Public Class AreaReinforcementType
	Inherits ElementType
```
```cpp
public ref class AreaReinforcementType : public ElementType
```
```fsharp
type AreaReinforcementType =
    class
        inherit ElementType
    end
```

The AreaReinforcementType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultAreaReinforcementType | Creates a new AreaReinforcementType object with a default name. |

The clear cover settings can be accessed via this object.

#### Reference

Autodesk.Revit.DB.Structure Namespace