Revit 2026 API

# AssetPropertyDoubleArray4d Class

---

Represents a color property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyDoubleArray4d

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyDoubleArray4d : AssetProperty
```
```vb
Public Class AssetPropertyDoubleArray4d
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyDoubleArray4d : public AssetProperty
```
```fsharp
type AssetPropertyDoubleArray4d =
    class
        inherit AssetProperty
    end
```

The AssetPropertyDoubleArray4d type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetValueAsColor | Gets the value property as a color. |
|  | GetValueAsDoubles | Gets the value property as doubles. |
|  | IsValidValue(Color) | Checks that the value is a valid value for this property. |
|  | IsValidValue(IListDouble) |  |
|  | SetValueAsColor | Sets the value property as a color. |
|  | SetValueAsDoubles |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace