Revit 2026 API

# CorrectionFactor Class

---

**Note: This API is now obsolete.**

Represents electrical correction factor information.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalCorrectionFactor

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")]
public class CorrectionFactor : APIObject
```
```vb
<ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")>
Public Class CorrectionFactor
	Inherits APIObject
```
```cpp
[ObsoleteAttribute(L"CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")]
public ref class CorrectionFactor : public APIObject
```
```fsharp
[<ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")>]
type CorrectionFactor =
    class
        inherit APIObject
    end
```

The CorrectionFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Factor | Get factor value of wire correction factor. |

|  | Name | Description |
| --- | --- | --- |
|  | GetTemperature | Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature. |

Correction factor is defined based on corresponding wire material type and temperature rating type.

#### Reference

Autodesk.Revit.DB.Electrical Namespace