Revit 2026 API

# TextBoxData Properties

---

The TextBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image of the TextBox. |

#### Reference

TextBoxData Class

Autodesk.Revit.UI Namespace