Revit 2026 API

# RebarBarType Properties

---

The RebarBarType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BarModelDiameter | Defines bar model diameter of rebar |
|  | BarNominalDiameter | Defines bar nominal diameter of rebar |
|  | DeformationType | Defines bar deformation type. |
|  | MaximumBendRadius | Defines maximum bend radius of rebar |
|  | StandardBendDiameter | Defines bar bend diameter for rebar whose style is standard |
|  | StandardHookBendDiameter | Defines hook bend diameter for rebar whose style is standard |
|  | StirrupTieBendDiameter | Defines bar and hook bend diameter for rebar whose style is stirrup/tie |

#### Reference

RebarBarType Class

Autodesk.Revit.DB.Structure Namespace