Revit 2026 API

# ModelCurveNode Properties

---

The ModelCurveNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn |

#### Reference

ModelCurveNode Class

Autodesk.Revit.DB Namespace