Revit 2026 API

# IMultiServerService Methods

---

The IMultiServerService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanExecute | Implement this to test whether a particular server should be executed. |

#### Reference

IMultiServerService Interface

Autodesk.Revit.DB.ExternalService Namespace