Revit 2026 API

# ParameterValuePresenceRule Class

---

Tests whether an element's parameter has a value or not.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBParameterValuePresenceRule Autodesk.Revit.DBHasNoValueFilterRule Autodesk.Revit.DBHasValueFilterRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ParameterValuePresenceRule : FilterRule
```
```vb
Public Class ParameterValuePresenceRule
	Inherits FilterRule
```
```cpp
public ref class ParameterValuePresenceRule : public FilterRule
```
```fsharp
type ParameterValuePresenceRule =
    class
        inherit FilterRule
    end
```

The ParameterValuePresenceRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Parameter | The parameter which will be evaluated to pass this rule. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace