Revit 2026 API

# UpdaterInfo Methods

---

The UpdaterInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

UpdaterInfo Class

Autodesk.Revit.DB Namespace