Revit 2026 API

# CurveByPointsUtils Class

---

A static class that contains methods for processing curves driven by points.

SystemObject Autodesk.Revit.DBCurveByPointsUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveByPointsUtils : IDisposable
```
```vb
Public Class CurveByPointsUtils
	Implements IDisposable
```
```cpp
public ref class CurveByPointsUtils : IDisposable
```
```fsharp
type CurveByPointsUtils =
    class
        interface IDisposable
    end
```

The CurveByPointsUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddCurvesToFaceRegion |  |
|  | CreateArcThroughPoints | Creates an arc through the given reference points. |
|  | CreateRectangle |  |
|  | Dispose | Releases all resources used by the CurveByPointsUtils |
|  | GetFaceRegions | Gets the FaceRegions in the existing face. |
|  | GetHostFace | Gets the host face to which the CurveElement is added. |
|  | GetProjectionType | Gets the projection type of the CurveElement. |
|  | GetSketchOnSurface | Gets the relationship between the CurveElement and face. |
|  | SetProjectionType | Sets the projection type of the CurveElement. |
|  | SetSketchOnSurface | Sets the relationship between the CurveElement and face. |
|  | ValidateCurveElementIdArrayForFaceRegions |  |

#### Reference

Autodesk.Revit.DB Namespace