Revit 2026 API

# CombinableElementArrayIterator Class

---

An iterator to an CombinableElement array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCombinableElementArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CombinableElementArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CombinableElementArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CombinableElementArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CombinableElementArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CombinableElementArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CombinableElementArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace