Revit 2026 API

# CurtainGridSetIterator Methods

---

The CurtainGridSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

CurtainGridSetIterator Class

Autodesk.Revit.DB Namespace