Revit 2026 API

# WallSweepInfo Methods

---

The WallSweepInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Determines if the input object is equivalent to this WallSweepInfo. |

#### Reference

WallSweepInfo Class

Autodesk.Revit.DB Namespace