Revit 2026 API

# ContinuousRail Methods

---

The ContinuousRail type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetEndExtensionPath | Retrieves the start extension path. |
|  | GetPath | Retrieves the rail path. |
|  | GetStartExtensionPath | Retrieves the start extension path. |
|  | GetSupports | Returns all the railing supports attached to the rail. |

#### Reference

ContinuousRail Class

Autodesk.Revit.DB.Architecture Namespace