Revit 2026 API

# Dimension Class

---

An object that represents a dimension within the Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDimension Autodesk.Revit.DBAngularDimension Autodesk.Revit.DBLinearDimension Autodesk.Revit.DBRadialDimension Autodesk.Revit.DBSpotDimension

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Dimension : Element
```
```vb
Public Class Dimension
	Inherits Element
```
```cpp
public ref class Dimension : public Element
```
```fsharp
type Dimension =
    class
        inherit Element
    end
```

The Dimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Above | The text shown above the segment's value. |
|  | AreReferencesAvailable | Indicates if this dimension's references can be resolved. |
|  | AreSegmentsEqual | Indicates if all segments are forced to be equal. |
|  | Below | The text shown below the segment's value. |
|  | Curve | A curve that represents the dimension line. |
|  | DimensionShape | The shape of this dimension. |
|  | DimensionType | The dimension style of this dimension. |
|  | FamilyLabel | The family parameter label of the dimension. |
|  | HasLeader | True if dimension has leader, false otherwise. |
|  | IsLocked | Indicates if this dimension is locked. |
|  | IsValid | Indicates if this dimension is valid. |
|  | LeaderEndPosition | The position of the dimension's leader end point. |
|  | Name | Retrieves or changes the name associated with the Dimension. |
|  | NumberOfSegments | The number of segments for the dimension. |
|  | Origin | The dimension origin. |
|  | Prefix | The text shown before the segment's value. |
|  | References | Returns an array of geometric references to which the dimension is attached. |
|  | Segments | The segments in the dimension. |
|  | Suffix | The text shown after the segment's value. |
|  | TextPosition | The position of the dimension text's drag point. |
|  | Value | The value of the dimension. |
|  | ValueOverride | The text that replaces the segment's value. |
|  | ValueString | The dimension value as a user visible string. |
|  | View | Supplies the view that contains the dimension if the dimension is view specific. |

|  | Name | Description |
| --- | --- | --- |
|  | HasOneSegment | Determines whether a dimension has one segment. |
|  | IsTextPositionAdjustable | Indicates if this dimension is supported to set/get TextPosition/LeaderEndPosition. |
|  | ResetTextPosition | Resets the text position of the dimension to the initial position determined by its type and parameters. |

#### Reference

Autodesk.Revit.DB Namespace