Revit 2026 API

# Conduit Methods

---

The Conduit type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of conduit. |
|  | IsValidConduitType | Identifies if a conduit type is valid. |

#### Reference

Conduit Class

Autodesk.Revit.DB.Electrical Namespace