Revit 2026 API

# ConnectorSetIterator Class

---

An iterator to a set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBConnectorSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ConnectorSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ConnectorSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ConnectorSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ConnectorSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ConnectorSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace