Revit 2026 API

# LinkConversionData Methods

---

The LinkConversionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetOptions | Extra information used during the creation of the Revit document. |

#### Reference

LinkConversionData Class

Autodesk.Revit.DB Namespace