Revit 2026 API

# BaseImportOptions Methods

---

The BaseImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetDefaultLengthUnit | Get the default length unit used for importing unitless files. |
|  | GetLayerSelection | Get all set layers name which user want to import into Revit. |
|  | SetDefaultLengthUnit | Set the default length unit used for importing unitless files. |
|  | SetLayerSelection |  |

#### Reference

BaseImportOptions Class

Autodesk.Revit.DB Namespace