Revit 2026 API

# AssetPropertyTime Properties

---

The AssetPropertyTime type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property |

#### Reference

AssetPropertyTime Class

Autodesk.Revit.DB.Visual Namespace