Revit 2026 API

# ReferenceWithContext Methods

---

The ReferenceWithContext type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetInstanceTransform | Gets the transform of the instance. |
|  | GetReference | Gets the reference of the geometric object. |

#### Reference

ReferenceWithContext Class

Autodesk.Revit.DB Namespace