Revit 2026 API

# LeaderArrayIterator Methods

---

The LeaderArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

LeaderArrayIterator Class

Autodesk.Revit.DB Namespace