Revit 2026 API

# FilterDoubleRule Class

---

A filter rule that operates on double-precision numeric values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterDoubleRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterDoubleRule : FilterNumericValueRule
```
```vb
Public Class FilterDoubleRule
	Inherits FilterNumericValueRule
```
```cpp
public ref class FilterDoubleRule : public FilterNumericValueRule
```
```fsharp
type FilterDoubleRule =
    class
        inherit FilterNumericValueRule
    end
```

The FilterDoubleRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterDoubleRule | Constructs an instance of FilterDoubleRule. |

|  | Name | Description |
| --- | --- | --- |
|  | Epsilon | The tolerance within which two floating-point values may be considered equal. |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace