Revit 2026 API

# WireMaterialTypeSetIterator Class

---

An iterator to a wire material type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireMaterialTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class WireMaterialTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class WireMaterialTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class WireMaterialTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type WireMaterialTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The WireMaterialTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireMaterialTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace