Revit 2026 API

# PathReinSpanSymbol Methods

---

The PathReinSpanSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of PathReinSpanSymbol in the project. |

#### Reference

PathReinSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace