Revit 2026 API

# NetworkCommunicationException Methods

---

The NetworkCommunicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

NetworkCommunicationException Class

Autodesk.Revit.Exceptions Namespace