Revit 2026 API

# FabricWireType Properties

---

The FabricWireType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendDiameter | Determines the bending diameter of the wire. |
|  | WireDiameter | Determines the diameter of the wire. |

#### Reference

FabricWireType Class

Autodesk.Revit.DB.Structure Namespace