Revit 2026 API

# GridNode Structure

---

A structure that represents a particular location in (U,V) from a grid.

SystemObject SystemValueType Autodesk.Revit.DBGridNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public struct GridNode
```
```vb
Public Structure GridNode
```
```cpp
public value class GridNode
```
```fsharp
[<SealedAttribute>]
type GridNode =
    struct
        inherit ValueType
    end
```

The GridNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GridNode | Initializes a new instance of the GridNode class |

|  | Name | Description |
| --- | --- | --- |
|  | UIndex | The node's index along the U axis. |
|  | VIndex | The node's index along the V axis. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace