Revit 2026 API

# MenuItem Methods

---

The MenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

MenuItem Class

Autodesk.Revit.UI Namespace