Revit 2026 API

# ConduitSize Methods

---

The ConduitSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ConduitSize Class

Autodesk.Revit.DB.Electrical Namespace