Revit 2026 API

# HostObject Methods

---

The HostObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FindInserts | Gets the ids of the instances inserted into this host object. |

#### Reference

HostObject Class

Autodesk.Revit.DB Namespace