Revit 2026 API

# LinkedResourceOpeningEventArgs Properties

---

The LinkedResourceOpeningEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LinkedResourcePathName | Path of the linked resource. |
|  | ResourceType | The desired linked resource type. |

#### Reference

LinkedResourceOpeningEventArgs Class

Autodesk.Revit.DB.Events Namespace