Revit 2026 API

# AreaTagFilter Class

---

A filter used to match area tags.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBAreaTagFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaTagFilter : ElementSlowFilter
```
```vb
Public Class AreaTagFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class AreaTagFilter : public ElementSlowFilter
```
```fsharp
type AreaTagFilter =
    class
        inherit ElementSlowFilter
    end
```

The AreaTagFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaTagFilter | Constructs a filter which matches only areas. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace