Revit 2026 API

# ModelCurve Methods

---

The ModelCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ChangeToReferenceLine | Changes this curve to a reference curve. |
|  | GetVisibility | Gets the visibility for the model curve in a family document. |
|  | SetVisibility | Sets the visibility for the model curve in a family document. |

#### Reference

ModelCurve Class

Autodesk.Revit.DB Namespace