Revit 2026 API

# DividedPath Methods

---

The DividedPath type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreCurveReferencesConnected |  |
|  | Create(Document, IListReference) |  |
|  | Create(Document, IListReference, ICollectionElementId) |  |
|  | Flip | Toggle the flipped value |
|  | GetIntersectingElements | Get the elements whose intersection with path produces points. |
|  | IsCurveReferenceValid | This returns true if the reference represents a curve or edge that can be used to create a divided path. |
|  | IsIntersectorValidForCreation | This returns true if the intersector is an element that can be used to intersect with a newly created divided path. |
|  | IsIntersectorValidForDividedPath | This returns true if the intersector is an element that can be used to intersect with the divided path. |
|  | IsValidBeginningIndent | Checks that the indent value does not cause the beginningIndent and endIndent to overlop |
|  | IsValidEndIndent | Checks that the indent value does not cause the beginningIndent and endIndent to overlop |
|  | IsValidFixedNumberOfPoints | Identifies if the indicated number of points is valid for assignment to a DividedPath with a layout type 'FixedNumber'. |
|  | IsValidMeasurementType | Checks that the measurement type enumeration value is valid |
|  | IsValidSpacingRuleJustification | Checks that the justification enumeration value is valid |
|  | IsValidSpacingRuleLayout | Checks that the spacing rule layout enumeration value is valid |
|  | SeparateReferencesIntoConnectedReferences |  |
|  | SetIntersectingElements |  |

#### Reference

DividedPath Class

Autodesk.Revit.DB Namespace