Revit 2026 API

# FamilySizeTableColumn Class

---

Contains column information for a FamilySizeTable.

SystemObject Autodesk.Revit.DBFamilySizeTableColumn

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySizeTableColumn : IDisposable
```
```vb
Public Class FamilySizeTableColumn
	Implements IDisposable
```
```cpp
public ref class FamilySizeTableColumn : IDisposable
```
```fsharp
type FamilySizeTableColumn =
    class
        interface IDisposable
    end
```

The FamilySizeTableColumn type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The column name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FamilySizeTableColumn |
|  | GetSpecTypeId | Gets the identifier of the spec describing values in the column. |
|  | GetUnitTypeId | Gets the identifier of the unit quantifying values in the column. |

#### Reference

Autodesk.Revit.DB Namespace