Revit 2026 API

# PanelTypeSetIterator Methods

---

The PanelTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

PanelTypeSetIterator Class

Autodesk.Revit.DB Namespace