Revit 2026 API

# FormArray Class

---

An array that contains form objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFormArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FormArray : APIObject, IEnumerable
```
```vb
Public Class FormArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class FormArray : public APIObject,
	IEnumerable
```
```fsharp
type FormArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The FormArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FormArray | Initializes a new instance of the FormArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a form at a specified index within the array. |
|  | Size | Returns the number of forms that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every form from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace