Revit 2026 API

# InvalidObjectException Methods

---

The InvalidObjectException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InvalidObjectException Class

Autodesk.Revit.Exceptions Namespace