Revit 2026 API

# IntersectingElementData Class

---

Stores information of an element that intersects with another element

SystemObject Autodesk.Revit.DBIntersectingElementData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IntersectingElementData : IDisposable
```
```vb
Public Class IntersectingElementData
	Implements IDisposable
```
```cpp
public ref class IntersectingElementData : IDisposable
```
```fsharp
type IntersectingElementData =
    class
        interface IDisposable
    end
```

The IntersectingElementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntersectedElementId | Id of the intersected element. |
|  | IntersectingElementId | Id of the intersecting element. |
|  | IntersectionType | The intersection type. |
|  | IntersectionVolume | The intersection volume. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IntersectingElementData |

#### Reference

Autodesk.Revit.DB Namespace