Revit 2026 API

# DuctFittingAndAccessoryConnectorData Methods

---

The DuctFittingAndAccessoryConnectorData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCoordination | Gets the coordination of the connector |

#### Reference

DuctFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Mechanical Namespace