Revit 2026 API

# ProjectPosition Class

---

ProjectPosition is a class used to represent a geographical offset and rotation. It can be used to represent the position of a project.

SystemObject Autodesk.Revit.DBProjectPosition

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ProjectPosition : IDisposable
```
```vb
Public Class ProjectPosition
	Implements IDisposable
```
```cpp
public ref class ProjectPosition : IDisposable
```
```fsharp
type ProjectPosition =
    class
        interface IDisposable
    end
```

The ProjectPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ProjectPosition(ProjectPosition) | Creates a copy of the ProjectPosition. |
|  | ProjectPosition(Double, Double, Double, Double) | Construct a new ProjectPosition with the specified East/West offset, North/South offset, elevation offset, and angle of rotation. |

|  | Name | Description |
| --- | --- | --- |
|  | Angle | Angle from True North. |
|  | EastWest | East/West offset. |
|  | Elevation | Elevation above ground level. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NorthSouth | North/South offset |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ProjectPosition |

#### Reference

Autodesk.Revit.DB Namespace