Revit 2026 API

# InSessionViewSheetSet Methods

---

The InSessionViewSheetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

InSessionViewSheetSet Class

Autodesk.Revit.DB Namespace