Revit 2026 API

# FamilySymbolFilter Class

---

A filter used to find all family symbols of the given family.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBFamilySymbolFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySymbolFilter : ElementQuickFilter
```
```vb
Public Class FamilySymbolFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class FamilySymbolFilter : public ElementQuickFilter
```
```fsharp
type FamilySymbolFilter =
    class
        inherit ElementQuickFilter
    end
```

The FamilySymbolFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilySymbolFilter | Constructs a new instance of a filter to find all family symbols of the given family. |

|  | Name | Description |
| --- | --- | --- |
|  | FamilyId | The family id. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

Note that it may be faster to get a list of symbol ids from GetFamilySymbolIds rather than to iterate all of the contents of a document with this filter applied.

#### Reference

Autodesk.Revit.DB Namespace