Revit 2026 API

# StdPostedWarning Methods

---

The StdPostedWarning type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

StdPostedWarning Class

Autodesk.Revit.DB Namespace