Revit 2026 API

# RoomTagFilter Class

---

A filter used to match room tags.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DB.ArchitectureRoomTagFilter

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoomTagFilter : ElementSlowFilter
```
```vb
Public Class RoomTagFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class RoomTagFilter : public ElementSlowFilter
```
```fsharp
type RoomTagFilter =
    class
        inherit ElementSlowFilter
    end
```

The RoomTagFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RoomTagFilter | Constructs a filter which matches only rooms. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB.Architecture Namespace