Revit 2026 API

# RebarCoverType Properties

---

The RebarCoverType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CoverDistance | A distance that can be used as a concrete cover value in a document. |

#### Reference

RebarCoverType Class

Autodesk.Revit.DB.Structure Namespace