Revit 2026 API

# ConnectionInputPoint Methods

---

The ConnectionInputPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ConnectionInputPoint Class

Autodesk.Revit.DB.Structure Namespace