Revit 2026 API

# FabricationConnectorInfo Methods

---

The FabricationConnectorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | HasDoubleWallConnector | Checks if there are any double wall connectors fabricated. |
|  | IsValid | Checks if the connector has fabrication parameters associated with it that can be set. |

#### Reference

FabricationConnectorInfo Class

Autodesk.Revit.DB Namespace