Revit 2026 API

# IndexTriangle Methods

---

The IndexTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

#### Reference

IndexTriangle Class

Autodesk.Revit.DB.DirectContext3D Namespace