Revit 2026 API

# AnnotationSymbol Properties

---

The AnnotationSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnnotationSymbolType | The AnnotationSymbol style of this AnnotationSymbol. |

#### Reference

AnnotationSymbol Class

Autodesk.Revit.DB Namespace