Revit 2026 API

# RevitAPIEventArgs Methods

---

The RevitAPIEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsCancelled | Indicates whether the event is being cancelled. |

#### Reference

RevitAPIEventArgs Class

Autodesk.Revit.DB.Events Namespace