Revit 2026 API

# StructuralElementDefinitionData Methods

---

The StructuralElementDefinitionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

StructuralElementDefinitionData Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace