Revit 2026 API

# FabricationPartType Class

---

Represents a fabrication component type in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBFabricationPartType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationPartType : ElementType
```
```vb
Public Class FabricationPartType
	Inherits ElementType
```
```cpp
public ref class FabricationPartType : public ElementType
```
```fsharp
type FabricationPartType =
    class
        inherit ElementType
    end
```

The FabricationPartType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a fabrication part type element based on a specific fabrication servic button and condition. |
|  | Lookup | Looks up an existing fabrication part type based on a specfic fabrication service button and condition. |

For the product-based MAP parts, every size is a new part type in Revit. For others, one part type can have many sizes.

#### Reference

Autodesk.Revit.DB Namespace