Revit 2026 API

# WorksharingDisplayGraphicSettings Methods

---

The WorksharingDisplayGraphicSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

WorksharingDisplayGraphicSettings Class

Autodesk.Revit.DB Namespace