Revit 2026 API

# MEPFamilyConnectorInfo Methods

---

The MEPFamilyConnectorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAssociateFamilyParameterId | Gets the associate family parameter id of the specified connector parameter id. |
|  | GetConnectorParameterValue | Gets the parameter value of the specified connector parameter id. |

#### Reference

MEPFamilyConnectorInfo Class

Autodesk.Revit.DB Namespace