Revit 2026 API

# ConnectorSetIterator Methods

---

The ConnectorSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

ConnectorSetIterator Class

Autodesk.Revit.DB Namespace