Revit 2026 API

# InvalidDataStreamException Methods

---

The InvalidDataStreamException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides IOExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InvalidDataStreamException Class

Autodesk.Revit.Exceptions Namespace