Revit 2026 API

# StructuralWallUsageFilter Properties

---

The StructuralWallUsageFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralWallUsage | The wall structural usage. |

#### Reference

StructuralWallUsageFilter Class

Autodesk.Revit.DB.Structure Namespace