Revit 2026 API

# TransactionAttribute Properties

---

The TransactionAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Mode | Transaction mode. |

#### Reference

TransactionAttribute Class

Autodesk.Revit.Attributes Namespace