Revit 2026 API

# PrimarySizeCriterion Methods

---

The PrimarySizeCriterion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | All | Creates a criterion with a range of all sizes. |
|  | None | Creates a criterion with a range of no sizes. |

#### Reference

PrimarySizeCriterion Class

Autodesk.Revit.DB Namespace