Revit 2026 API

# CurtainSystem Properties

---

The CurtainSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face. |
|  | CurtainSystemType | get or set the type of the CurtainSystem. |

#### Reference

CurtainSystem Class

Autodesk.Revit.DB Namespace