Revit 2026 API

# OrdinateDimensionSetting Methods

---

The OrdinateDimensionSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

OrdinateDimensionSetting Class

Autodesk.Revit.DB Namespace