Revit 2026 API

# Revolution Properties

---

The Revolution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Returns the Axis of the Revolution. |
|  | EndAngle | The end angle of the revolution relative to the sketch plane. |
|  | Sketch | Returns the Sketch of the Revolution. |
|  | StartAngle | The start angle of the revolution relative to the sketch plane. |

#### Reference

Revolution Class

Autodesk.Revit.DB Namespace