Revit 2026 API

# FreeFormElement Class

---

A Free Form Element that contains non-parametric geometry created from an input solid outline.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBFreeFormElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FreeFormElement : GenericForm
```
```vb
Public Class FreeFormElement
	Inherits GenericForm
```
```cpp
public ref class FreeFormElement : public GenericForm
```
```fsharp
type FreeFormElement =
    class
        inherit GenericForm
    end
```

The FreeFormElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | CanOffsetFace | Determines if the input face of the FreeFormElement can be offset. |
|  | Create | Creates a new FreeFormElement from a copy of the input geometry. |
|  | SetFaceOffset | Offsets a planar face of the free form element a certain distance in the normal direction. |
|  | UpdateSolidGeometry | Updates the geometry of the FreeForm element to the given shape preserving References to the existing geometry where possible (see remarks for rules). |

The element can participate in joins and void cuts with other combinable elements.

#### Reference

Autodesk.Revit.DB Namespace