Revit 2026 API

# CurveLoopIterator Class

---

An iterator to a curve loop.

SystemObject Autodesk.Revit.DBCurveLoopIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveLoopIterator : IEnumerator<Curve>
```
```vb
Public Class CurveLoopIterator
	Implements IEnumerator(Of Curve)
```
```cpp
public ref class CurveLoopIterator : IEnumerator<Curve^>
```
```fsharp
type CurveLoopIterator =
    class
        interface IEnumerator<Curve>
    end
```

The CurveLoopIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CurveLoopIterator |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |

#### Reference

Autodesk.Revit.DB Namespace