Revit 2026 API

# AreaReinforcementCurve Class

---

An object that specifies the type of a floor in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DB.StructureAreaReinforcementCurve

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaReinforcementCurve : CurveElement
```
```vb
Public Class AreaReinforcementCurve
	Inherits CurveElement
```
```cpp
public ref class AreaReinforcementCurve : public CurveElement
```
```fsharp
type AreaReinforcementCurve =
    class
        inherit CurveElement
    end
```

The AreaReinforcementCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curve | Returns the 3D curve forming part of the boundary of an Area Reinforcement element. |

|  | Name | Description |
| --- | --- | --- |

The structural layers of the floor can be accessed via this object.

#### Reference

Autodesk.Revit.DB.Structure Namespace