Revit 2026 API

# ExternallyTaggedBRep Methods

---

The ExternallyTaggedBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetTaggedGeometry | Returns the externally tagged geometry object. |

#### Reference

ExternallyTaggedBRep Class

Autodesk.Revit.DB Namespace