Revit 2026 API

# StructuralConnectionSettings Methods

---

The StructuralConnectionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetStructuralConnectionSettings | Obtains the StructuralConnectionSettings object for the specified project document. |

#### Reference

StructuralConnectionSettings Class

Autodesk.Revit.DB.Structure Namespace