Revit 2026 API

# FilterDialog Methods

---

The FilterDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Show | Shows the FilterDialog editing dialog to the user. |

#### Reference

FilterDialog Class

Autodesk.Revit.UI Namespace