Revit 2026 API

# ExclusionFilter Class

---

A filter used to exclude a set of elements automatically.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBExclusionFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExclusionFilter : ElementQuickFilter
```
```vb
Public Class ExclusionFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ExclusionFilter : public ElementQuickFilter
```
```fsharp
type ExclusionFilter =
    class
        inherit ElementQuickFilter
    end
```

The ExclusionFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExclusionFilter | Initializes a new instance of the ExclusionFilter class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetIdsToExclude | Returns the ids to be excluded by this filter. |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace