Revit 2026 API

# ExternalApplicationArrayIterator Properties

---

The ExternalApplicationArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ExternalApplicationArrayIterator Class

Autodesk.Revit.UI Namespace