Revit 2026 API

# StructuralConnectionType Properties

---

The StructuralConnectionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplyTo | Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns. |

#### Reference

StructuralConnectionType Class

Autodesk.Revit.DB.Structure Namespace