Revit 2026 API

# CentralModelContentionException Methods

---

The CentralModelContentionException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CentralModelContentionException Class

Autodesk.Revit.Exceptions Namespace