Revit 2026 API

# StructuralConnectionHandlerType Methods

---

The StructuralConnectionHandlerType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddElementsToCustomConnection | **Obsolete.** |
|  | Create(Document, String, Guid, String) | Creates a new StructuralConnectionHandlerType object. |
|  | Create(Document, String, Guid, String, ElementId) | Creates a new StructuralConnectionHandlerType object. |
|  | Create(Document, String, Guid, String, ElementId, IListConnectionInputPointInfo) |  |
|  | CreateDefaultStructuralConnectionHandlerType | Creates a new StructuralConnectionHandlerType object with a default name. |
|  | FindGenericConnectionType | Finds StructuralConnectionHandlerType which is Generic Connection type. |
|  | GetDefaultConnectionHandlerType | Gets a default type id for Structural Connection. |
|  | IsCustom | Checks if StructuralConnectionHandlerType is custom. |
|  | IsDetailed | Checks if StructuralConnectionHandlerType is detailed. |
|  | IsGeneric | Checks if StructuralConnectionHandlerType is generic. |
|  | IsTypeNameValidForCustomConnection | Validates if the input name matches the criteria of StructuralConnectionHandlerType name. Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\\/:*?";<> | or any of the non-printable characters. |
|  | RemoveMainSubelementsFromCustomConnection | **Obsolete.** |
|  | UpdateCustomConnectionType |  |

#### Reference

StructuralConnectionHandlerType Class

Autodesk.Revit.DB.Structure Namespace