Revit 2026 API

# WireTypeSet Properties

---

The WireTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of wire types that are in the set. |

#### Reference

WireTypeSet Class

Autodesk.Revit.DB.Electrical Namespace