Revit 2026 API

# NotTransmittedModelException Methods

---

The NotTransmittedModelException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

NotTransmittedModelException Class

Autodesk.Revit.Exceptions Namespace