Revit 2026 API

# ElementBinding Properties

---

The ElementBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieve or set the categories to which a parameter definition will be bound. |

#### Reference

ElementBinding Class

Autodesk.Revit.DB Namespace