Revit 2026 API

# MEPCalculationServerInfo Methods

---

The MEPCalculationServerInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetMEPCalculationServerInfo | Gets a MEPCalculationServerInfo by family instance. |

#### Reference

MEPCalculationServerInfo Class

Autodesk.Revit.DB Namespace