Revit 2026 API

# WallFoundation Class

---

An object that represents a wall foundation element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBWallFoundation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WallFoundation : HostObject
```
```vb
Public Class WallFoundation
	Inherits HostObject
```
```cpp
public ref class WallFoundation : public HostObject
```
```fsharp
type WallFoundation =
    class
        inherit HostObject
    end
```

The WallFoundation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WallId | Returns the id of the host wall. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new wall foundation within the project. |

#### Reference

Autodesk.Revit.DB Namespace