Revit 2026 API

# SpaceSetIterator Methods

---

The SpaceSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

SpaceSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace