Revit 2026 API

# RebarShapeConstraintDiameter Class

---

A diameter constraint associated with an arc in a RebarShapeDefinition.

SystemObject Autodesk.Revit.DB.StructureRebarShapeConstraint Autodesk.Revit.DB.StructureRebarShapeConstraintDiameter

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarShapeConstraintDiameter : RebarShapeConstraint
```
```vb
Public Class RebarShapeConstraintDiameter
	Inherits RebarShapeConstraint
```
```cpp
public ref class RebarShapeConstraintDiameter : public RebarShapeConstraint
```
```fsharp
type RebarShapeConstraintDiameter =
    class
        inherit RebarShapeConstraint
    end
```

The RebarShapeConstraintDiameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarShapeConstraintDiameter | Create a diameter constraint. |

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the diameter. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Structure Namespace