Revit 2026 API

# DoubleArrayIterator Class

---

An iterator to an array of doubles.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDoubleArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class DoubleArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class DoubleArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class DoubleArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type DoubleArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The DoubleArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DoubleArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace