Revit 2026 API

# ColorSelectionDialog Methods

---

The ColorSelectionDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Show | Shows the Revit Color dialog as a modal dialog. |

#### Reference

ColorSelectionDialog Class

Autodesk.Revit.UI Namespace