Revit 2026 API

# UIMacroManager Methods

---

The UIMacroManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddModule | Adds a MacroModule to the application. |
|  | Dispose |  |
|  | GetMacroManager | Gets the UI Macro manager from the UI application. |
|  | RemoveModule | Removes a MacroModule. |

#### Reference

UIMacroManager Class

Autodesk.Revit.UI.Macros Namespace