Revit 2026 API

# ModuleSettings Class

---

The module settings.

SystemObject Autodesk.Revit.DB.MacrosModuleSettings

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModuleSettings : IDisposable
```
```vb
Public Class ModuleSettings
	Implements IDisposable
```
```cpp
public ref class ModuleSettings : IDisposable
```
```fsharp
type ModuleSettings =
    class
        interface IDisposable
    end
```

The ModuleSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ModuleSettings | Constructs a new module settings. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MacroLanguageType | The Macro language type. |
|  | Name | The module name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ModuleSettings |

#### Reference

Autodesk.Revit.DB.Macros Namespace