Revit 2026 API

# InitialIlluminanceIntensity Properties

---

The InitialIlluminanceIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Distance | The illuminance intensity distance value. |
|  | Illuminance | The illuminance intensity value. |

#### Reference

InitialIlluminanceIntensity Class

Autodesk.Revit.DB.Lighting Namespace