Revit 2026 API

# SlabShapeCreaseArrayIterator Class

---

An iterator to an array of creases used for Slab Shape Editing.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSlabShapeCreaseArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class SlabShapeCreaseArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class SlabShapeCreaseArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class SlabShapeCreaseArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type SlabShapeCreaseArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The SlabShapeCreaseArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SlabShapeCreaseArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace