Revit 2026 API

# CorrectionFactorSet Class

---

A set that contains correction factors.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalCorrectionFactorSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CorrectionFactorSet : APIObject,
	IEnumerable
```
```vb
Public Class CorrectionFactorSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class CorrectionFactorSet : public APIObject,
	IEnumerable
```
```fsharp
type CorrectionFactorSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The CorrectionFactorSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CorrectionFactorSet | Initializes a new instance of the CorrectionFactorSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of correction factors that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every correction factor from the set, rendering it empty. |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace