Revit 2026 API

# StructuralSectionGeneralCEx Properties

---

The StructuralSectionGeneralCEx type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FoldLength | Fold segment length. |
|  | LipLength | Lip segment length. |

#### Reference

StructuralSectionGeneralCEx Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace