Revit 2026 API

# MechanicalSystemType Class

---

Base class for duct system types

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBMEPSystemType Autodesk.Revit.DB.MechanicalMechanicalSystemType

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MechanicalSystemType : MEPSystemType
```
```vb
Public Class MechanicalSystemType
	Inherits MEPSystemType
```
```cpp
public ref class MechanicalSystemType : public MEPSystemType
```
```fsharp
type MechanicalSystemType =
    class
        inherit MEPSystemType
    end
```

The MechanicalSystemType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RiseDropSettings | indicates the rise/drop symbol given the system type |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a mechanical system type and adds it to the document. |
|  | ValidateRiseDropSymbolType | Confirms if the parameter is a valid HVAC rise/drop symbol type. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace