Revit 2026 API

# ModificationOutsideTransactionException Methods

---

The ModificationOutsideTransactionException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ModificationOutsideTransactionException Class

Autodesk.Revit.Exceptions Namespace