Revit 2026 API

# ConnectorSet Properties

---

The ConnectorSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

ConnectorSet Class

Autodesk.Revit.DB Namespace