Revit 2026 API

# ParameterElement Class

---

An Element that stores a user-defined parameter.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBParameterElement Autodesk.Revit.DBGlobalParameter Autodesk.Revit.DBSharedParameterElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ParameterElement : Element
```
```vb
Public Class ParameterElement
	Inherits Element
```
```cpp
public ref class ParameterElement : public Element
```
```fsharp
type ParameterElement =
    class
        inherit Element
    end
```

The ParameterElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetDefinition | Get the definition representing this parameter element. |

Revit supports both built-in and user-defined parameters. Built-in parameters ship with the application, and they are not stored in Revit documents. User-defined parameters are dynamically created, and they are stored in the documents that use them, wrapped in ParameterElement objects. Different subclasses of ParemeterElement represent different kinds of user-defined parameters.

#### Reference

Autodesk.Revit.DB Namespace