Revit 2026 API

# PipeFittingAndAccessoryPressureDropUIData Methods

---

The PipeFittingAndAccessoryPressureDropUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetUIDataItems | Gets all UI data items stored in the UI data. |
|  | GetUnits | Gets units. |

#### Reference

PipeFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Plumbing Namespace