Revit 2026 API

# Mullion Methods

---

The Mullion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BreakMullion | This method is used to break the current Mullion at ends with its neighboring mullions. |
|  | JoinMullion | This method is used to control the join condition the current Mullion with its neighboring mullions. |

#### Reference

Mullion Class

Autodesk.Revit.DB Namespace