Revit 2026 API

# ThermalAsset Methods

---

The ThermalAsset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Produces a copy of the asset. |
|  | Dispose |  |
|  | Equals(ThermalAsset) | Determines whether this thermal asset is equal to another. |
|  | EqualsThermalOnly | Determines whether this thermal asset is equal to another, but ignore data from base class. |

#### Reference

ThermalAsset Class

Autodesk.Revit.DB Namespace