Revit 2026 API

# TextNode Methods

---

The TextNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFormattedText | Returns an FormattedText object that contains text and associated formatting of this TextNode. |

#### Reference

TextNode Class

Autodesk.Revit.DB Namespace