Revit 2026 API

# CylindricalSurface Methods

---

The CylindricalSurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Construct a cylindrical surface defined by a local coordinate system and a radius. |
|  | GetFrameOfReference | Returns frame of reference associated with this CylindricalSurface. |

#### Reference

CylindricalSurface Class

Autodesk.Revit.DB Namespace