Revit 2026 API

# VertexStreamPositionNormalColored Class

---

A stream that can be used to write vertices of type VertexPositionNormalColored into a buffer (see VertexBuffer).

SystemObject Autodesk.Revit.DB.DirectContext3DVertexStream Autodesk.Revit.DB.DirectContext3DVertexStreamPositionNormalColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexStreamPositionNormalColored : VertexStream
```
```vb
Public Class VertexStreamPositionNormalColored
	Inherits VertexStream
```
```cpp
public ref class VertexStreamPositionNormalColored : public VertexStream
```
```fsharp
type VertexStreamPositionNormalColored =
    class
        inherit VertexStream
    end
```

The VertexStreamPositionNormalColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionNormalColored into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace