Revit 2026 API

# MEPAnalyticalSystem Properties

---

The MEPAnalyticalSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalyticalSystemDomain | The type of analytical system. |

#### Reference

MEPAnalyticalSystem Class

Autodesk.Revit.DB.Mechanical Namespace