Revit 2026 API

# ReleaseConditions Methods

---

The ReleaseConditions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ReleaseConditions Class

Autodesk.Revit.DB.Structure Namespace