Revit 2026 API

# WorksetFilter Methods

---

The WorksetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

WorksetFilter Class

Autodesk.Revit.DB Namespace