Revit 2026 API

# SlabShapeVertexArrayIterator Class

---

An iterator to an array of vertices used for Slab Shape Editing.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSlabShapeVertexArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class SlabShapeVertexArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class SlabShapeVertexArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class SlabShapeVertexArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type SlabShapeVertexArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The SlabShapeVertexArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SlabShapeVertexArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace