Revit 2026 API

# CameraInfo Methods

---

The CameraInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

CameraInfo Class

Autodesk.Revit.DB Namespace