Revit 2026 API

# CurveOverlapPoint Methods

---

The CurveOverlapPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

CurveOverlapPoint Class

Autodesk.Revit.DB Namespace