Revit 2026 API

# RevitServerModelAlreadyExistsException Methods

---

The RevitServerModelAlreadyExistsException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerModelAlreadyExistsException Class

Autodesk.Revit.Exceptions Namespace