Revit 2026 API

# SymbolicCurveArrayIterator Properties

---

The SymbolicCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

SymbolicCurveArrayIterator Class

Autodesk.Revit.DB Namespace