Revit 2026 API

# IFCFileReadOptions Methods

---

The IFCFileReadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCFileReadOptions Class

Autodesk.Revit.DB.IFC Namespace