Revit 2026 API

# ReferenceArrayIterator Properties

---

The ReferenceArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ReferenceArrayIterator Class

Autodesk.Revit.DB Namespace