Revit 2026 API

# CADLinkOptions Methods

---

The CADLinkOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

CADLinkOptions Class

Autodesk.Revit.DB Namespace