Revit 2026 API

# ExternalApplicationException Methods

---

The ExternalApplicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ExternalApplicationException Class

Autodesk.Revit.Exceptions Namespace