Revit 2026 API

# MultiReferenceAnnotationOptions Class

---

Options which control the creation of MultiReferenceAnnotations.

SystemObject Autodesk.Revit.DBMultiReferenceAnnotationOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MultiReferenceAnnotationOptions : IDisposable
```
```vb
Public Class MultiReferenceAnnotationOptions
	Implements IDisposable
```
```cpp
public ref class MultiReferenceAnnotationOptions : IDisposable
```
```fsharp
type MultiReferenceAnnotationOptions =
    class
        interface IDisposable
    end
```

The MultiReferenceAnnotationOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MultiReferenceAnnotationOptions | Create an instance of Multi-Reference Annotation Options set with default values. |

|  | Name | Description |
| --- | --- | --- |
|  | DimensionLineDirection | The direction vector of the dimension line. |
|  | DimensionLineOrigin | The origin point for the dimension line. |
|  | DimensionPlaneNormal | The normal vector to the dimension plane. |
|  | DimensionStyleType | The dimension style type to be used by the new MultiReferenceAnnotation. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MultiReferenceAnnotationType | The MultiReferenceAnnotationType to be used by the new MultiReferenceAnnotation. |
|  | TagHasLeader | When true the tag will be created with an attached leader. When false the tag will be created without a leader. |
|  | TagHeadPosition | The position for the tag's head. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MultiReferenceAnnotationOptions |
|  | ElementsMatchReferenceCategory |  |
|  | GetAdditionalReferencesToDimension | Gets the additional references which the dimension will witness. |
|  | GetElementsToDimension | Gets the elements which the dimension will witness. |
|  | IsAllowedDimensionStyleType | Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations. |
|  | ReferencesDontMatchReferenceCategory |  |
|  | SetAdditionalReferencesToDimension |  |
|  | SetElementsToDimension |  |

MultiReferenceAnnotationOptions include the specification of the associated elements and options for the dimension and tag placement.

#### Reference

Autodesk.Revit.DB Namespace