Revit 2026 API

# DocumentSetIterator Class

---

An iterator to a set of documents.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDocumentSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class DocumentSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class DocumentSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class DocumentSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type DocumentSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The DocumentSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DocumentSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace