Revit 2026 API

# ExternalApplicationArrayIterator Methods

---

The ExternalApplicationArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ExternalApplicationArrayIterator Class

Autodesk.Revit.UI Namespace