Revit 2026 API

# ViewDisplayDepthCueing Methods

---

The ViewDisplayDepthCueing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | SetStartEndPercentages | Sets start and end percentages. |

#### Reference

ViewDisplayDepthCueing Class

Autodesk.Revit.DB Namespace