Revit 2026 API

# MultiServerService Methods

---

The MultiServerService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetActiveServerIds | Returns Ids of the currently active application-level servers registered for the service. |
|  | GetActiveServerIds(Document) | Returns Ids of the servers currently applicable to the given document for the service. |
|  | SetActiveServers(IListGuid) |  |
|  | SetActiveServers(IListGuid, Document) |  |
|  | SetServerState | This method will simply switch the active state of a server without affecting in any way the other servers. |

#### Reference

MultiServerService Class

Autodesk.Revit.DB.ExternalService Namespace