Revit 2026 API

# BIMExportOptions Class

---

The base class for options used to export using ATF.

SystemObject Autodesk.Revit.DBBIMExportOptions Autodesk.Revit.DBOBJExportOptions Autodesk.Revit.DBSTEPExportOptions Autodesk.Revit.DBSTLExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BIMExportOptions : IDisposable
```
```vb
Public Class BIMExportOptions
	Implements IDisposable
```
```cpp
public ref class BIMExportOptions : IDisposable
```
```fsharp
type BIMExportOptions =
    class
        interface IDisposable
    end
```

The BIMExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ViewId | The element id of the 3D view to export. InvalidElementId by default. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BIMExportOptions |

#### Reference

Autodesk.Revit.DB Namespace