Revit 2026 API

# ViewFamilyType Methods

---

The ViewFamilyType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidDefaultTemplate | Verifies that the input can be used as a default template for this view type. |

#### Reference

ViewFamilyType Class

Autodesk.Revit.DB Namespace