Revit 2026 API

# ResourceNotFoundException Methods

---

The ResourceNotFoundException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ResourceNotFoundException Class

Autodesk.Revit.Exceptions Namespace