Revit 2026 API

# IntegerRange Methods

---

The IntegerRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IntegerRange Class

Autodesk.Revit.DB Namespace