Revit 2026 API

# ConduitType Class

---

This class represents a conduit type in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBMEPCurveType Autodesk.Revit.DB.ElectricalConduitType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConduitType : MEPCurveType
```
```vb
Public Class ConduitType
	Inherits MEPCurveType
```
```cpp
public ref class ConduitType : public MEPCurveType
```
```fsharp
type ConduitType =
    class
        inherit MEPCurveType
    end
```

The ConduitType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsWithFitting | Whether this conduit type is with fitting |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Electrical Namespace