Revit 2026 API

# MEPBuildingConstructionSetIterator Methods

---

The MEPBuildingConstructionSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

MEPBuildingConstructionSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace