Revit 2026 API

# ElementIdSetFilter Methods

---

The ElementIdSetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetIdsToInclude | Returns the ids of this filter. |

#### Reference

ElementIdSetFilter Class

Autodesk.Revit.DB Namespace