Revit 2026 API

# GeomCombinationSetIterator Class

---

An iterator to a GeomCombination set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeomCombinationSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class GeomCombinationSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class GeomCombinationSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class GeomCombinationSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type GeomCombinationSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The GeomCombinationSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GeomCombinationSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace