Revit 2026 API

# StringParameterValue Class

---

A class that holds a String value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBStringParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StringParameterValue : ParameterValue
```
```vb
Public Class StringParameterValue
	Inherits ParameterValue
```
```cpp
public ref class StringParameterValue : public ParameterValue
```
```fsharp
type StringParameterValue =
    class
        inherit ParameterValue
    end
```

The StringParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StringParameterValue | Default constructor |
|  | StringParameterValue(String) | Value constructor |

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace