Revit 2026 API

# DXFExportOptions Methods

---

The DXFExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetPredefinedOptions | Returns an instance DXFExportOptions containing settings from a predefined export setup. |

#### Reference

DXFExportOptions Class

Autodesk.Revit.DB Namespace