Revit 2026 API

# MEPNetworkSegmentId Methods

---

The MEPNetworkSegmentId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsValid | Verifies if this is a valid segment id. |

#### Reference

MEPNetworkSegmentId Class

Autodesk.Revit.DB.Analysis Namespace