Revit 2026 API

# BoundingBoxUV Methods

---

The BoundingBoxUV type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

BoundingBoxUV Class

Autodesk.Revit.DB Namespace