Revit 2026 API

# RevitServerCollaborationNotAvailableException Methods

---

The RevitServerCollaborationNotAvailableException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerCollaborationNotAvailableException Class

Autodesk.Revit.Exceptions Namespace