Revit 2026 API

# TextEditorOptions Methods

---

The TextEditorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetTextEditorOptions | Returns the current Revit instance's TextEditorOptions. |

#### Reference

TextEditorOptions Class

Autodesk.Revit.UI Namespace