Revit 2026 API

# EditorInteraction Class

---

Wraps the EditorInteractionType for the Pane to allow for clients to override their type dynamically if need be.

SystemObject Autodesk.Revit.UIEditorInteraction

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EditorInteraction
```
```vb
Public Class EditorInteraction
```
```cpp
public ref class EditorInteraction
```
```fsharp
type EditorInteraction = class end
```

The EditorInteraction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EditorInteraction | Construct a default interaction. |
|  | EditorInteraction(EditorInteractionType) | Construct the interaction with the specified type. |

|  | Name | Description |
| --- | --- | --- |
|  | InteractionType | The type of interaction. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace