Revit 2026 API

# WorksetPreview Methods

---

The WorksetPreview type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

WorksetPreview Class

Autodesk.Revit.DB Namespace