Revit 2026 API

# FamilyContextException Methods

---

The FamilyContextException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

FamilyContextException Class

Autodesk.Revit.Exceptions Namespace