Revit 2026 API

# WireTypeSetIterator Methods

---

The WireTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

WireTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace