Revit 2026 API

# DuplicateTypeNamesHandlerArgs Methods

---

The DuplicateTypeNamesHandlerArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetTypeIds | Returns ids of the types with duplicate names. |

#### Reference

DuplicateTypeNamesHandlerArgs Class

Autodesk.Revit.DB Namespace