Revit 2026 API

# PrintSetting Properties

---

The PrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | Returns the Name of Print Setup.(Overrides ElementName) |
|  | PrintParameters | Returns the Parameters of Print Setup. |

#### Reference

PrintSetting Class

Autodesk.Revit.DB Namespace