Revit 2026 API

# AssetPropertyInteger Methods

---

The AssetPropertyInteger type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

AssetPropertyInteger Class

Autodesk.Revit.DB.Visual Namespace