Revit 2026 API

# ViewPlan Properties

---

The ViewPlan type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaScheme | The area scheme. |

#### Reference

ViewPlan Class

Autodesk.Revit.DB Namespace