Revit 2026 API

# FabricationSaveJobOptions Methods

---

The FabricationSaveJobOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FabricationSaveJobOptions Class

Autodesk.Revit.DB.Fabrication Namespace