Revit 2026 API

# InitialIntensity Methods

---

The InitialIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialIntensity derived object. |
|  | Dispose |  |

#### Reference

InitialIntensity Class

Autodesk.Revit.DB.Lighting Namespace