Revit 2026 API

# ProjectLocationSetIterator Properties

---

The ProjectLocationSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ProjectLocationSetIterator Class

Autodesk.Revit.DB Namespace