Revit 2026 API

# TilePatterns Methods

---

The TilePatterns type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetTilePattern | Retrieve a TilePattern object from a built-in type. |

#### Reference

TilePatterns Class

Autodesk.Revit.DB Namespace