Revit 2026 API

# Selection Class

---

Contains the current user selection of elements within the project.

SystemObject Autodesk.Revit.UI.SelectionSelection

**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Selection : IDisposable
```
```vb
Public Class Selection
	Implements IDisposable
```
```cpp
public ref class Selection : IDisposable
```
```fsharp
type Selection =
    class
        interface IDisposable
    end
```

The Selection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the Selection |
|  | GetElementIds | Returns the ids of the elements that are currently selected within the project. The selection may not be complete. See GetReferences for more options. |
|  | GetReferences | Returns the references that are currently selected. |
|  | PickBox(PickBoxStyle) | Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen. |
|  | PickBox(PickBoxStyle, String) | Invokes a general purpose two-click editor that lets the user to specify a rectangular area on the screen. |
|  | PickElementsByRectangle | Prompts the user to select multiple elements by drawing a rectangle. |
|  | PickElementsByRectangle(ISelectionFilter) | Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter. |
|  | PickElementsByRectangle(String) | Prompts the user to select multiple elements by drawing a rectangle while showing a custom status prompt string. |
|  | PickElementsByRectangle(ISelectionFilter, String) | Prompts the user to select multiple elements by drawing a rectangle which pass a customer filter while showing a custom status prompt string. |
|  | PickObject(ObjectType) | Prompts the user to select one object. |
|  | PickObject(ObjectType, ISelectionFilter) | Prompts the user to select one object which passes a custom filter. |
|  | PickObject(ObjectType, String) | Prompts the user to select one object while showing a custom status prompt string. |
|  | PickObject(ObjectType, ISelectionFilter, String) | Prompts the user to select one object which passes a custom filter while showing a custom status prompt string. |
|  | PickObjects(ObjectType) | Prompts the user to select multiple objects. |
|  | PickObjects(ObjectType, ISelectionFilter) | Prompts the user to select multiple objects which pass a customer filter. |
|  | PickObjects(ObjectType, String) | Prompts the user to select multiple objects while showing a custom status prompt string. |
|  | PickObjects(ObjectType, ISelectionFilter, String) | Prompts the user to select multiple objects which pass a custom filter while showing a custom status prompt string. |
|  | PickObjects(ObjectType, ISelectionFilter, String, IListReference) |  |
|  | PickPoint | Prompts the user to pick a point on the active work plane. |
|  | PickPoint(ObjectSnapTypes) | Prompts the user to pick a point on the active work plane using specified snap settings. |
|  | PickPoint(String) | Prompts the user to pick a point on the active work plane while showing a custom status prompt string. |
|  | PickPoint(ObjectSnapTypes, String) | Prompts the user to pick a point on the active work plane using specified snap settings while showing a custom status prompt string. |
|  | SetElementIds |  |
|  | SetReferences |  |

The Selection object is used to retrieve the current user selected elements when an external API command is executed.

#### Reference

Autodesk.Revit.UI.Selection Namespace