Revit 2026 API

# AnalyticalTransformerData Properties

---

The AnalyticalTransformerData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApparentPowerRating | The apparent power rating value of the analytical transformer. |
|  | SecondaryDistributionSystem | The secondary distribution system of the analytical transformer. |

#### Reference

AnalyticalTransformerData Class

Autodesk.Revit.DB.Electrical Namespace