Revit 2026 API

# PhaseFilter Class

---

Represents an phase filter within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBPhaseFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PhaseFilter : Element
```
```vb
Public Class PhaseFilter
	Inherits Element
```
```cpp
public ref class PhaseFilter : public Element
```
```fsharp
type PhaseFilter =
    class
        inherit Element
    end
```

The PhaseFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsDefault | Indicates whether this filter is the default one. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new phase filter with default status presentation. |
|  | GetPhaseStatusPresentation | Gets the phase status presentation. |
|  | SetPhaseStatusPresentation | Sets the phase status presentation. |

#### Reference

Autodesk.Revit.DB Namespace