Revit 2026 API

# AnalyticalPowerSourceData Properties

---

The AnalyticalPowerSourceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApparentPowerRating | The apparent power rating value of the analytical power source. |
|  | TotalConnectedCurrent | The total connected current of the analytical power source. |

#### Reference

AnalyticalPowerSourceData Class

Autodesk.Revit.DB.Electrical Namespace