Revit 2026 API

# ComboBoxData Class

---

This class contains information necessary to construct a combo box in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIComboBoxData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxData : RibbonItemData
```
```vb
Public Class ComboBoxData
	Inherits RibbonItemData
```
```cpp
public ref class ComboBoxData : public RibbonItemData
```
```fsharp
type ComboBoxData =
    class
        inherit RibbonItemData
    end
```

The ComboBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComboBoxData | Constructs a new instance of ComboBoxData. |

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image shown on the ComboBox. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace