Revit 2026 API

# FailureDefinitionRegistry Methods

---

The FailureDefinitionRegistry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | FindFailureDefinition | Finds a specific FailureDefinition by a given FailureDefinitionId. |
|  | ListAllFailureDefinitions | Retrieves all the registered FailureDefinitions. |

#### Reference

FailureDefinitionRegistry Class

Autodesk.Revit.DB Namespace