Revit 2026 API

# EdgeEndPoint Class

---

Represents the start or the end point of an Edge.

SystemObject Autodesk.Revit.DBEdgeEndPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EdgeEndPoint : IDisposable
```
```vb
Public Class EdgeEndPoint
	Implements IDisposable
```
```cpp
public ref class EdgeEndPoint : IDisposable
```
```fsharp
type EdgeEndPoint =
    class
        interface IDisposable
    end
```

The EdgeEndPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EdgeEndPoint | Constructs an instance of EdgeEndPoint. |

|  | Name | Description |
| --- | --- | --- |
|  | Edge | The Edge. |
|  | Index | The index of the start or the end point of an Edge: 0 is the start point, 1 is the end point. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the EdgeEndPoint |
|  | Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |
|  | Evaluate | Evaluate the end point of the edge in 3d coordinates. |

#### Reference

Autodesk.Revit.DB Namespace