Revit 2026 API

# DirectoryNotEmptyException Methods

---

The DirectoryNotEmptyException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

DirectoryNotEmptyException Class

Autodesk.Revit.Exceptions Namespace