Revit 2026 API

# SlabEdge Methods

---

The SlabEdge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddSegment | Add segments to the slab edge.(Overrides HostedSweepAddSegment(Reference)) |

#### Reference

SlabEdge Class

Autodesk.Revit.DB Namespace