Revit 2026 API

# PointNode Methods

---

The PointNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetPoint | Returns the point object corresponding to the node. |

#### Reference

PointNode Class

Autodesk.Revit.DB Namespace