Revit 2026 API

# ShapeBuilder Methods

---

The ShapeBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ShapeBuilder Class

Autodesk.Revit.DB Namespace