Revit 2026 API

# MEPBuildingConstruction Class

---

Construction definition for Project Information.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.MechanicalMEPBuildingConstruction

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPBuildingConstruction : ElementType
```
```vb
Public Class MEPBuildingConstruction
	Inherits ElementType
```
```cpp
public ref class MEPBuildingConstruction : public ElementType
```
```fsharp
type MEPBuildingConstruction =
    class
        inherit ElementType
    end
```

The MEPBuildingConstruction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetBuildingConstruction | Gets the current Building Construction from the project information. |
|  | GetBuildingConstructionOverride | Gets the Building Construction override for a ConstructionType. |
|  | GetConstructions | Gets all the Building Constructions corresponding to the specific Construction type. |
|  | SetBuildingConstruction | Sets the Building Construction of the Project Information. |
|  | SetBuildingConstructionOverride | Sets the Building Construction override for a ConstructionType. |

This is used to define the information in Constructions.xml.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace