Revit 2026 API

# ElementStructuralTypeFilter Properties

---

The ElementStructuralTypeFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralType | The structural type. |

#### Reference

ElementStructuralTypeFilter Class

Autodesk.Revit.DB Namespace