Revit 2026 API

# AppearanceAssetElement Class

---

An element that contains a rendering asset used as a portion of a material definition.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBAppearanceAssetElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AppearanceAssetElement : Element
```
```vb
Public Class AppearanceAssetElement
	Inherits Element
```
```cpp
public ref class AppearanceAssetElement : public Element
```
```fsharp
type AppearanceAssetElement =
    class
        inherit Element
    end
```

The AppearanceAssetElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new AppearanceAssetElement from an existing rendering asset. |
|  | Duplicate | Duplicates the appearance asset element. |
|  | GetAppearanceAssetElementByName | Gets an AppearanceAssetElement by name. |
|  | GetRenderingAsset | Gets the rendering asset for the appearance asset element. |
|  | SetRenderingAsset | Sets the rendering asset for the appearance asset element. |

#### Reference

Autodesk.Revit.DB Namespace