Revit 2026 API

# TransferredProjectStandardsEventArgs Methods

---

The TransferredProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSelectedExternalItems | Gets the collection of externally added items that the user opted to enable for transfer in the Transfer Project Standards dialog. |

#### Reference

TransferredProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace