Revit 2026 API

# DoubleParameterValue Properties

---

The DoubleParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

#### Reference

DoubleParameterValue Class

Autodesk.Revit.DB Namespace