Revit 2026 API

# BuildingPadType Class

---

Represents a specific type of Building Pad.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBBuildingPadType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BuildingPadType : HostObjAttributes
```
```vb
Public Class BuildingPadType
	Inherits HostObjAttributes
```
```cpp
public ref class BuildingPadType : public HostObjAttributes
```
```fsharp
type BuildingPadType =
    class
        inherit HostObjAttributes
    end
```

The BuildingPadType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the BuildingPadType |

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefault | Creates a BuildingPadType element and adds it to the document. |

#### Reference

Autodesk.Revit.DB Namespace