Revit 2026 API

# WireSetIterator Properties

---

The WireSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

WireSetIterator Class

Autodesk.Revit.DB.Electrical Namespace