Revit 2026 API

# RoomFilter Class

---

A filter used to match rooms.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DB.ArchitectureRoomFilter

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoomFilter : ElementSlowFilter
```
```vb
Public Class RoomFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class RoomFilter : public ElementSlowFilter
```
```fsharp
type RoomFilter =
    class
        inherit ElementSlowFilter
    end
```

The RoomFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RoomFilter | Constructs a filter which matches only rooms. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB.Architecture Namespace