Revit 2026 API

# ControlledApplication Class

---

Represents the Autodesk Revit Application with no access to documents. It provides options and other application wide data and settings for external applications OnStartup/OnShutdown.

SystemObject Autodesk.Revit.ApplicationServicesControlledApplication

**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ControlledApplication
```
```vb
Public Class ControlledApplication
```
```cpp
public ref class ControlledApplication
```
```fsharp
type ControlledApplication = class end
```

The ControlledApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActiveAddInId |  |
|  | AllUsersAddinsLocation | Add-ins location for all users. |
|  | Cities |  |
|  | Create |  |
|  | CurrentUserAddinsLocation | Add-ins location for current user. |
|  | CurrentUsersAddinsDataFolderPath | Path to AddinsData folder for the current user. |
|  | CurrentUsersDataFolderPath | Path to data folder for the current user. |
|  | IsLateAddinLoading | Indicates whether this add-in is loaded on the fly or not. If it is loaded when is Revit starting up, it is false, otherwise it should be true. |
|  | Language |  |
|  | Product |  |
|  | RecordingJournalFilename | Retrieve the name of the journal file that Revit is currently recording to. |
|  | SharedComponentsLocation | Location of shared components used by Revit. |
|  | SharedParametersFilename |  |
|  | SubVersionNumber | The minor version number of Revit. |
|  | VersionBuild |  |
|  | VersionName |  |
|  | VersionNumber |  |

|  | Name | Description |
| --- | --- | --- |
|  | GetFailureDefinitionRegistry | Returns the instance of FailureDefinitionRegistry. |
|  | GetLibraryPaths | Returns path information identifying where Revit searches for content. |
|  | IsJournalPlaying | Determines if the application is currently in journal playback mode. |
|  | OpenSharedParameterFile |  |
|  | RegisterFailuresProcessor | Registers Revit application-wide instance of Failures Processor. |
|  | SetLibraryPaths |  |
|  | WriteJournalComment | Writes a comment to the Revit journal file |

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationInitialized | Subscribe to this event to get notified after the Revit application has been initialized. |
|  | DocumentChanged | Subscribe to the FailuresProcessingEvent event to be notified when Revit document has changed. |
|  | DocumentClosed | Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document. |
|  | DocumentClosing | Subscribe to the DocumentClosing event to be notified when Revit is just about to close a document. |
|  | DocumentCreated | Subscribe to the DocumentCreated event to be notified immediately after Revit has finished creating a new document. |
|  | DocumentCreating | Subscribe to the DocumentCreating event to be notified when Revit is just about to create a new document. |
|  | DocumentOpened | Subscribe to the DocumentOpened event to be notified immediately after Revit has finished opening a document. |
|  | DocumentOpening | Subscribe to the DocumentOpening event to be notified when Revit is just about to open a document. |
|  | DocumentPrinted | Subscribe to the DocumentPrinted event to be notified immediately after Revit has finished printing a view or ViewSet of the document. |
|  | DocumentPrinting | Subscribe to the DocumentPrinting event to be notified when Revit is just about to print a view or ViewSet of the document. |
|  | DocumentReloadedLatest | Subscribe to the DocumentReloadedLatestEventArgs event to be notified immediately after Revit has finished reloading a document with central model. |
|  | DocumentReloadingLatest | Subscribe to the DocumentReloadingLatestEventArgs event to be notified when Revit is just about to reload latest changes from a central model. |
|  | DocumentSaved | Subscribe to the DocumentSaved event to be notified immediately after Revit has finished saving a document. |
|  | DocumentSavedAs | Subscribe to the DocumentSavedAs event to be notified immediately after Revit has finished saving document with a new file name. |
|  | DocumentSaving | Subscribe to the DocumentSaving event to be notified when Revit is just about to save a document. |
|  | DocumentSavingAs | Subscribe to the DocumentSavingAs event to be notified when Revit is just about to save the document with a new file name. This event is raised when Revit is just about to save the document with a new file name. Note that the first save of a newly created document will raise DocumentSavingAs rather than DocumentSaving event.  Handlers of this event are permitted to make modifications to any document (including the active document), except for documents that are currently in read-only mode. This event is cancellable, except when it is raised during close of the application. Check the 'Cancellable' property of event's argument to see whether it is cancellable or not. When it is cancellable, call the 'Cancel()' method of event's argument to cancel it. Your application is responsible for providing feedback to the user about the reason for the cancellation.The following API functions are not available for the current document during this event: |

  * Close and similar overloads.
  * Save .
  * SaveAs(String) and similar overloads.

Exception InvalidOperationException will be thrown if any of the above methods is called during this event.Another event DocumentSavedAs will be raised immediately after the document has been saved with a new file name.
| DocumentSynchronizedWithCentral|  Subscribe to the DocumentSynchronizedWithCentral event to be notified immediately after Revit has finished synchronizing a document with central model.
| DocumentSynchronizingWithCentral|  Subscribe to the DocumentSynchronizingWithCentral event to be notified when Revit is just about to synchronize a document with central model.
| ElementTypeDuplicated|  Subscribe to the ElementTypeDuplicated event to be notified immediately after Revit has finished duplicating an element type.
| ElementTypeDuplicating|  Subscribe to the ElementTypeDuplicating event to be notified when Revit is just about to duplicate an element type.
| FailuresProcessing|  Subscribe to the FailuresProcessing event to be notified when failures are being processed at the end of transaction.
| FamilyLoadedIntoDocument|  Subscribe to the FamilyLoadedInto event to be notified after Revit loaded a family into a document.
| FamilyLoadingIntoDocument|  Subscribe to the FamilyLoadingInto event to be notified when Revit is just about to load a family into a document.
| FileExported|  Subscribe to the FileExported event to be notified immediately after Revit has finished exporting files of formats supported by the API.
| FileExporting|  Subscribe to the FileExporting event to be notified when Revit is just about to export files of formats supported by the API.
| FileImported|  Subscribe to the FileImported event to be notified immediately after Revit has finished importing a file of format supported by the API.
| FileImporting|  Subscribe to the FileImporting event to be notified when Revit is just about to import a file of format supported by the API.
| LinkedResourceOpened|  Subscribe to the LinkedResourceOpened event to be notified immediately after Revit has finished opening a linked resource.
| LinkedResourceOpening|  Subscribe to the LinkedResourceOpening event to be notified when Revit is just about to open a linked resource.
| ProgressChanged|  Subscribe to the ProgressChanged event to be notified when an operation in Revit has progress bar data available.
| ViewPrinted|  Subscribe to the ViewPrinted event to be notified immediately after Revit has finished printing a view of the document.
| ViewPrinting|  Subscribe to the ViewPrinting event to be notified when Revit is just about to print a view of the document.
|  | WorksharedOperationProgressChanged | # Subscribe to the WorksharedOperationProgressChanged to be notified when progress has changed during Collaboration for Revit's workshared operations: open model and synchronize with central. |

#### Reference

Autodesk.Revit.ApplicationServices Namespace