Revit 2026 API

# WireSizeSetIterator Class

---

An iterator to a wire size set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireSizeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class WireSizeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class WireSizeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class WireSizeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type WireSizeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The WireSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireSizeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace