Revit 2026 API

# RoomTag Class

---

Provides access to the room tag in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElementTag Autodesk.Revit.DB.ArchitectureRoomTag

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoomTag : SpatialElementTag
```
```vb
Public Class RoomTag
	Inherits SpatialElementTag
```
```cpp
public ref class RoomTag : public SpatialElementTag
```
```fsharp
type RoomTag =
    class
        inherit SpatialElementTag
    end
```

The RoomTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsInRoom | Identifies if the tag is located in a room. |
|  | Room | The room that the tag is associated with. |
|  | RoomTagType | The tag type. |
|  | TaggedLocalRoomId | The ElementId of the tagged room. |
|  | TaggedRoomId | The LinkElementId of the tagged room. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Architecture Namespace