Revit 2026 API

# GuidEnum Class

---

Base class of all GUID-based enum classes.

SystemObject Autodesk.Revit.DBGuidEnum More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GuidEnum
```
```vb
Public Class GuidEnum
```
```cpp
public ref class GuidEnum
```
```fsharp
type GuidEnum = class end
```

The GuidEnum type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GuidEnum | Creates an Guid-based enum instance with the supplied name and GUID. GUID-based enum instance can be compared by this guid value. |

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Compares two Guid-based enum object based on their concrete class and GUID value. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Generates a hash code for this Guid-based enum object. (Overrides ObjectGetHashCode) |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DBExternalResourceType Autodesk.Revit.DB.ExternalServiceExternalServiceId Autodesk.Revit.DBFailureDefinitionId Autodesk.Revit.DBNumberingSchemaType Autodesk.Revit.DBPerformanceAdviserRuleId Autodesk.Revit.UIDockablePaneId