Revit 2026 API

# ParameterValue Class

---

A class that holds a value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ParameterValue : IDisposable
```
```vb
Public Class ParameterValue
	Implements IDisposable
```
```cpp
public ref class ParameterValue : IDisposable
```
```fsharp
type ParameterValue =
    class
        interface IDisposable
    end
```

The ParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Copy | Makes an identical copy of the given parameter value. |
|  | Dispose | Releases all resources used by the ParameterValue |
|  | IsEqual | Tests equality with another instance of the same class. |
|  | IsSameType | Tests another instance is of the same value type. |

This is a non-instantiable base class. Classes that actually store a value of a certain type are all derived from this base class, once class per each value type.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBDoubleParameterValue Autodesk.Revit.DBElementIdParameterValue Autodesk.Revit.DBIntegerParameterValue Autodesk.Revit.DBNullParameterValue Autodesk.Revit.DBStringParameterValue