Revit 2026 API

# ComboBoxMember Class

---

This class represents an item in the drop-down list of a ComboBox.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIComboBoxMember

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxMember : RibbonItem
```
```vb
Public Class ComboBoxMember
	Inherits RibbonItem
```
```cpp
public ref class ComboBoxMember : public RibbonItem
```
```fsharp
type ComboBoxMember =
    class
        inherit RibbonItem
    end
```

The ComboBoxMember type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroupName | The group to which the ComboBoxMember is assigned. |
|  | Image | The image shown on the ComboBoxMember. |

|  | Name | Description |
| --- | --- | --- |

Note that a ComboBoxMember will not show an individual tool tip. Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace