Revit 2026 API

# IndexPoint Properties

---

The IndexPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Index | The index of the point's vertex. |

#### Reference

IndexPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace