Revit 2026 API

# FilledRegion Class

---

A filled region element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBFilledRegion

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilledRegion : Element
```
```vb
Public Class FilledRegion
	Inherits Element
```
```cpp
public ref class FilledRegion : public Element
```
```fsharp
type FilledRegion =
    class
        inherit Element
    end
```

The FilledRegion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsMasking | Indicates whether this element is a 'Filled Region or a 'Masking Region'. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, IListCurveLoop) |  |
|  | Create(Document, ElementId, SketchPlane, IListCurveLoop) |  |
|  | CreateMaskingRegion(Document, ElementId, IListCurveLoop) |  |
|  | CreateMaskingRegion(Document, SketchPlane, IListCurveLoop) |  |
|  | GetBoundaries | Gets the boundaries. |
|  | GetValidLineStyleIdsForFilledRegion | Gets the line style Ids which are permitted to be assigned to a filled region. |
|  | IsValidFilledRegionTypeId | Indicates whether the given Id is a valid filled region type Id. |
|  | IsValidLineStyleIdForFilledRegion | Indicates whether the given Id is a valid line style Id. |
|  | SetLineStyleId | Sets the line style Id for all boundaries. |

#### Reference

Autodesk.Revit.DB Namespace