Revit 2026 API

# TextBoxData Class

---

This class contains information necessary to construct a text box in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UITextBoxData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TextBoxData : RibbonItemData
```
```vb
Public Class TextBoxData
	Inherits RibbonItemData
```
```cpp
public ref class TextBoxData : public RibbonItemData
```
```fsharp
type TextBoxData =
    class
        inherit RibbonItemData
    end
```

The TextBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TextBoxData | Constructs a new instance of TextBoxData. |

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image of the TextBox. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace