Revit 2026 API

# ViewPosition Methods

---

The ViewPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new view position element. |
|  | GetPlacedViewportIdsForViewPosition | Gets the placed viewport ids for the view position. |

#### Reference

ViewPosition Class

Autodesk.Revit.DB Namespace