Revit 2026 API

# SymbolicCurveArrayIterator Class

---

An iterator to a model curve array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSymbolicCurveArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class SymbolicCurveArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class SymbolicCurveArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class SymbolicCurveArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type SymbolicCurveArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The SymbolicCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SymbolicCurveArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace