Revit 2026 API

# RebarSpliceByRulesResult Methods

---

The RebarSpliceByRulesResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetSpliceGeometries | Gets the RebarSpliceGeometry collection which is the result of the splice by rules operation. |

#### Reference

RebarSpliceByRulesResult Class

Autodesk.Revit.DB.Structure Namespace