Revit 2026 API

# StructuralSectionConcreteCross Properties

---

The StructuralSectionConcreteCross type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CantileverHeight | Flange cantilever thickness. |
|  | CantileverLength | Flange cantilever length. |

#### Reference

StructuralSectionConcreteCross Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace