Revit 2026 API

# ViewPosition Class

---

This class represents the view position element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBViewPosition

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewPosition : Element
```
```vb
Public Class ViewPosition
	Inherits Element
```
```cpp
public ref class ViewPosition : public Element
```
```fsharp
type ViewPosition =
    class
        inherit Element
    end
```

The ViewPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | Specifies view's position. |
|  | ViewAnchor | Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new view position element. |
|  | GetPlacedViewportIdsForViewPosition | Gets the placed viewport ids for the view position. |

#### Reference

Autodesk.Revit.DB Namespace