Revit 2026 API

# Color Class

---

Represents a color in Autodesk Revit.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBColor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Color : APIObject
```
```vb
Public Class Color
	Inherits APIObject
```
```cpp
public ref class Color : public APIObject
```
```fsharp
type Color =
    class
        inherit APIObject
    end
```

The Color type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | Constructor that takes the red, green and blue channels of the color. |

|  | Name | Description |
| --- | --- | --- |
|  | Blue | Get the blue channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |
|  | Green | Get the green channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |
|  | InvalidColorValue | Get the invalid Color whose IntegerValue is -1. |
|  | IsValid | Identifies if the color represents a valid color, or an uninitialized/invalid value. |
|  | Red | Get the red channel of the color. Setting a channel is obsolete in Autodesk Revit 2013. Please create a new color instead. |

|  | Name | Description |
| --- | --- | --- |

Colors obtained from some API methods may represent an uninitialized/invalid color. You can identify these using the IsValid property.

#### Reference

Autodesk.Revit.DB Namespace