Revit 2026 API

# DisplacementPath Properties

---

The DisplacementPath type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AncestorIdx | Specifies the end point of the path. |
|  | PathStyle | Specifies the style of the path. |

#### Reference

DisplacementPath Class

Autodesk.Revit.DB Namespace