Revit 2026 API

# CurtainGridSetIterator Properties

---

The CurtainGridSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CurtainGridSetIterator Class

Autodesk.Revit.DB Namespace