Revit 2026 API

# RelinquishedItems Methods

---

The RelinquishedItems type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetRelinquishedElements | The elements that were relinquished by the current user. |
|  | GetRelinquishedWorksets | The elements that were relinquished by the current user. |

#### Reference

RelinquishedItems Class

Autodesk.Revit.DB Namespace