Revit 2026 API

# DefinitionBindingMap Properties

---

The DefinitionBindingMap type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the map is empty. |
|  | Item |  |
|  | Size | Returns the number of bindings that are in the map. |

#### Reference

DefinitionBindingMap Class

Autodesk.Revit.DB Namespace