Revit 2026 API

# BoundingBoxIntersectsFilter Methods

---

The BoundingBoxIntersectsFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundingBox | Gets the outline being used for this filter. |

#### Reference

BoundingBoxIntersectsFilter Class

Autodesk.Revit.DB Namespace