Revit 2026 API

# IFCBuiltInCategoryKey Methods

---

The IFCBuiltInCategoryKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCBuiltInCategoryKey Class

Autodesk.Revit.DB Namespace