Revit 2026 API

# AnalysisResultSchema Methods

---

The AnalysisResultSchema type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetNumberOfUnits | returns number of possible units |
|  | GetUnitsMultiplier | returns units multiplier by index |
|  | GetUnitsName | returns units name by index |
|  | IsEqual | Determines if the input object is equivalent to this AnalysisResultSchema. |
|  | SetUnits |  |

#### Reference

AnalysisResultSchema Class

Autodesk.Revit.DB.Analysis Namespace