Revit 2026 API

# LightingDevice Class

---

Provides access to the Lighting Device in Autodesk Revit MEP.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel Autodesk.Revit.DB.ElectricalLightingDevice

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightingDevice : MEPModel
```
```vb
Public Class LightingDevice
	Inherits MEPModel
```
```cpp
public ref class LightingDevice : public MEPModel
```
```fsharp
type LightingDevice =
    class
        inherit MEPModel
    end
```

The LightingDevice type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The Lighting Device object can only be queried in Autodesk Revit MEP.

#### Reference

Autodesk.Revit.DB.Electrical Namespace