Revit 2026 API

# MEPCurve Class

---

A curve object for duct or pipe blend elements.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPCurve : HostObject
```
```vb
Public Class MEPCurve
	Inherits HostObject
```
```cpp
public ref class MEPCurve : public HostObject
```
```fsharp
type MEPCurve =
    class
        inherit HostObject
    end
```

The MEPCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | The connector manager of this MEP curve. |
|  | Diameter | The diameter of the MEP curve. |
|  | Height | The height of the MEP curve. |
|  | LevelOffset | The offset of the MEP curve. |
|  | MEPSystem | The system of the MEP curve. |
|  | ReferenceLevel | The reference level of the MEP curve. |
|  | Width | The width of the MEP curve. |

|  | Name | Description |
| --- | --- | --- |

The curve object is only available in the Autodesk Revit MEP product.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DB.ElectricalCableTrayConduitBase Autodesk.Revit.DB.ElectricalWire Autodesk.Revit.DBInsulationLiningBase Autodesk.Revit.DB.MechanicalDuct Autodesk.Revit.DB.MechanicalFlexDuct Autodesk.Revit.DBMEPAnalyticalConnection Autodesk.Revit.DB.PlumbingFlexPipe Autodesk.Revit.DB.PlumbingPipe