Revit 2026 API

# SpotDimension Properties

---

The SpotDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LeaderHasShoulder | True is dimension has leader with shoulder, false otherwise. |
|  | LeaderShoulderPosition | Position of spot dimension's leader shoulder point. |
|  | SpotDimensionType | The dimension style of this dimension. |

#### Reference

SpotDimension Class

Autodesk.Revit.DB Namespace