Revit 2026 API

# ParameterSetIterator Class

---

An iterator to a parameter set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBParameterSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ParameterSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ParameterSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ParameterSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ParameterSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ParameterSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ParameterSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace