Revit 2026 API

# BoundaryValidation Methods

---

The BoundaryValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsValidBoundaryOnSketchPlane |  |
|  | IsValidBoundaryOnView |  |
|  | IsValidHorizontalBoundary |  |

#### Reference

BoundaryValidation Class

Autodesk.Revit.DB Namespace