Revit 2026 API

# LightNode Class

---

This class represents a Light element in a model-exporting process.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBContentNode Autodesk.Revit.DBLightNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightNode : ContentNode
```
```vb
Public Class LightNode
	Inherits ContentNode
```
```cpp
public ref class LightNode : public ContentNode
```
```fsharp
type LightNode =
    class
        inherit ContentNode
    end
```

The LightNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

See also: [!:Autodesk::Revit::DB::IExportContext::OnLight].

#### Reference

Autodesk.Revit.DB Namespace