Revit 2026 API

# ViewActivatingEventArgs Properties

---

The ViewActivatingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentActiveView | The view that is currently active. |
|  | NewActiveView | The view that is going to become active. |

#### Reference

ViewActivatingEventArgs Class

Autodesk.Revit.UI.Events Namespace