Revit 2026 API

# FamilyTypeSetIterator Properties

---

The FamilyTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

FamilyTypeSetIterator Class

Autodesk.Revit.DB Namespace