Revit 2026 API

# ModelHermiteSpline Class

---

Represents a ModelHermiteSpline within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve Autodesk.Revit.DBModelHermiteSpline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelHermiteSpline : ModelCurve
```
```vb
Public Class ModelHermiteSpline
	Inherits ModelCurve
```
```cpp
public ref class ModelHermiteSpline : public ModelCurve
```
```fsharp
type ModelHermiteSpline =
    class
        inherit ModelCurve
    end
```

The ModelHermiteSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from ModelCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace