Revit 2026 API

# FaceNode Methods

---

The FaceNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFace | Returns the Face object corresponding to the node. |

#### Reference

FaceNode Class

Autodesk.Revit.DB Namespace