Revit 2026 API

# FlexDuct Class

---

A flex duct in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DB.MechanicalFlexDuct

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FlexDuct : MEPCurve
```
```vb
Public Class FlexDuct
	Inherits MEPCurve
```
```cpp
public ref class FlexDuct : public MEPCurve
```
```fsharp
type FlexDuct =
    class
        inherit MEPCurve
    end
```

The FlexDuct type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndTangent | Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent. |
|  | FlexDuctType | The flex duct type of this flex duct. |
|  | Points | The points of the flex duct. |
|  | StartTangent | Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IListXYZ) |  |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IListXYZ) |  |
|  | IsFlexDuctTypeId | Checks if given type is valid flexible duct type. |
|  | IsHVACSystemTypeId | Checks if given type is valid HVAC system type. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace