Revit 2026 API

# ColorBackgroundSettings Properties

---

The ColorBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | The color of the rendering background. |

#### Reference

ColorBackgroundSettings Class

Autodesk.Revit.DB Namespace