Revit 2026 API

# GeometryElement Properties

---

The GeometryElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MaterialElement | Element describing the material from which this element is composed. |

#### Reference

GeometryElement Class

Autodesk.Revit.DB Namespace