Revit 2026 API

# VoltageTypeSetIterator Properties

---

The VoltageTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

VoltageTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace