Revit 2026 API

# ModelText Class

---

A model text element in an Autodesk Revit family document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBModelText

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelText : Element
```
```vb
Public Class ModelText
	Inherits Element
```
```cpp
public ref class ModelText : public Element
```
```fsharp
type ModelText =
    class
        inherit Element
    end
```

The ModelText type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Depth | The depth of the model text. |
|  | HorizontalAlignment | The horizontal alignment. |
|  | Location | This property is used to find the physical location of an instance within project.(Overrides ElementLocation) |
|  | ModelTextType | The type for the model text. |
|  | Subcategory | The subcategory. |
|  | Text | The text string in the model text. |

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the model text in a family document. |
|  | SetVisibility | Sets the visibility for the model text in a family document. |

#### Reference

Autodesk.Revit.DB Namespace