Revit 2026 API

# PhaseFilter Properties

---

The PhaseFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsDefault | Indicates whether this filter is the default one. |

#### Reference

PhaseFilter Class

Autodesk.Revit.DB Namespace