Revit 2026 API

# WireTypeSetIterator Class

---

An iterator to a wire type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class WireTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class WireTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class WireTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type WireTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The WireTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace