Revit 2026 API

# AssetPropertyDoubleArray4d Methods

---

The AssetPropertyDoubleArray4d type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetValueAsColor | Gets the value property as a color. |
|  | GetValueAsDoubles | Gets the value property as doubles. |
|  | IsValidValue(Color) | Checks that the value is a valid value for this property. |
|  | IsValidValue(IListDouble) |  |
|  | SetValueAsColor | Sets the value property as a color. |
|  | SetValueAsDoubles |  |

#### Reference

AssetPropertyDoubleArray4d Class

Autodesk.Revit.DB.Visual Namespace