Revit 2026 API

# IFCAggregateIterator Class

---

A class used to iterate individual objects in an IFCAggregate.

SystemObject Autodesk.Revit.DB.IFCIFCAggregateIterator

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCAggregateIterator : IEnumerator<IFCData>
```
```vb
Public Class IFCAggregateIterator
	Implements IEnumerator(Of IFCData)
```
```cpp
public ref class IFCAggregateIterator : IEnumerator<IFCData^>
```
```fsharp
type IFCAggregateIterator =
    class
        interface IEnumerator<IFCData>
    end
```

The IFCAggregateIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets the item at the current position of the iterator. |
|  | CurrentObject |  |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCAggregateIterator |
|  | MoveNext | Increments the iterator to the next object in the IFCAggregate. |
|  | Reset | Resets the iterator to the beginning of the aggregate. |

#### Reference

Autodesk.Revit.DB.IFC Namespace