Revit 2026 API

# IFCExtrusionCalculatorOptions Class

---

This class contains the options used to calculate extrusions from Revit geometry.

SystemObject Autodesk.Revit.DB.IFCIFCExtrusionCalculatorOptions

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCExtrusionCalculatorOptions : IDisposable
```
```vb
Public Class IFCExtrusionCalculatorOptions
	Implements IDisposable
```
```cpp
public ref class IFCExtrusionCalculatorOptions : IDisposable
```
```fsharp
type IFCExtrusionCalculatorOptions =
    class
        interface IDisposable
    end
```

The IFCExtrusionCalculatorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCExtrusionCalculatorOptions | Constructs a new instance of a class used to calculate extrusions from Revit geometry. |

|  | Name | Description |
| --- | --- | --- |
|  | CustomAxis | The custom axis to try (if extrusionAxes includes an option for a custom direction). |
|  | ExtrusionAxes | The extrusion axes to try when doing the calculation. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Scale | The scaling factor for length measurements from the default Revit units to the export units. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCExtrusionCalculatorOptions |

#### Reference

Autodesk.Revit.DB.IFC Namespace