Revit 2026 API

# ViewDisplayDepthCueing Class

---

Represents the settings for depth cueing.

SystemObject Autodesk.Revit.DBViewDisplayDepthCueing

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewDisplayDepthCueing : IDisposable
```
```vb
Public Class ViewDisplayDepthCueing
	Implements IDisposable
```
```cpp
public ref class ViewDisplayDepthCueing : IDisposable
```
```fsharp
type ViewDisplayDepthCueing =
    class
        interface IDisposable
    end
```

The ViewDisplayDepthCueing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EnableDepthCueing | True to enable depth cueing. False to disable it. |
|  | EndPercentage | The end percentage defines where depth cueing ends. Values between 0 and 100. |
|  | FadeTo | The fade to defines the maximum fading in per cent. Values between 0 and 100. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartPercentage | The start percentage defines where depth cueing starts. Values between 0 and 100. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ViewDisplayDepthCueing |
|  | SetStartEndPercentages | Sets start and end percentages. |

#### Reference

Autodesk.Revit.DB Namespace