Revit 2026 API

# RebarCoverType Methods

---

The RebarCoverType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new CoverType in the document. |

#### Reference

RebarCoverType Class

Autodesk.Revit.DB.Structure Namespace