Revit 2026 API

# DuctLiningType Properties

---

The DuctLiningType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Roughness | The roughness of Duct Lining. |

#### Reference

DuctLiningType Class

Autodesk.Revit.DB.Mechanical Namespace