Revit 2026 API

# UISaveAsOptions Class

---

This class contains UI options available for saving a document to disk with a new filename.

SystemObject Autodesk.Revit.UIUISaveAsOptions

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UISaveAsOptions : IDisposable
```
```vb
Public Class UISaveAsOptions
	Implements IDisposable
```
```cpp
public ref class UISaveAsOptions : IDisposable
```
```fsharp
type UISaveAsOptions =
    class
        interface IDisposable
    end
```

The UISaveAsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UISaveAsOptions | Default constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowOverwriteWarning | Identifies if UI should show an overwrite warning dialog. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the UISaveAsOptions |

#### Reference

Autodesk.Revit.UI Namespace