Revit 2026 API

# SaveAsOptions Methods

---

The SaveAsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetWorksharingOptions | Gets Worksharing options for SaveAs. |
|  | SetWorksharingOptions | Sets Worksharing options for SaveAs. |

#### Reference

SaveAsOptions Class

Autodesk.Revit.DB Namespace