Revit 2026 API

# AreaCreationData Class

---

A class which wraps the arguments of Area for batch creation

SystemObject Autodesk.Revit.CreationAreaCreationData

**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaCreationData
```
```vb
Public Class AreaCreationData
```
```cpp
public ref class AreaCreationData
```
```fsharp
type AreaCreationData = class end
```

The AreaCreationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaCreationData(Object) | Initializes a new instance of the AreaCreationData class |
|  | AreaCreationData(ViewPlan, UV) | The data needed to create a new area |

|  | Name | Description |
| --- | --- | --- |
|  | TagPoint | Specify the location of the area tag. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.Creation Namespace