Revit 2026 API

# BackgroundSettings Methods

---

The BackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

BackgroundSettings Class

Autodesk.Revit.DB Namespace