Revit 2026 API

# ElementLogicalFilter Class

---

A filter used to logically combine two or more filters.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementLogicalFilter Autodesk.Revit.DBLogicalAndFilter Autodesk.Revit.DBLogicalOrFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementLogicalFilter : ElementFilter
```
```vb
Public Class ElementLogicalFilter
	Inherits ElementFilter
```
```cpp
public ref class ElementLogicalFilter : public ElementFilter
```
```fsharp
type ElementLogicalFilter =
    class
        inherit ElementFilter
    end
```

The ElementLogicalFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetFilters | Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter. |
|  | SetFilters |  |

The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.

#### Reference

Autodesk.Revit.DB Namespace