Revit 2026 API

# PathReinforcementType Class

---

An object that specifies the type of a Structural Path Reinforcement element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructurePathReinforcementType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PathReinforcementType : ElementType
```
```vb
Public Class PathReinforcementType
	Inherits ElementType
```
```cpp
public ref class PathReinforcementType : public ElementType
```
```fsharp
type PathReinforcementType =
    class
        inherit ElementType
    end
```

The PathReinforcementType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultPathReinforcementType | Creates a new PathReinforcementType object with a default name. |

The clear cover settings can be accessed via this object.

#### Reference

Autodesk.Revit.DB.Structure Namespace