Revit 2026 API

# PaperSizeSetIterator Methods

---

The PaperSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

PaperSizeSetIterator Class

Autodesk.Revit.DB Namespace