Revit 2026 API

# WireConduitType Class

---

Represents a specific conduit type of wire type.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireConduitType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WireConduitType : APIObject
```
```vb
Public Class WireConduitType
	Inherits APIObject
```
```cpp
public ref class WireConduitType : public APIObject
```
```fsharp
type WireConduitType =
    class
        inherit APIObject
    end
```

The WireConduitType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name |  |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Electrical Namespace