Revit 2026 API

# BoundingBoxXYZ Class

---

A three-dimensional rectangular box at an arbitrary location and orientation within the Revit model.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBBoundingBoxXYZ

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundingBoxXYZ : APIObject
```
```vb
Public Class BoundingBoxXYZ
	Inherits APIObject
```
```cpp
public ref class BoundingBoxXYZ : public APIObject
```
```fsharp
type BoundingBoxXYZ =
    class
        inherit APIObject
    end
```

The BoundingBoxXYZ type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BoundingBoxXYZ | Constructs a new BoundingBoxXYZ with a default transform and extents of (-100, -100, -100) to (100, 100, 100). |

|  | Name | Description |
| --- | --- | --- |
|  | BoundEnabled | Indexed access for loops. |
|  | Bounds | Indexed access for loops. Use 0 for Min and 1 for Max. |
|  | Enabled | Defines whether the entire bounding box is enabled. |
|  | IsSet | Indicates whether the bounding box is set. |
|  | Max | Maximum coordinates (upper-right-front corner of the box). |
|  | MaxEnabled | Defines whether the maximum bound is active for given dimension. |
|  | Min | Minimum coordinates (lower-left-rear corner of the box). |
|  | MinEnabled | Defines whether the minimum bound is active for given dimension. |
|  | Transform | The transform from the coordinate space of the box to the model coordinate space. |

|  | Name | Description |
| --- | --- | --- |

BoundingBoxXYZ objects are used in Revit in several places related to views (for example, the section box of a 3D view or the definition of a section or detail view). BoundingBoxXYZ objects can also be obtained from elements representing the boundary of the element in a given view.

The extents of the box are determined by three orthogonal planes extended through the minimum (Min) and maximum (Max) points, but the coordinates of these points and the orientation of the planes in relation to the coordinates of the source model is determined by the box Transform (Transform).

This class also has the ability to detect and mark certain extents as disabled. Note that in the current Revit API uses of this class it is not expected that Revit will give objects with disabled extents, and disabled extents in objects sent to Revit will likely be ignored.

#### Reference

Autodesk.Revit.DB Namespace