Revit 2026 API

# TransientElementCreationException Methods

---

The TransientElementCreationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

TransientElementCreationException Class

Autodesk.Revit.Exceptions Namespace