Revit 2026 API

# PanelTypeSet Class

---

A set that contains panel types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPanelTypeSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PanelTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class PanelTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class PanelTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type PanelTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The PanelTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PanelTypeSet | Initializes a new instance of the PanelTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of panel types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every panel type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a panel type within the set. |
|  | Erase | Removes a specified panel type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified panel type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace