Revit 2026 API

# AssetPropertyString Methods

---

The AssetPropertyString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

AssetPropertyString Class

Autodesk.Revit.DB.Visual Namespace