Revit 2026 API

# ExportLineweightKey Methods

---

The ExportLineweightKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportLineweightKey Class

Autodesk.Revit.DB Namespace