Revit 2026 API

# VertexStreamPositionColored Methods

---

The VertexStreamPositionColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionColored into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

VertexStreamPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace