Revit 2026 API

# WireMaterialType Class

---

**Note: This API is now obsolete.**

Represents electrical wire material type definition information of wire type.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ElectricalWireMaterialType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("WireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial instead. ConductorMaterials will be created by WireMaterialTypes properly during document upgrade.")]
public class WireMaterialType : ElementType
```
```vb
<ObsoleteAttribute("WireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial instead. ConductorMaterials will be created by WireMaterialTypes properly during document upgrade.")>
Public Class WireMaterialType
	Inherits ElementType
```
```cpp
[ObsoleteAttribute(L"WireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial instead. ConductorMaterials will be created by WireMaterialTypes properly during document upgrade.")]
public ref class WireMaterialType : public ElementType
```
```fsharp
[<ObsoleteAttribute("WireMaterialType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorMaterial instead. ConductorMaterials will be created by WireMaterialTypes properly during document upgrade.")>]
type WireMaterialType =
    class
        inherit ElementType
    end
```

The WireMaterialType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroundConductorSizes | Get all ground conductor size types defined in this wire material type. |
|  | IsInUse | Indicate whether the wire material type is in use. |
|  | Name | Get name of wire material type. (Overrides ElementTypeName) |
|  | TemperatureRatings | Get all temperature rating type definitions defined in this wire material type. |

|  | Name | Description |
| --- | --- | --- |
|  | AddGroundConductorSize | Add new electrical ground conductor size type into this material type. |
|  | AddTemperatureRatingType | Add a new temperature rating type into material type. |
|  | RemoveGroundConductorSize | Remove an existing ground conductor size from this material type. |
|  | RemoveTemperatureRatingType | Remove an existing temperature rating type from this material type. |

All the other properties of wire type are based on wire material type. Only the wire material types which are retrieved from ElectricalSetting can work well, so don't retrieve it from Revit project directly.

#### Reference

Autodesk.Revit.DB.Electrical Namespace