Revit 2026 API

# Ceiling Properties

---

The Ceiling type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchId | Returns id of the sketch. |

#### Reference

Ceiling Class

Autodesk.Revit.DB Namespace