Revit 2026 API

# ExecutedEventArgs Methods

---

The ExecutedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetJournalData | Gets the journal data associated to this command (on journal playback). |
|  | SetJournalData |  |

#### Reference

ExecutedEventArgs Class

Autodesk.Revit.UI.Events Namespace