Revit 2026 API

# BuildingEnvelopeAnalyzerOptions Methods

---

The BuildingEnvelopeAnalyzerOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

BuildingEnvelopeAnalyzerOptions Class

Autodesk.Revit.DB.Analysis Namespace