Revit 2026 API

# CeilingType Properties

---

The CeilingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the CeilingType |

#### Reference

CeilingType Class

Autodesk.Revit.DB Namespace