Revit 2026 API

# Location Class

---

Provides location functionality for all elements.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLocation Autodesk.Revit.DBLocationCurve Autodesk.Revit.DBLocationPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Location : APIObject
```
```vb
Public Class Location
	Inherits APIObject
```
```cpp
public ref class Location : public APIObject
```
```fsharp
type Location =
    class
        inherit APIObject
    end
```

The Location type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Move | Move the element within the project by a specified vector. |
|  | Rotate | Rotate the element within the project by a specified angle around a given axis. |

The location object provides the ability to translate and rotate elements. More detailed location information and control can be found by using the derivatives of this object, such as LocationPoint or LocationCurve.

#### Reference

Autodesk.Revit.DB Namespace