Revit 2026 API

# IFCFileReadOptions Class

---

This class contains options to read an IFC file.

SystemObject Autodesk.Revit.DB.IFCIFCFileReadOptions

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCFileReadOptions : IDisposable
```
```vb
Public Class IFCFileReadOptions
	Implements IDisposable
```
```cpp
public ref class IFCFileReadOptions : IDisposable
```
```fsharp
type IFCFileReadOptions =
    class
        interface IDisposable
    end
```

The IFCFileReadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCFileReadOptions | Creates a default IFCFileReadOptions. |

|  | Name | Description |
| --- | --- | --- |
|  | FileName | The full file name of the IFC file to be read. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | XMLConfigFileName | The XML configuration file name. It is used only for reading IFC-XML format file. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCFileReadOptions |

#### Reference

Autodesk.Revit.DB.IFC Namespace