Revit 2026 API

# FaceArrayIterator Class

---

An iterator to a face array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFaceArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class FaceArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class FaceArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class FaceArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type FaceArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The FaceArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FaceArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace