Revit 2026 API

# UpdaterId Methods

---

The UpdaterId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetAddInId | AddInId of the UpdaterId |
|  | GetGUID | GUID value of the UpdaterId |

#### Reference

UpdaterId Class

Autodesk.Revit.DB Namespace