Revit 2026 API

# AlphanumericRevisionSettings Methods

---

The AlphanumericRevisionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetSequence | Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType. |
|  | IsEqual | Determines whether a specified AlphanumericRevisionSettings is the same as 'this'. |
|  | IsValid | Determines whether the AlphanumericRevisionSettings object is in a valid state. |
|  | SetSequence |  |

#### Reference

AlphanumericRevisionSettings Class

Autodesk.Revit.DB Namespace