Revit 2026 API

# DWGExportOptions Class

---

The export options used by exporting DWG format file.

SystemObject Autodesk.Revit.DBBaseExportOptions Autodesk.Revit.DBACADExportOptions Autodesk.Revit.DBDWGExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DWGExportOptions : ACADExportOptions
```
```vb
Public Class DWGExportOptions
	Inherits ACADExportOptions
```
```cpp
public ref class DWGExportOptions : public ACADExportOptions
```
```fsharp
type DWGExportOptions =
    class
        inherit ACADExportOptions
    end
```

The DWGExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DWGExportOptions | Constructs a new instance of DWGExportOptions with default values of all properties. |
|  | DWGExportOptions(DWGExportOptions) | Constructs a new instance of DWGExportOptions as a copy of the export options. |

|  | Name | Description |
| --- | --- | --- |
|  | MergedViews | Whether to merge all views in one file (via XRefs). Default value is false for mergedViews. |

|  | Name | Description |
| --- | --- | --- |
|  | GetPredefinedOptions | Returns an instance DWGExportOptions containing settings from a predefined export setup. |

#### Reference

Autodesk.Revit.DB Namespace