Revit 2026 API

# GroundConductorSizeSetIterator Properties

---

The GroundConductorSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

GroundConductorSizeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace