Revit 2026 API

# InsulationType Class

---

**Note: This API is now obsolete.**

Represents electrical insulation type definition information.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ElectricalInsulationType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")]
public class InsulationType : ElementType
```
```vb
<ObsoleteAttribute("InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")>
Public Class InsulationType
	Inherits ElementType
```
```cpp
[ObsoleteAttribute(L"InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")]
public ref class InsulationType : public ElementType
```
```fsharp
[<ObsoleteAttribute("InsulationType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use InsulationMaterial instead. InsulationMaterials will be created by InsulationTypes properly during document upgrade.")>]
type InsulationType =
    class
        inherit ElementType
    end
```

The InsulationType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsInUse | Indicate whether the insulation type is in use. |
|  | Name | Get name of Insulation type. (Overrides ElementTypeName) |

|  | Name | Description |
| --- | --- | --- |

Insulation type is defined based on corresponding wire material type and temperature rating type.

#### Reference

Autodesk.Revit.DB.Electrical Namespace