Revit 2026 API

# CurveNode Methods

---

The CurveNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetCurve | Returns the geometric curve object corresponding to the node. |

#### Reference

CurveNode Class

Autodesk.Revit.DB Namespace