Revit 2026 API

# VertexPair Class

---

Indices of a pair of vertices in two CurveLoops(one vertex in each loop).

SystemObject Autodesk.Revit.DBVertexPair

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexPair : IDisposable
```
```vb
Public Class VertexPair
	Implements IDisposable
```
```cpp
public ref class VertexPair : IDisposable
```
```fsharp
type VertexPair =
    class
        interface IDisposable
    end
```

The VertexPair type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexPair | Constructs a new VertexPair from a pair of indices in the curve loops. |

|  | Name | Description |
| --- | --- | --- |
|  | First | Identifies the first index of VertexPair. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Second | Identifies the second index of VertexPair. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the VertexPair |

A vertex is specified by the index in the CurveLoop of the curve having that vertex as its start point. Indexes start at 0.

#### Reference

Autodesk.Revit.DB Namespace