Revit 2026 API

# Fascia Methods

---

The Fascia type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddSegment | Add segments to the fascia.(Overrides HostedSweepAddSegment(Reference)) |

#### Reference

Fascia Class

Autodesk.Revit.DB.Architecture Namespace