Revit 2026 API

# PlanCircuitSetIterator Methods

---

The PlanCircuitSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

PlanCircuitSetIterator Class

Autodesk.Revit.DB Namespace