Revit 2026 API

# PointLoad Class

---

An object that represents a force/moment applied to a single point. Data members

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureLoadBase Autodesk.Revit.DB.StructurePointLoad

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointLoad : LoadBase
```
```vb
Public Class PointLoad
	Inherits LoadBase
```
```cpp
public ref class PointLoad : public LoadBase
```
```fsharp
type PointLoad =
    class
        inherit LoadBase
    end
```

The PointLoad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ForceVector | The force vector applied to the point load, oriented according to OrientTo setting. |
|  | MomentVector | The moment vector applied to the point load, oriented according to OrientTo setting. |
|  | Point | Returns the position of point load, measured in decimal feet. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) | Creates a new hosted point load within the project. |
|  | Create(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) | Creates a new custom hosted point load within the project using data at point. |
|  | IsPointInsideHostBoundaries | Indicates if the point is inside panel's boundaries or if the point is on the member's curve.. |
|  | IsValidHostId | Indicates if the provided host id can host point loads The document containing both the host and the load The id of the analytical element that is about to host a point load True if a point load can be placed on the input host id |

#### Reference

Autodesk.Revit.DB.Structure Namespace