Revit 2026 API

# FamilyStructuralMaterialTypeFilter Properties

---

The FamilyStructuralMaterialTypeFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialType | The family structural material type. |

#### Reference

FamilyStructuralMaterialTypeFilter Class

Autodesk.Revit.DB.Structure Namespace