Revit 2026 API

# FaceArrayIterator Properties

---

The FaceArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

FaceArrayIterator Class

Autodesk.Revit.DB Namespace