Revit 2026 API

# ModelText Methods

---

The ModelText type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the model text in a family document. |
|  | SetVisibility | Sets the visibility for the model text in a family document. |

#### Reference

ModelText Class

Autodesk.Revit.DB Namespace