Revit 2026 API

# EnergyAnalysisDetailModel Methods

---

The EnergyAnalysisDetailModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new energy analysis detailed model. |
|  | GetAnalyticalOpenings | The collection of analytical openings. |
|  | GetAnalyticalShadingSurfaces | The collection of analytical shading surfaces. |
|  | GetAnalyticalSpaces | The collection of analytical spaces. |
|  | GetAnalyticalSurfaces | The collection of analytical surfaces. |
|  | GetMainEnergyAnalysisDetailModel | Gets the EnergyAnalysisDetailModel in given document. |
|  | TransformModel | Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north. |

#### Reference

EnergyAnalysisDetailModel Class

Autodesk.Revit.DB.Analysis Namespace