Revit 2026 API

# Curve Class

---

A parametric curve.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Curve : GeometryObject
```
```vb
Public Class Curve
	Inherits GeometryObject
```
```cpp
public ref class Curve : public GeometryObject
```
```fsharp
type Curve =
    class
        inherit GeometryObject
    end
```

The Curve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApproximateLength | The approximate length of the curve. |
|  | IsBound | Describes whether the parameter of the curve is restricted to a particular interval. |
|  | IsClosed | Describes whether the curve is closed. |
|  | IsCyclic | The boolean value that indicates whether this curve is cyclic. |
|  | Length | The exact length of the curve. |
|  | Period | The period of this curve. |
|  | Reference | Returns a stable reference to the curve. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this curve. |
|  | ComputeClosestPoints |  |
|  | ComputeDerivatives | Returns the vectors describing the curve at the specified parameter. |
|  | ComputeNormalizedParameter | Computes the normalized curve parameter from the raw parameter. |
|  | ComputeRawParameter | Computes the raw parameter from the normalized parameter. |
|  | CreateOffset | Creates a new curve that is an offset of the existing curve. |
|  | CreateReversed | Creates a new curve with the opposite orientation of the existing curve. |
|  | CreateTransformed | Crates a new instance of a curve as a transformation of this curve. |
|  | Distance | Returns the shortest distance from the specified point to this curve. |
|  | Evaluate | Evaluates and returns the point that matches a parameter along the curve. |
|  | GetEndParameter | Returns the raw parameter value at the start or end of this curve. |
|  | GetEndPoint | Returns the 3D point at the start or end of this curve. |
|  | GetEndPointReference | Returns a stable reference to the start point or the end point of the curve. |
|  | Intersect(Curve) | **Obsolete.** Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, CurveIntersectResultOption) | Calculates the intersection of this curve with the specified curve. |
|  | Intersect(Curve, IntersectionResultArray) | **Obsolete.** Calculates the intersection of this curve with the specified curve and returns the intersection results. |
|  | IsInside(Double) | Indicates whether the specified parameter value is within this curve's bounds. |
|  | IsInside(Double, Int32) | Indicates whether the specified parameter value is within this curve's bounds and outputs the end index. |
|  | MakeBound | Changes the bounds of this curve to the specified values. |
|  | MakeUnbound | Makes this curve unbound. |
|  | Project | Projects the specified point on this curve. |
|  | SetGraphicsStyleId | Sets the graphics style id for this curve. |
|  | Tessellate | Valid only if the curve is bound. Returns a polyline approximation to the curve. |

The concrete curves are defined by parametric equations. If the curve is bound, it is only defined for an interval in parameterization. Otherwise, it is defined for all values of the parameter.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBArc Autodesk.Revit.DBCylindricalHelix Autodesk.Revit.DBEllipse Autodesk.Revit.DBHermiteSpline Autodesk.Revit.DBLine Autodesk.Revit.DBNurbSpline