Revit 2026 API

# FaceSecondDerivatives Methods

---

The FaceSecondDerivatives type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FaceSecondDerivatives Class

Autodesk.Revit.DB Namespace