Revit 2026 API

# ViewPrintingEventArgs Methods

---

The ViewPrintingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSettings | Get the print settings of the active printing session. |

#### Reference

ViewPrintingEventArgs Class

Autodesk.Revit.DB.Events Namespace