Revit 2026 API

# ViewDrafting Methods

---

The ViewDrafting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new ViewDrafting in the model. |

#### Reference

ViewDrafting Class

Autodesk.Revit.DB Namespace