Revit 2026 API

# RevitAPIPostEventArgs Properties

---

The RevitAPIPostEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler). |

#### Reference

RevitAPIPostEventArgs Class

Autodesk.Revit.DB.Events Namespace