Revit 2026 API

# RebarSystemSpanSymbol Methods

---

The RebarSystemSpanSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarSystemSpanSymbol in the project. |

#### Reference

RebarSystemSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace