Revit 2026 API

# DistributionSysTypeSetIterator Class

---

An iterator to a DistributionSys type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalDistributionSysTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class DistributionSysTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class DistributionSysTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class DistributionSysTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type DistributionSysTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The DistributionSysTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DistributionSysTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace