Revit 2026 API

# ArgumentNullException Methods

---

The ArgumentNullException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ArgumentNullException Class

Autodesk.Revit.Exceptions Namespace