Revit 2026 API

# Macro Methods

---

The Macro type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Execute | Executes the macro. |

#### Reference

Macro Class

Autodesk.Revit.DB.Macros Namespace