Revit 2026 API

# ElementDesignOptionFilter Properties

---

The ElementDesignOptionFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DesignOptionId | The design option id. |

#### Reference

ElementDesignOptionFilter Class

Autodesk.Revit.DB Namespace