Revit 2026 API

# LoadBase Class

---

The LoadBase object is the base class for all load objects within the Autodesk Revit API. Data members

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureLoadBase Autodesk.Revit.DB.StructureAreaLoad Autodesk.Revit.DB.StructureLineLoad Autodesk.Revit.DB.StructurePointLoad

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LoadBase : Element
```
```vb
Public Class LoadBase
	Inherits Element
```
```cpp
public ref class LoadBase : public Element
```
```fsharp
type LoadBase =
    class
        inherit Element
    end
```

The LoadBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostElementId | The host element ID for the load. |
|  | IsConstrainedOnHost | The load is constrained to host or not. |
|  | IsHosted | Indicates if the Load is hosted or non-hosted. |
|  | IsReaction | The load is reaction option. |
|  | LoadCase | The load case for the load. |
|  | LoadCaseId | The load case ID for the load. |
|  | LoadCaseName | The name of the load case to which this load belongs. |
|  | LoadCategoryName | The name of the category to which this load belongs. |
|  | LoadNatureName | A string representing the nature of the load. |
|  | OrientTo | The load orientation option. |
|  | WorkPlaneId | Id of the work plane which may determine the orientation of the load. |

|  | Name | Description |
| --- | --- | --- |
|  | IsOrientToPermitted | Indicates if the provided orientation is permitted for this load. |
|  | RemoveHostConstraint | Removes constraint from host for this load. |

Load objects are only available in Autodesk Revit Structure. This object contains methods that are common to all other load objects.

#### Reference

Autodesk.Revit.DB.Structure Namespace