Revit 2026 API

# RevolvedFace Class

---

A revolved face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBRevolvedFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevolvedFace : Face
```
```vb
Public Class RevolvedFace
	Inherits Face
```
```cpp
public ref class RevolvedFace : public Face
```
```fsharp
type RevolvedFace =
    class
        inherit Face
    end
```

The RevolvedFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | Curve | Profile curve of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radius of the surface. |

|  | Name | Description |
| --- | --- | --- |

Revolved faces are defined by a profile curve and a local coordinate system. For details on the parameterization, refer to the documentation for RevolvedSurface

#### Reference

Autodesk.Revit.DB Namespace