Revit 2026 API

# IFCOpeningData Methods

---

The IFCOpeningData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetExtrusionData | Gets extrusion data. |
|  | GetOpeningSolids | Gets opening solids. |

#### Reference

IFCOpeningData Class

Autodesk.Revit.DB.IFC Namespace