Revit 2026 API

# DataConversionMonitorScope Methods

---

The DataConversionMonitorScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

DataConversionMonitorScope Class

Autodesk.Revit.DB Namespace