Revit 2026 API

# FormArrayIterator Class

---

An iterator to a form array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFormArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class FormArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class FormArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class FormArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type FormArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The FormArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FormArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace