Revit 2026 API

# AssetPropertyDouble Methods

---

The AssetPropertyDouble type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

AssetPropertyDouble Class

Autodesk.Revit.DB.Visual Namespace