Revit 2026 API

# Point Methods

---

The Point type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(XYZ) | Creates a point at the given coordinates. |
|  | Create(XYZ, ElementId) | Creates a point at the given coordinates and assigns it the specified GraphicsStyle. |

#### Reference

Point Class

Autodesk.Revit.DB Namespace