Revit 2026 API

# ReferencePointArrayIterator Class

---

An iterator to a reference array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReferencePointArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ReferencePointArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ReferencePointArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ReferencePointArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ReferencePointArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ReferencePointArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferencePointArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace