Revit 2026 API

# GenericZone Methods

---

The GenericZone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddSpaces |  |
|  | ConvertSpaceBasedToSketchBased | Converts a space-based generic zone to a sketch-based generic zone. |
|  | Create | **Obsolete.** |
|  | CreateSketchBased |  |
|  | CreateSpaceBased |  |
|  | GetBoundaries | Gets the boundaries for the generic zone. |
|  | GetDomainData | Gets the domain data for the generic zone. |
|  | GetSketchId | Gets the sketch id for the generic zone. |
|  | GetSpaceIds | Gets a list of ElementIds of the associated spaces for the zone. |
|  | RemoveSpaces |  |

#### Reference

GenericZone Class

Autodesk.Revit.DB.Analysis Namespace