Revit 2026 API

# ElementTypeDuplicatingEventArgs Properties

---

The ElementTypeDuplicatingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementTypeId | The id of the ElementType to be duplicated. |

#### Reference

ElementTypeDuplicatingEventArgs Class

Autodesk.Revit.DB.Events Namespace