Revit 2026 API

# PlanTopology Properties

---

The PlanTopology type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Circuits | The Circuits of the PlanTopology. |
|  | Level | The Level of the PlanTopology. |
|  | Phase | The phase of the PlanTopology. |

#### Reference

PlanTopology Class

Autodesk.Revit.DB Namespace