Revit 2026 API

# IFCFileModelOptions Methods

---

The IFCFileModelOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCFileModelOptions Class

Autodesk.Revit.DB.IFC Namespace