Revit 2026 API

# FileOpenDialog Properties

---

The FileOpenDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShowPreview | Identifies if the dialog should include a region showing a preview of the selected file. |

#### Reference

FileOpenDialog Class

Autodesk.Revit.UI Namespace