Revit 2026 API

# SharedParameterApplicableRule Properties

---

The SharedParameterApplicableRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ParameterName | The name of the parameter that an element must support to pass this rule. |

#### Reference

SharedParameterApplicableRule Class

Autodesk.Revit.DB Namespace