Revit 2026 API

# LoadComponent Methods

---

The LoadComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

LoadComponent Class

Autodesk.Revit.DB.Structure Namespace