Revit 2026 API

# FilterStringGreaterOrEqual Class

---

Tests whether string values from the document would sort after or match a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringGreaterOrEqual

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringGreaterOrEqual : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringGreaterOrEqual
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringGreaterOrEqual : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringGreaterOrEqual =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringGreaterOrEqual type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringGreaterOrEqual | Constructs an instance of FilterStringGreaterOrEqual. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace