Revit 2026 API

# LightShape Methods

---

The LightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LightShape derived object. |
|  | Dispose |  |

#### Reference

LightShape Class

Autodesk.Revit.DB.Lighting Namespace