Revit 2026 API

# CableTraySettings Methods

---

The CableTraySettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetCableTraySettings | Gets the cable tray settings of the project. |

#### Reference

CableTraySettings Class

Autodesk.Revit.DB.Electrical Namespace