Revit 2026 API

# ExportLayerKey Methods

---

The ExportLayerKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportLayerKey Class

Autodesk.Revit.DB Namespace