Revit 2026 API

# EnergyAnalysisSpace Properties

---

The EnergyAnalysisSpace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The area for this space. |
|  | CADObjectUniqueId | The unique id of the originating CAD object (model element) associated with this space. |
|  | ComposedName | The composed name for this space. |
|  | Description | The description. |
|  | Number | The number to identify the space. |
|  | SpaceName | The name. |
|  | Volume | The volume for this space. |

#### Reference

EnergyAnalysisSpace Class

Autodesk.Revit.DB.Analysis Namespace