Revit 2026 API

# Area Class

---

Provides access to the area topology in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElement Autodesk.Revit.DBArea

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Area : SpatialElement
```
```vb
Public Class Area
	Inherits SpatialElement
```
```cpp
public ref class Area : public SpatialElement
```
```fsharp
type Area =
    class
        inherit SpatialElement
    end
```

The Area type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaScheme | The area scheme. |
|  | IsGrossInterior | The boolean value that indicates whether the area is gross interior. |

|  | Name | Description |
| --- | --- | --- |

The area object can be queried for its boundary for use in space planning tools.

#### Reference

Autodesk.Revit.DB Namespace