Revit 2026 API

# DuctLiningType Class

---

This class represents a duct lining type in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.MechanicalDuctLiningType

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctLiningType : ElementType
```
```vb
Public Class DuctLiningType
	Inherits ElementType
```
```cpp
public ref class DuctLiningType : public ElementType
```
```fsharp
type DuctLiningType =
    class
        inherit ElementType
    end
```

The DuctLiningType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Roughness | The roughness of Duct Lining. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidRoughness | Identifies if the input roughness is valid. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace