Revit 2026 API

# Path3d Class

---

Provides access to the Generic 3D path object in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSketchBase Autodesk.Revit.DBPath3d

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Path3d : SketchBase
```
```vb
Public Class Path3d
	Inherits SketchBase
```
```cpp
public ref class Path3d : public SketchBase
```
```fsharp
type Path3d =
    class
        inherit SketchBase
    end
```

The Path3d type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllCurveLoops | Get all the Curve Loops of Path3d. |
|  | CurveLoop | Get the Curve Loop of Path3d via index. |
|  | NumCurveLoops | Get the Number of Curve Loops of Path3d. |

|  | Name | Description |
| --- | --- | --- |

This object represents a 3D path sketch of Sweep.

#### Reference

Autodesk.Revit.DB Namespace