Revit 2026 API

# Stairs Class

---

Represents a stairs element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.ArchitectureStairs

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Stairs : Element
```
```vb
Public Class Stairs
	Inherits Element
```
```cpp
public ref class Stairs : public Element
```
```fsharp
type Stairs =
    class
        inherit Element
    end
```

The Stairs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActualRiserHeight | The actual height of the stairs risers in the stairs. |
|  | ActualRisersNumber | The total number of actually created risers in model. |
|  | ActualTreadDepth | The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default. |
|  | ActualTreadsNumber | The number of treads actually created in the stairs. |
|  | BaseElevation | The base elevation of the stairs. |
|  | DesiredRisersNumber | The number of risers is calculated based on the height between levels. |
|  | Height | The height of the stair between the base and top levels. |
|  | MultistoryStairsId | The id of the MultistoryStairs element to which this element belongs. If this stairs element is not a member of a MultistoryStairs element, this will be InvalidElementId. |
|  | NumberOfStories | The number of stories of a multi-story stair, or 1 for a single-story stair. |
|  | TopElevation | The top elevation of the stairs. |

|  | Name | Description |
| --- | --- | --- |
|  | GetAssociatedRailings | Gets a list of the Railing elements which are associated to the boundaries of the stairs. |
|  | GetStairsLandings | Returns all the stairs landing components in the stairs. |
|  | GetStairsRuns | Returns all the stairs run components in the stairs. |
|  | GetStairsSupports | Returns all the stairs support components in the stairs. |
|  | IsByComponent | Indicates if the stairs is created by stairs components(runs, landings and supports). |
|  | IsInEditMode | Indicates whether the stairs is in edit mode or not. |

This element may represent a standalone Stairs element, or a member of a MultistoryStairs element. Use MultistoryStairsId to identify if this Stairs element is a part of a MultistoryStairs.

#### Reference

Autodesk.Revit.DB.Architecture Namespace