Revit 2026 API

# ElementNode Class

---

A render node that represents an element, including the host document containing the element.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBElementNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementNode : RenderNode
```
```vb
Public Class ElementNode
	Inherits RenderNode
```
```cpp
public ref class ElementNode : public RenderNode
```
```fsharp
type ElementNode =
    class
        inherit RenderNode
    end
```

The ElementNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | Gets the document associated with the element. |
|  | ElementId | The Id of the element. |
|  | LinkInstanceId | The Id of the link instance for the element. |

|  | Name | Description |
| --- | --- | --- |

See also: [!:Autodesk::Revit::DB::IExportContext2D::OnElementBegin2D]. See also: [!:Autodesk::Revit::DB::IExportContext2D::OnElementEnd2D].

#### Reference

Autodesk.Revit.DB Namespace