Revit 2026 API

# SystemZoneData Properties

---

The SystemZoneData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ZoneEquipmentId | The id of the zone equipment related to the zone. |

#### Reference

SystemZoneData Class

Autodesk.Revit.DB.Mechanical Namespace