Revit 2026 API

# AccessDeniedException Methods

---

The AccessDeniedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

AccessDeniedException Class

Autodesk.Revit.Exceptions Namespace