Revit 2026 API

# ContinuousRail Properties

---

The ContinuousRail type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostRailingId | The id of the host Railing that contains this rail. |
|  | Length | The length of the rail. |

#### Reference

ContinuousRail Class

Autodesk.Revit.DB.Architecture Namespace