Revit 2026 API

# DataConversionMonitorScope Class

---

This class is used to regsiter an application-supplied object that implements IDataConversionMonitor. Creating the object registers an implementation of IDataConversionMonitor supplied as constructor argument. When the scope object is destroyed, that object is unregistered.

SystemObject Autodesk.Revit.DBDataConversionMonitorScope

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DataConversionMonitorScope : IDisposable
```
```vb
Public Class DataConversionMonitorScope
	Implements IDisposable
```
```cpp
public ref class DataConversionMonitorScope : IDisposable
```
```fsharp
type DataConversionMonitorScope =
    class
        interface IDisposable
    end
```

The DataConversionMonitorScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DataConversionMonitorScope | The only constructor. Expects a valid pointer to IDataConversionMonitor. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DataConversionMonitorScope |

#### Reference

Autodesk.Revit.DB Namespace