Revit 2026 API

# GeomCombinationSetIterator Properties

---

The GeomCombinationSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

GeomCombinationSetIterator Class

Autodesk.Revit.DB Namespace