Revit 2026 API

# ZoneEquipment Methods

---

The ZoneEquipment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new zone equipment |
|  | GetAssociatedZoneEquipment(Document, ElementId) | Gets the associated zone equipment of the specified analytical space. |
|  | GetAssociatedZoneEquipment(Document, ISetElementId) |  |
|  | GetZoneEquipmentData | Gets the zone equipment data. |
|  | MoveSpaceToEquipment |  |

#### Reference

ZoneEquipment Class

Autodesk.Revit.DB.Mechanical Namespace