Revit 2026 API

# ReferencePointArray Class

---

An array that contains reference objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReferencePointArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReferencePointArray : APIObject,
	IEnumerable
```
```vb
Public Class ReferencePointArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ReferencePointArray : public APIObject,
	IEnumerable
```
```fsharp
type ReferencePointArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ReferencePointArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferencePointArray | Initializes a new instance of the ReferencePointArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a reference at a specified index within the array. |
|  | Size | Returns the number of references that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every reference from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace