Revit 2026 API

# ViewSet Class

---

A set that contains views.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBViewSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewSet : APIObject, IEnumerable
```
```vb
Public Class ViewSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ViewSet : public APIObject,
	IEnumerable
```
```fsharp
type ViewSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ViewSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewSet | Initializes a new instance of the ViewSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of views that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every view from the set, rendering it empty. |
|  | Contains | Tests for the existence of a view within the set. |
|  | Erase | Removes a specified view from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified view into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace