Revit 2026 API

# SlabEdge Properties

---

The SlabEdge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SlabEdgeType | Retrieves/set an object that represents the type of the SlabEdge. |

#### Reference

SlabEdge Class

Autodesk.Revit.DB Namespace