Revit 2026 API

# CentralModelVersionArchivedException Methods

---

The CentralModelVersionArchivedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CentralModelVersionArchivedException Class

Autodesk.Revit.Exceptions Namespace