Revit 2026 API

# IndexLine Methods

---

The IndexLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

#### Reference

IndexLine Class

Autodesk.Revit.DB.DirectContext3D Namespace