Revit 2026 API

# ElementSet Class

---

A set that contains element objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBElementSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementSet : APIObject, IEnumerable
```
```vb
Public Class ElementSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ElementSet : public APIObject,
	IEnumerable
```
```fsharp
type ElementSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ElementSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementSet | Initializes a new instance of the ElementSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of elements that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item element the set, rendering it empty. |
|  | Contains | Tests for the existence of an element within the set. |
|  | Erase | Removes a specified element from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified element into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace