Revit 2026 API

# SolidOptions Methods

---

The SolidOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SolidOptions Class

Autodesk.Revit.DB Namespace