Revit 2026 API

# PlanCircuit Properties

---

The PlanCircuit type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The enclosed area of the circuit. |
|  | IsRoomLocated | Reports whether there is a room located in this circuit. |
|  | SideNum | The number of sides in the circuit. |

#### Reference

PlanCircuit Class

Autodesk.Revit.DB Namespace