Revit 2026 API

# PolyLine Methods

---

The PolyLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this polyline. |
|  | Create |  |
|  | Evaluate | Evaluates a parameter on the polyline. |
|  | GetCoordinate | Gets the coordinate point of the specified index. |
|  | GetCoordinates | Gets the coordinate points of the polyline. |
|  | GetOutline | Gets the outline of the polyline. |
|  | GetTransformed | Gets the copy of the polyline which is applied the specified transformation. |

#### Reference

PolyLine Class

Autodesk.Revit.DB Namespace