Revit 2026 API

# DimensionSegmentArrayIterator Class

---

An iterator to an array of DimensionSegment objects..

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDimensionSegmentArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class DimensionSegmentArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class DimensionSegmentArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class DimensionSegmentArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type DimensionSegmentArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The DimensionSegmentArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DimensionSegmentArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace