Revit 2026 API

# AssemblyMemberDifference Methods

---

The AssemblyMemberDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

AssemblyMemberDifference Class

Autodesk.Revit.DB Namespace