Revit 2026 API

# MEPAnalyticalConnectionType Properties

---

The MEPAnalyticalConnectionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PressureLoss | The pressure loss of this analytical connection type. |

#### Reference

MEPAnalyticalConnectionType Class

Autodesk.Revit.DB Namespace