Revit 2026 API

# CurtainSystem Class

---

Provides access to the CurtainSystem object in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCurtainSystemBase Autodesk.Revit.DBCurtainSystem

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurtainSystem : CurtainSystemBase
```
```vb
Public Class CurtainSystem
	Inherits CurtainSystemBase
```
```cpp
public ref class CurtainSystem : public CurtainSystemBase
```
```fsharp
type CurtainSystem =
    class
        inherit CurtainSystemBase
    end
```

The CurtainSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Get all the CurtainGrid object of this CurtainSystem. Each CurtainGrid corresponds to one face. |
|  | CurtainSystemType | get or set the type of the CurtainSystem. |

|  | Name | Description |
| --- | --- | --- |
|  | AddCurtainGrid | Add CurtainGrid on the specified face for the CurtainSystem. |
|  | RemoveCurtainGrid | Remove CurtainGrid from the specified face for the CurtainSystem. |

The user can create CurtainSystem object and change the internal properties.

#### Reference

Autodesk.Revit.DB Namespace