Revit 2026 API

# FieldDomainPointsByUV Methods

---

The FieldDomainPointsByUV type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SetGridCoordinates |  |

#### Reference

FieldDomainPointsByUV Class

Autodesk.Revit.DB.Analysis Namespace