Revit 2026 API

# CableTrayConduitRunBase Properties

---

The CableTrayConduitRunBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Length | The length of the whole (cable tray or conduit) run default 0.0 |

#### Reference

CableTrayConduitRunBase Class

Autodesk.Revit.DB.Electrical Namespace