Revit 2026 API

# CircuitNamingScheme Methods

---

The CircuitNamingScheme type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | GetCombinedParameters | Gets the combined parameters. |
|  | IsNameUnique | Validates whether the CircuitNamingScheme name is unique in document. |
|  | IsValidCombinedParameters |  |
|  | SetCombinedParameters |  |

#### Reference

CircuitNamingScheme Class

Autodesk.Revit.DB.Electrical Namespace