Revit 2026 API

# BoundingBoxIsInsideFilter Methods

---

The BoundingBoxIsInsideFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundingBox | Gets the outline being used for this filter. |

#### Reference

BoundingBoxIsInsideFilter Class

Autodesk.Revit.DB Namespace