Revit 2026 API

# IFCGuidKey Methods

---

The IFCGuidKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals | Determines whether this IFCGuidKey is equal to another. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Returns the hash code for this IFCGuidKey (Overrides ObjectGetHashCode) |

#### Reference

IFCGuidKey Class

Autodesk.Revit.DB.IFC Namespace