Revit 2026 API

# FilePath Class

---

This class represents a path on a disk or network location, but not a path to a Revit server location.

SystemObject Autodesk.Revit.DBModelPath Autodesk.Revit.DBFilePath

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilePath : ModelPath
```
```vb
Public Class FilePath
	Inherits ModelPath
```
```cpp
public ref class FilePath : public ModelPath
```
```fsharp
type FilePath =
    class
        inherit ModelPath
    end
```

The FilePath type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilePath | Constructs a FilePath |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace