Revit 2026 API

# RebarConstrainedHandle Methods

---

The RebarConstrainedHandle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanSetBehavior | Checks if the input behavior can be set for this RebarConstrainedHandle. |
|  | Dispose |  |
|  | GetCustomHandleTag | Returns the tag of the handle. The type of the handle should be 'CustomHandle'. |
|  | GetEdgeNumber | If the RebarConstrainedHandle's RebarHandleType is 'Edge', then this function will return the number of the edge that is driven by the handle. |
|  | GetHandleName | Gets the name of the handle. |
|  | GetHandleSurface | Gets the surface of this handle. |
|  | GetHandleType | Returns the RebarHandleType of a RebarConstrainedHandle. |
|  | GetPossibleHandleBehaviors | Gets a list of possible handle behaviors for the current handle. |
|  | IsCustomHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'CustomHandle'. |
|  | IsEdgeHandle | Returns true if the RebarHandleType of the RebarConstrainedHandle is 'Edge'. |
|  | IsEqual | Checks if the specified RebarConstrainedHandle is the same as 'this'. |
|  | IsValid | Checks that the RebarConstrainedHandle still has access to valid Rebar handle data and that its RebarConstraintsManager is still valid. |
|  | Move | Moves the handle with the specified vector. This function applies only for shape driven rebar. |

#### Reference

RebarConstrainedHandle Class

Autodesk.Revit.DB.Structure Namespace