Revit 2026 API

# FlexPipe Class

---

A flex pipe in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DB.PlumbingFlexPipe

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FlexPipe : MEPCurve
```
```vb
Public Class FlexPipe
	Inherits MEPCurve
```
```cpp
public ref class FlexPipe : public MEPCurve
```
```fsharp
type FlexPipe =
    class
        inherit MEPCurve
    end
```

The FlexPipe type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndTangent | Gets or sets the tangent vector at the end of the curve. The invalid or zero vector is ignored when setting the tangent. |
|  | FlexPipeType | The flex pipe type of this flex pipe. |
|  | FlowState | The flow state of the pipe. |
|  | Points | The points of the flex pipe. |
|  | StartTangent | Gets or sets the tangent vector at the start of the curve. The invalid or zero vector is ignored when setting the tangent. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IListXYZ) |  |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IListXYZ) |  |
|  | IsFlexPipeTypeId | Checks if given type is valid flexible pipe type. |
|  | IsPipingSystemTypeId | Checks if given type is valid piping system type. |

The flex pipe is only available in the Autodesk Revit MEP product.

#### Reference

Autodesk.Revit.DB.Plumbing Namespace