Revit 2026 API

# TessellatedFace Methods

---

The TessellatedFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBoundaryLoops | Get loops bounding the face. |

#### Reference

TessellatedFace Class

Autodesk.Revit.DB Namespace