Revit 2026 API

# BendingDetailCustomFieldProperties Methods

---

The BendingDetailCustomFieldProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreEqualTo | Identifies if the custom field properties are equal or not. |
|  | Dispose |  |

#### Reference

BendingDetailCustomFieldProperties Class

Autodesk.Revit.DB.Structure Namespace