Revit 2026 API

# ElementOwnerViewFilter Properties

---

The ElementOwnerViewFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewId | The view id. |

#### Reference

ElementOwnerViewFilter Class

Autodesk.Revit.DB Namespace