Revit 2026 API

# MechanicalSystemType Properties

---

The MechanicalSystemType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RiseDropSettings | indicates the rise/drop symbol given the system type |

#### Reference

MechanicalSystemType Class

Autodesk.Revit.DB.Mechanical Namespace