Revit 2026 API

# PaperSourceSetIterator Properties

---

The PaperSourceSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

PaperSourceSetIterator Class

Autodesk.Revit.DB Namespace