Revit 2026 API

# APIObject Methods

---

The APIObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing. |

#### Reference

APIObject Class

Autodesk.Revit.DB Namespace