Revit 2026 API

# VertexStreamPositionNormalColored Methods

---

The VertexStreamPositionNormalColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionNormalColored into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

VertexStreamPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace