Revit 2026 API

# FamilyTypeSetIterator Methods

---

The FamilyTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

FamilyTypeSetIterator Class

Autodesk.Revit.DB Namespace