Revit 2026 API

# RebarShapeVertex Methods

---

The RebarShapeVertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetConstraints | Retrieve the list of constraints associated with this vertex. |
|  | SetConstraints |  |

#### Reference

RebarShapeVertex Class

Autodesk.Revit.DB.Structure Namespace