Revit 2026 API

# DetailCurveArrayIterator Class

---

An iterator to a array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDetailCurveArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class DetailCurveArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class DetailCurveArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class DetailCurveArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type DetailCurveArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The DetailCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DetailCurveArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace