Revit 2026 API

# GeometryInstance Properties

---

The GeometryInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SymbolGeometry | The geometric representation of the symbol which generates this instance. |
|  | Transform | The affine transformation from the local coordinate space of the symbol into the coordinate space of the instance. |

#### Reference

GeometryInstance Class

Autodesk.Revit.DB Namespace