Revit 2026 API

# InternalException Methods

---

The InternalException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InternalException Class

Autodesk.Revit.Exceptions Namespace