Revit 2026 API

# PrintSetting Class

---

Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBPrintSetting

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrintSetting : Element,
	IPrintSetting
```
```vb
Public Class PrintSetting
	Inherits Element
	Implements IPrintSetting
```
```cpp
public ref class PrintSetting : public Element,
	IPrintSetting
```
```fsharp
type PrintSetting =
    class
        inherit Element
        interface IPrintSetting
    end
```

The PrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | Returns the Name of Print Setup.(Overrides ElementName) |
|  | PrintParameters | Returns the Parameters of Print Setup. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace