Revit 2026 API

# InSessionPrintSetting Class

---

Represents the in-session Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

SystemObject Autodesk.Revit.DBInSessionPrintSetting

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InSessionPrintSetting : IPrintSetting,
	IDisposable
```
```vb
Public Class InSessionPrintSetting
	Implements IPrintSetting, IDisposable
```
```cpp
public ref class InSessionPrintSetting : IPrintSetting,
	IDisposable
```
```fsharp
type InSessionPrintSetting =
    class
        interface IPrintSetting
        interface IDisposable
    end
```

The InSessionPrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrintParameters | Returns the Parameters of Print Setup. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the InSessionPrintSetting |

The in-session PrintSetting can't be stored in document.

#### Reference

Autodesk.Revit.DB Namespace