Revit 2026 API

# AssetPropertyEnum Methods

---

The AssetPropertyEnum type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

AssetPropertyEnum Class

Autodesk.Revit.DB.Visual Namespace