Revit 2026 API

# FabricAreaType Methods

---

The FabricAreaType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultFabricAreaType | Creates a new FabricAreaType object with a default name. |

#### Reference

FabricAreaType Class

Autodesk.Revit.DB.Structure Namespace