Revit 2026 API

# VertexPositionNormalColored Properties

---

The VertexPositionNormalColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Normal | The vertex's normal vector. |
|  | Position | The vertex's position. |

#### Reference

VertexPositionNormalColored Class

Autodesk.Revit.DB.DirectContext3D Namespace