Revit 2026 API

# Surface Methods

---

The Surface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBoundingBoxUV | Gets the UV bounding box of the surface. |
|  | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. |
|  | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. |

#### Reference

Surface Class

Autodesk.Revit.DB Namespace