Revit 2026 API

# LayoutRuleClearSpacing Properties

---

The LayoutRuleClearSpacing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | JustifyType | Get or set the type of justification. |
|  | Spacing | Get or set the spacing of the beam system. |

#### Reference

LayoutRuleClearSpacing Class

Autodesk.Revit.DB Namespace