Revit 2026 API

# AssemblyInstance Class

---

Combines multiple elements for tagging, filtering, scheduling and creating isolated assembly views.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBAssemblyInstance

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyInstance : Element
```
```vb
Public Class AssemblyInstance
	Inherits Element
```
```cpp
public ref class AssemblyInstance : public Element
```
```fsharp
type AssemblyInstance =
    class
        inherit Element
    end
```

The AssemblyInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyTypeName | The name for the assembly type. All matching assembly instances share this name. Unique assembly instances are named automatically based on their naming category. |
|  | Location | This property is used to find the physical location of the assembly instance within project.(Overrides ElementLocation) |
|  | NamingCategoryId | Id of the category that drives the default naming scheme for the assembly instance. |

|  | Name | Description |
| --- | --- | --- |
|  | AddMemberIds |  |
|  | AllowsAssemblyViewCreation | Returns true if assembly views can be created for this Assembly Instance. |
|  | AreElementsValidForAssembly |  |
|  | CanRemoveElementsFromAssembly |  |
|  | CompareAssemblyInstances | Compares two assembly instances and returns a result with details about the differences |
|  | Create |  |
|  | Disassemble | Removes the assembly instance and releases the member elements. |
|  | GetCenter | Returns the center of the bounding box for the assembly instance. This is the default position for placed assembly instances. |
|  | GetMemberIds | Gets member element ids for the assembly instance. |
|  | GetTransform | Gets the origin of the assembly instance. |
|  | IsMember | Determines whether the given ElementId is a member of this assembly |
|  | IsValidNamingCategory |  |
|  | PlaceInstance | Places an assembly instance of a given assembly type at the specified location. |
|  | RemoveMemberIds |  |
|  | SetMemberIds |  |
|  | SetTransform | Sets the origin of the assembly instance. |

#### Reference

Autodesk.Revit.DB Namespace