Revit 2026 API

# SpaceTag Properties

---

The SpaceTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Space | The space that the tag is associated with. |
|  | SpaceTagType | The tag type. |

#### Reference

SpaceTag Class

Autodesk.Revit.DB.Mechanical Namespace