Revit 2026 API

# ElectricalSystem Methods

---

The ElectricalSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddToCircuit | Add a set of exist components to the Electrical System. |
|  | Create(Connector, ElectricalSystemType) | Creates a new MEP Electrical System element from an unused Connector. |
|  | Create(Document, IListElementId, ElectricalSystemType) |  |
|  | DisconnectPanel | Disconnect the panel for the Electrical System. |
|  | GetCircuitPath | Gets the list of the electrical system circuit path node position. |
|  | IsCircuitPathValid |  |
|  | NewWires | Create a bunch of wires for the electrical system. |
|  | RemoveFromCircuit | remove a set of exist components from the Electrical System. |
|  | SelectPanel | Set the panel for the Electrical System. |
|  | SetCircuitPath |  |

#### Reference

ElectricalSystem Class

Autodesk.Revit.DB.Electrical Namespace