Revit 2026 API

# InitialWattageIntensity Properties

---

The InitialWattageIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Efficacy | The efficacy value. |
|  | Wattage | The wattage value. |

#### Reference

InitialWattageIntensity Class

Autodesk.Revit.DB.Lighting Namespace