Revit 2026 API

# AreaReinforcementType Methods

---

The AreaReinforcementType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultAreaReinforcementType | Creates a new AreaReinforcementType object with a default name. |

#### Reference

AreaReinforcementType Class

Autodesk.Revit.DB.Structure Namespace