Revit 2026 API

# WorksetPreview Class

---

Represents an accessor for workset data which can be obtained from an unopened document.

SystemObject Autodesk.Revit.DBWorksetPreview Autodesk.Revit.DBWorkset

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WorksetPreview : IDisposable
```
```vb
Public Class WorksetPreview
	Implements IDisposable
```
```cpp
public ref class WorksetPreview : IDisposable
```
```fsharp
type WorksetPreview =
    class
        interface IDisposable
    end
```

The WorksetPreview type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | Id of the workset. |
|  | IsDefaultWorkset | Whether the workset is the default one. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | Name of the workset. |
|  | Owner | User name of the workset. |
|  | UniqueId | UniqueId of the workset. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the WorksetPreview |

As a base class of Workset, this class has limited access to data. WorksetPreviews are obtained from WorksharingUtils.GetUserWorksetInfo() from an unopened document.

#### Reference

Autodesk.Revit.DB Namespace