Revit 2026 API

# ViewShapeBuilder Methods

---

The ViewShapeBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCurve | Add a curve to the GRep associated to this ViewShapeBuilder. |
|  | Reset | Clears the accumulated geometry and resets other ViewShapeBuilder parameters to invalid values. |
|  | ValidateCurve(Curve) | Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. Expects a valid view normal to be set prior to the call. |
|  | ValidateCurve(Curve, DirectShapeTargetViewType) | Validates curve to be added to the view-specific shape being constructed. Called by AddCurve() to validate input. This function may be used to pre-validate the geometry being added to avoid AddCurve() throwing an InvalidArgumentException |
|  | ValidateShape |  |
|  | ValidateViewType | Validates the incoming view type. As of today, the only allowed view type is Plan. |

#### Reference

ViewShapeBuilder Class

Autodesk.Revit.DB Namespace