Revit 2026 API

# RelinquishedItems Class

---

List of elements and worksets that were relinquished by the current user.

SystemObject Autodesk.Revit.DBRelinquishedItems

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RelinquishedItems : IDisposable
```
```vb
Public Class RelinquishedItems
	Implements IDisposable
```
```cpp
public ref class RelinquishedItems : IDisposable
```
```fsharp
type RelinquishedItems =
    class
        interface IDisposable
    end
```

The RelinquishedItems type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RelinquishedItems |
|  | GetRelinquishedElements | The elements that were relinquished by the current user. |
|  | GetRelinquishedWorksets | The elements that were relinquished by the current user. |

#### Reference

Autodesk.Revit.DB Namespace