Revit 2026 API

# EdgeArrayIterator Class

---

An iterator to an edge array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBEdgeArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class EdgeArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class EdgeArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class EdgeArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type EdgeArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The EdgeArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EdgeArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace