Revit 2026 API

# SharedParameterElement Properties

---

The SharedParameterElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GuidValue | The Guid that identifies this shared parameter. |

#### Reference

SharedParameterElement Class

Autodesk.Revit.DB Namespace