Revit 2026 API

# FieldValues Methods

---

The FieldValues type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FieldValues Class

Autodesk.Revit.DB.Analysis Namespace