Revit 2026 API

# DefaultValueException Methods

---

The DefaultValueException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

DefaultValueException Class

Autodesk.Revit.Exceptions Namespace