Revit 2026 API

# ExportFontKey Methods

---

The ExportFontKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportFontKey Class

Autodesk.Revit.DB Namespace