Revit 2026 API

# CanExecuteEventArgs Methods

---

The CanExecuteEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSelectedCategoryIds | Gets the category ids of selected elements. |

#### Reference

CanExecuteEventArgs Class

Autodesk.Revit.UI.Events Namespace