Revit 2026 API

# DetailEllipse Class

---

Represents a DetailEllipse within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBDetailCurve Autodesk.Revit.DBDetailEllipse

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DetailEllipse : DetailCurve
```
```vb
Public Class DetailEllipse
	Inherits DetailCurve
```
```cpp
public ref class DetailEllipse : public DetailCurve
```
```fsharp
type DetailEllipse =
    class
        inherit DetailCurve
    end
```

The DetailEllipse type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace