Revit 2026 API

# SteelElementProperties Methods

---

The SteelElementProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddFabricationInformationForRevitElements |  |
|  | GetFabricationUniqueID | This method will return the fabrication id for the given reference. |
|  | GetReference | This method will return the reference for the given fabrication id. |
|  | GetSteelElementProperties | Get SteelElementProperties for the input element if they exist. |

#### Reference

SteelElementProperties Class

Autodesk.Revit.DB.Steel Namespace