Revit 2026 API

# ParameterElement Methods

---

The ParameterElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDefinition | Get the definition representing this parameter element. |

#### Reference

ParameterElement Class

Autodesk.Revit.DB Namespace