Revit 2026 API

# ExtrusionRoof Properties

---

The ExtrusionRoof type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof. |

#### Reference

ExtrusionRoof Class

Autodesk.Revit.DB Namespace