Revit 2026 API

# AssemblyDifference Class

---

Class that describes difference between two assemblies.

SystemObject Autodesk.Revit.DBAssemblyDifference More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifference : IDisposable
```
```vb
Public Class AssemblyDifference
	Implements IDisposable
```
```cpp
public ref class AssemblyDifference : IDisposable
```
```fsharp
type AssemblyDifference =
    class
        interface IDisposable
    end
```

The AssemblyDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AssemblyDifference |

The assembly comparison function returns a sub-class of this class. Different sub-classes represent different kinds of differences and contain additional data for each particular kind of difference.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceConfiguration Autodesk.Revit.DBAssemblyDifferenceMemberCount Autodesk.Revit.DBAssemblyDifferenceMemberDifference Autodesk.Revit.DBAssemblyDifferenceNamingCategory Autodesk.Revit.DBAssemblyDifferenceNone