Revit 2026 API

# BindingMap Properties

---

The BindingMap type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Item | The get_Item method will get the binding item related to the input key.(Overrides DefinitionBindingMapItemDefinition) |

#### Reference

BindingMap Class

Autodesk.Revit.DB Namespace