Revit 2026 API

# EdgeArrayArrayIterator Methods

---

The EdgeArrayArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

EdgeArrayArrayIterator Class

Autodesk.Revit.DB Namespace