Revit 2026 API

# ModelNurbSpline Class

---

Represents a ModelNurbSpline within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve Autodesk.Revit.DBModelNurbSpline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelNurbSpline : ModelCurve
```
```vb
Public Class ModelNurbSpline
	Inherits ModelCurve
```
```cpp
public ref class ModelNurbSpline : public ModelCurve
```
```fsharp
type ModelNurbSpline =
    class
        inherit ModelCurve
    end
```

The ModelNurbSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from ModelCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace