Revit 2026 API

# ModelLine Class

---

Represents a ModelLine within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve Autodesk.Revit.DBModelLine

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelLine : ModelCurve
```
```vb
Public Class ModelLine
	Inherits ModelCurve
```
```cpp
public ref class ModelLine : public ModelCurve
```
```fsharp
type ModelLine =
    class
        inherit ModelCurve
    end
```

The ModelLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Geometry-related functionality is provided by the geometry curve object from the ModelCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace