Revit 2026 API

# NestedFamilyTypeReference Properties

---

The NestedFamilyTypeReference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | Category Id of the referenced family |
|  | FamilyName | Name of the referenced family |
|  | TypeName | Type of the referenced family |

#### Reference

NestedFamilyTypeReference Class

Autodesk.Revit.DB Namespace