Revit 2026 API

# TriangulationInterface Class

---

This abstract class provides an interface for querying a triangulation structure (vertices and triangles).

SystemObject Autodesk.Revit.DBTriangulationInterface Autodesk.Revit.DBTriangulationInterfaceForTriangulatedShellComponent Autodesk.Revit.DBTriangulationInterfaceForTriangulatedSolidOrShell

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TriangulationInterface : IDisposable
```
```vb
Public Class TriangulationInterface
	Implements IDisposable
```
```cpp
public ref class TriangulationInterface : IDisposable
```
```fsharp
type TriangulationInterface =
    class
        interface IDisposable
    end
```

The TriangulationInterface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TriangulationInterface |

#### Reference

Autodesk.Revit.DB Namespace