Revit 2026 API

# DefinitionBindingMap Class

---

A map that contains mappings of parameter definitions to parameter bindings.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDefinitionBindingMap Autodesk.Revit.DBBindingMap

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DefinitionBindingMap : APIObject,
	IEnumerable
```
```vb
Public Class DefinitionBindingMap
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class DefinitionBindingMap : public APIObject,
	IEnumerable
```
```fsharp
type DefinitionBindingMap =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The DefinitionBindingMap type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefinitionBindingMap | Initializes a new instance of the DefinitionBindingMap class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the map is empty. |
|  | Item |  |
|  | Size | Returns the number of bindings that are in the map. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every binding from the map, rendering it empty. |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator | Retrieve a forward moving iterator to the map. |
|  | GetEnumerator | Retrieve a forward moving iterator to the map. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the map. |

#### Reference

Autodesk.Revit.DB Namespace