Revit 2026 API

# SplitButton Class

---

The SplitButton object represents a button with a clickable button appearing above a pulldown.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRibbonButton Autodesk.Revit.UIPulldownButton Autodesk.Revit.UISplitButton

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SplitButton : PulldownButton
```
```vb
Public Class SplitButton
	Inherits PulldownButton
```
```cpp
public ref class SplitButton : public PulldownButton
```
```fsharp
type SplitButton =
    class
        inherit PulldownButton
    end
```

The SplitButton type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentButton | Gets or sets the current PushButton of the SplitButton. |
|  | IsSynchronizedWithCurrentItem | Indicates whether the top PushButton on the SplitButton changes based on the CurrentButton property. |

|  | Name | Description |
| --- | --- | --- |

Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace