Revit 2026 API

# ExportPatternInfo Methods

---

The ExportPatternInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportPatternInfo Class

Autodesk.Revit.DB Namespace