Revit 2026 API

# FilterNumericLessOrEqual Class

---

Tests whether numeric values from the document are less than or equal to a certain value

SystemObject Autodesk.Revit.DBFilterNumericRuleEvaluator Autodesk.Revit.DBFilterNumericLessOrEqual

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericLessOrEqual : FilterNumericRuleEvaluator
```
```vb
Public Class FilterNumericLessOrEqual
	Inherits FilterNumericRuleEvaluator
```
```cpp
public ref class FilterNumericLessOrEqual : public FilterNumericRuleEvaluator
```
```fsharp
type FilterNumericLessOrEqual =
    class
        inherit FilterNumericRuleEvaluator
    end
```

The FilterNumericLessOrEqual type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericLessOrEqual | Constructs an instance of FilterNumericLessOrEqual. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace