Revit 2026 API

# OperationCanceledException Methods

---

The OperationCanceledException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

OperationCanceledException Class

Autodesk.Revit.Exceptions Namespace