Revit 2026 API

# AssemblyDifferenceNamingCategory Properties

---

The AssemblyDifferenceNamingCategory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NamingCategoryId1 | Naming category id of the first assembly |
|  | NamingCategoryId2 | Naming category id of the second assembly |

#### Reference

AssemblyDifferenceNamingCategory Class

Autodesk.Revit.DB Namespace