Revit 2026 API

# RebarSpliceOptions Methods

---

The RebarSpliceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RebarSpliceOptions Class

Autodesk.Revit.DB.Structure Namespace