Revit 2026 API

# MEPAnalyticalConnectionType Methods

---

The MEPAnalyticalConnectionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an analytical connection type element. |
|  | FindTypeByName | Finds the analytical connection type by its name. |
|  | IsNameUnused | Checks if this is an unused name. |

#### Reference

MEPAnalyticalConnectionType Class

Autodesk.Revit.DB Namespace