Revit 2026 API

# LightFamily Class

---

This class encapsulates light family information.

SystemObject Autodesk.Revit.DB.LightingLightFamily

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightFamily : IDisposable
```
```vb
Public Class LightFamily
	Implements IDisposable
```
```cpp
public ref class LightFamily : IDisposable
```
```fsharp
type LightFamily =
    class
        interface IDisposable
    end
```

The LightFamily type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LightFamily |
|  | GetLightDistributionStyle | Returns a LightDistributionStyle value for the light distribution |
|  | GetLightFamily | Creates a light family object from the given family document |
|  | GetLightShapeStyle | Returns a LightShapeStyle value for the light shape |
|  | GetLightSourceTransform | Returns a Transform value for the transform of light source. |
|  | GetLightType | Return a LightType object for the light type at the given index |
|  | GetLightTypeName | Return the name for the light type at the given index |
|  | GetNumberOfLightTypes | Return the number of light types contained in this light family |
|  | SetLightDistributionStyle | Set the light distribution style to the given shape distribution |
|  | SetLightShapeStyle | Set the light shape style to the given shape style |

#### Reference

Autodesk.Revit.DB.Lighting Namespace