Revit 2026 API

# ImageBackgroundSettings Class

---

Represents the rendering image background settings.

SystemObject Autodesk.Revit.DBBackgroundSettings Autodesk.Revit.DBImageBackgroundSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ImageBackgroundSettings : BackgroundSettings
```
```vb
Public Class ImageBackgroundSettings
	Inherits BackgroundSettings
```
```cpp
public ref class ImageBackgroundSettings : public BackgroundSettings
```
```fsharp
type ImageBackgroundSettings =
    class
        inherit BackgroundSettings
    end
```

The ImageBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundImageFit | The background image fit type. |
|  | FilePath | File path of the image for the rendering background. |
|  | OffsetHeight | The vertical offset of the rendering image to the rendering region. |
|  | OffsetWidth | The horizontal offset of the rendering image to the rendering region. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace