Revit 2026 API

# PreDocEventArgs Properties

---

The PreDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document associated with the event. |

#### Reference

PreDocEventArgs Class

Autodesk.Revit.DB.Events Namespace