Revit 2026 API

# PointLightShape Class

---

This class encapsulates a point light shape.

SystemObject Autodesk.Revit.DB.LightingLightShape Autodesk.Revit.DB.LightingPointLightShape

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointLightShape : LightShape
```
```vb
Public Class PointLightShape
	Inherits LightShape
```
```cpp
public ref class PointLightShape : public LightShape
```
```fsharp
type PointLightShape =
    class
        inherit LightShape
    end
```

The PointLightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PointLightShape | Creates a point light shape object. |
|  | PointLightShape(PointLightShape) | Creates a copy of the given point light shape |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Lighting Namespace