Revit 2026 API

# GBXMLExportOptions Methods

---

The GBXMLExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

GBXMLExportOptions Class

Autodesk.Revit.DB Namespace