Revit 2026 API

# DefinitionBindingMapIterator Class

---

An iterator to a parameter definition to parameter bindings map.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDefinitionBindingMapIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class DefinitionBindingMapIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class DefinitionBindingMapIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class DefinitionBindingMapIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type DefinitionBindingMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The DefinitionBindingMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefinitionBindingMapIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the binding that is the current focus of the iterator. |
|  | Key | Retrieves the definition that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the map. |

#### Reference

Autodesk.Revit.DB Namespace