Revit 2026 API

# IFCExportOptions Methods

---

The IFCExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddOption | Adds a new named option to the options structure. |
|  | Assign | Assigns the values of the IFCExportOptions to this options object. |
|  | Dispose |  |

#### Reference

IFCExportOptions Class

Autodesk.Revit.DB Namespace