Revit 2026 API

# CurveArray Class

---

An array that can contain curves.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurveArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveArray : APIObject, IEnumerable
```
```vb
Public Class CurveArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class CurveArray : public APIObject,
	IEnumerable
```
```fsharp
type CurveArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The CurveArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveArray | Initializes a new instance of the CurveArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a curve at a specified index within the array. |
|  | Size | Returns the number of curves that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the curve to the end of the array. |
|  | Clear | Removes every curve from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified curve into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace