Revit 2026 API

# KeyBasedTreeEntries Class

---

A collection of KeyBasedTreeEntry objects that make up the key-based tree.

SystemObject Autodesk.Revit.DBKeyBasedTreeEntries Autodesk.Revit.DBClassificationEntries Autodesk.Revit.DBKeynoteEntries

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry>,
	IDisposable
```
```vb
Public Class KeyBasedTreeEntries
	Implements IEnumerable(Of KeyBasedTreeEntry), IDisposable
```
```cpp
public ref class KeyBasedTreeEntries : IEnumerable<KeyBasedTreeEntry^>,
	IDisposable
```
```fsharp
type KeyBasedTreeEntries =
    class
        interface IEnumerable<KeyBasedTreeEntry>
        interface IDisposable
    end
```

The KeyBasedTreeEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the KeyBasedTreeEntries |
|  | FindEntry | Finds the KeyBasedTreeEntry associated with the given key value. |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetKeyBasedTreeEntriesIterator | Returns a KeyBasedTreeEntriesIterator that iterates through the collection. |

#### Reference

Autodesk.Revit.DB Namespace