Revit 2026 API

# MEPAnalyticalConnection Class

---

Represents an analytical element that connects mechanical equipment to piping network.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DBMEPAnalyticalConnection

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPAnalyticalConnection : MEPCurve
```
```vb
Public Class MEPAnalyticalConnection
	Inherits MEPCurve
```
```cpp
public ref class MEPAnalyticalConnection : public MEPCurve
```
```fsharp
type MEPAnalyticalConnection =
    class
        inherit MEPCurve
    end
```

The MEPAnalyticalConnection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | CanSupportAnalyticalConnection | Checks if the connector can support the analytical connection. |
|  | Create | Creates a new analytical connection between two open connectors. |
|  | CreateMultipleConnections |  |
|  | GetFlow | Gets the flow value of this analytical connection. |

The analytical connection takes mechanical equipment into account of network flow/pressure analysis. The connection remains the same even if the mechanical equipment moves and rotates. It enables a fast establishment of piping network to analyze the flow and pressure, especially at the early stage of the design process.

#### Reference

Autodesk.Revit.DB Namespace