Revit 2026 API

# PaperSourceSetIterator Methods

---

The PaperSourceSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

PaperSourceSetIterator Class

Autodesk.Revit.DB Namespace