Revit 2026 API

# CurveByPointsArrayIterator Properties

---

The CurveByPointsArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CurveByPointsArrayIterator Class

Autodesk.Revit.DB Namespace