Revit 2026 API

# ButtonData Class

---

Base class used to contain information necessary to construct a button in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIPulldownButtonData Autodesk.Revit.UIPushButtonData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ButtonData : RibbonItemData
```
```vb
Public Class ButtonData
	Inherits RibbonItemData
```
```cpp
public ref class ButtonData : public RibbonItemData
```
```fsharp
type ButtonData =
    class
        inherit RibbonItemData
    end
```

The ButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image of the button. |
|  | LargeImage | The large image of the button. |
|  | Text | The user-visible text of the button. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace