Revit 2026 API

# FaceSilhouetteNode Methods

---

The FaceSilhouetteNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFace | Returns the Face object corresponding to the node. |

#### Reference

FaceSilhouetteNode Class

Autodesk.Revit.DB Namespace