Revit 2026 API

# PointRelativeToPoint Methods

---

The PointRelativeToPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetHostPointReference | Get a copy of the host point reference. |
|  | SetHostPointReference | Change the host point reference. |

#### Reference

PointRelativeToPoint Class

Autodesk.Revit.DB Namespace