Revit 2026 API

# DocumentReloadedLatestEventArgs Properties

---

The DocumentReloadedLatestEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Location | Full path of the central model which is to be operated. |

#### Reference

DocumentReloadedLatestEventArgs Class

Autodesk.Revit.DB.Events Namespace