Revit 2026 API

# WireSizeSet Class

---

A set that contains wire sizes.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireSizeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WireSizeSet : APIObject,
	IEnumerable
```
```vb
Public Class WireSizeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class WireSizeSet : public APIObject,
	IEnumerable
```
```fsharp
type WireSizeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The WireSizeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireSizeSet | Initializes a new instance of the WireSizeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of wire sizes that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every wire size from the set, rendering it empty. |
|  | Contains | Tests for the existence of a wire size within the set. |
|  | Erase | Removes a specified wire size from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified wire size into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace