Revit 2026 API

# DuctLining Class

---

Represents Lining applied to the inside of a given duct, fitting or accessory.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DBInsulationLiningBase Autodesk.Revit.DB.MechanicalDuctLining

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctLining : InsulationLiningBase
```
```vb
Public Class DuctLining
	Inherits InsulationLiningBase
```
```cpp
public ref class DuctLining : public InsulationLiningBase
```
```fsharp
type DuctLining =
    class
        inherit InsulationLiningBase
    end
```

The DuctLining type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of duct lining. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace