Revit 2026 API

# HermiteSurface Class

---

A Hermite Surface.

SystemObject Autodesk.Revit.DBSurface Autodesk.Revit.DBHermiteSurface

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HermiteSurface : Surface
```
```vb
Public Class HermiteSurface
	Inherits Surface
```
```cpp
public ref class HermiteSurface : public Surface
```
```fsharp
type HermiteSurface =
    class
        inherit Surface
    end
```

The HermiteSurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Int32, Int32, IListXYZ) |  |
|  | Create(Int32, Int32, IListXYZ, Boolean, Boolean) |  |
|  | IsValid | Checks whether this HermiteSurface object is valid. |

#### Reference

Autodesk.Revit.DB Namespace