Revit 2026 API

# DoubleParameterValue Class

---

A class that holds a Double value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBDoubleParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DoubleParameterValue : ParameterValue
```
```vb
Public Class DoubleParameterValue
	Inherits ParameterValue
```
```cpp
public ref class DoubleParameterValue : public ParameterValue
```
```fsharp
type DoubleParameterValue =
    class
        inherit ParameterValue
    end
```

The DoubleParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DoubleParameterValue | Default constructor |
|  | DoubleParameterValue(Double) | Value constructor |

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace