Revit 2026 API

# IFCPropertySetMappingInfo Methods

---

The IFCPropertySetMappingInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCPropertySetMappingInfo Class

Autodesk.Revit.DB Namespace