Revit 2026 API

# HostObject Class

---

A base class that provides support for all objects that can host other objects, such as walls roofs, and floors.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HostObject : Element
```
```vb
Public Class HostObject
	Inherits Element
```
```cpp
public ref class HostObject : public Element
```
```fsharp
type HostObject =
    class
        inherit Element
    end
```

The HostObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | FindInserts | Gets the ids of the instances inserted into this host object. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCeilingAndFloor Autodesk.Revit.DBCurtainGridLine Autodesk.Revit.DBCurtainSystemBase Autodesk.Revit.DBFaceToposolid Autodesk.Revit.DBFaceWall Autodesk.Revit.DBHostedSweep Autodesk.Revit.DBMEPCurve Autodesk.Revit.DBRoofBase Autodesk.Revit.DBWall Autodesk.Revit.DBWallFoundation Autodesk.Revit.DBWallSweep