Revit 2026 API

# ModelCurveArrArrayIterator Properties

---

The ModelCurveArrArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ModelCurveArrArrayIterator Class

Autodesk.Revit.DB Namespace