Revit 2026 API

# CombinableElementArrayIterator Methods

---

The CombinableElementArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

CombinableElementArrayIterator Class

Autodesk.Revit.DB Namespace