Revit 2026 API

# AssetPropertyEnum Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyEnum

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyEnum : AssetProperty
```
```vb
Public Class AssetPropertyEnum
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyEnum : public AssetProperty
```
```fsharp
type AssetPropertyEnum =
    class
        inherit AssetProperty
    end
```

The AssetPropertyEnum type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

Autodesk.Revit.DB.Visual Namespace