Revit 2026 API

# CancellationListener Methods

---

The CancellationListener type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsCancelled | Returns true if the operation associated with this instance has been cancelled. |

#### Reference

CancellationListener Class

Autodesk.Revit.DB Namespace