Revit 2026 API

# AnalysisDisplayVectorSettings Methods

---

The AnalysisDisplayVectorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two vector settings objects. |

#### Reference

AnalysisDisplayVectorSettings Class

Autodesk.Revit.DB.Analysis Namespace