Revit 2026 API

# WireSetIterator Class

---

An iterator to a set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class WireSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class WireSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class WireSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type WireSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The WireSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace