Revit 2026 API

# SpatialElementGeometryResults Methods

---

The SpatialElementGeometryResults type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBoundaryFaceInfo | Query the spatial element boundary face information with the given face. |
|  | GetGeometry | The solid from the spatial element. |

#### Reference

SpatialElementGeometryResults Class

Autodesk.Revit.DB Namespace