Revit 2026 API

# TemperatureRatingTypeSet Class

---

A set that contains TemperatureRating types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalTemperatureRatingTypeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TemperatureRatingTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class TemperatureRatingTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class TemperatureRatingTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type TemperatureRatingTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The TemperatureRatingTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TemperatureRatingTypeSet | Initializes a new instance of the TemperatureRatingTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of TemperatureRating types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every TemperatureRating type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a TemperatureRating type within the set. |
|  | Erase | Removes a specified TemperatureRating type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified TemperatureRating type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace