Revit 2026 API

# Level Class

---

Represents a Level within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDatumPlane Autodesk.Revit.DBLevel

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Level : DatumPlane
```
```vb
Public Class Level
	Inherits DatumPlane
```
```cpp
public ref class Level : public DatumPlane
```
```fsharp
type Level =
    class
        inherit DatumPlane
    end
```

The Level type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Elevation | Retrieves or changes the elevation above or below the ground level. |
|  | ProjectElevation | Retrieves the elevation relative to project origin, no matter what values of the Elevation Base parameter is set. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of level based on an input elevation. |
|  | FindAssociatedPlanViewId | Finds the id of the first available associated floor or structural plan view associated with this level. |
|  | GetNearestLevelId(Document, Double) | Returns id of the Level which is closest to the specified elevation. |
|  | GetNearestLevelId(Document, Double, Double) | Returns id of the Level which is closest to the specified elevation. |
|  | GetPlaneReference | Returns a reference to this element as a plane. |

A Level is conceptually a horizontal rectangle of finite extents. It appears as a straight line in views that intersect the rectangle. The straight line represents the projection of the rectangle onto the view. The Name property can be used to retrieve the user visible name of the level that appears in the level bubble.

#### Reference

Autodesk.Revit.DB Namespace