Revit 2026 API

# LayoutRuleFixedNumber Properties

---

The LayoutRuleFixedNumber type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumberOfLines | Get or set the number of the beams in a beam system. |

#### Reference

LayoutRuleFixedNumber Class

Autodesk.Revit.DB Namespace