Revit 2026 API

# AssetPropertyInteger Properties

---

The AssetPropertyInteger type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

#### Reference

AssetPropertyInteger Class

Autodesk.Revit.DB.Visual Namespace