Revit 2026 API

# SpaceSetIterator Class

---

An iterator to a set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.MechanicalSpaceSetIterator

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class SpaceSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class SpaceSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class SpaceSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type SpaceSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The SpaceSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SpaceSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace