Revit 2026 API

# VertexStreamPositionColored Class

---

A stream that can be used to write vertices of type VertexPositionColored into a buffer (see VertexBuffer).

SystemObject Autodesk.Revit.DB.DirectContext3DVertexStream Autodesk.Revit.DB.DirectContext3DVertexStreamPositionColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexStreamPositionColored : VertexStream
```
```vb
Public Class VertexStreamPositionColored
	Inherits VertexStream
```
```cpp
public ref class VertexStreamPositionColored : public VertexStream
```
```fsharp
type VertexStreamPositionColored =
    class
        inherit VertexStream
    end
```

The VertexStreamPositionColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionColored into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace