Revit 2026 API

# Grid Properties

---

The Grid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curve | Retrieves an object that represents the geometry of the grid line. |
|  | IsCurved | Identifies if the grid line is curved or straight. |

#### Reference

Grid Class

Autodesk.Revit.DB Namespace