Revit 2026 API

# ExternallyTaggedBRep Class

---

An ExternallyTaggedSolid can hold any shape created by BRepBuilder.

SystemObject Autodesk.Revit.DBExternallyTaggedGeometryObject Autodesk.Revit.DBExternallyTaggedBRep

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternallyTaggedBRep : ExternallyTaggedGeometryObject
```
```vb
Public Class ExternallyTaggedBRep
	Inherits ExternallyTaggedGeometryObject
```
```cpp
public ref class ExternallyTaggedBRep : public ExternallyTaggedGeometryObject
```
```fsharp
type ExternallyTaggedBRep =
    class
        inherit ExternallyTaggedGeometryObject
    end
```

The ExternallyTaggedBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetTaggedGeometry | Returns the externally tagged geometry object. |

#### Reference

Autodesk.Revit.DB Namespace