Revit 2026 API

# BoundaryConditions Class

---

An object that represents a force applied across an area.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureBoundaryConditions

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundaryConditions : Element
```
```vb
Public Class BoundaryConditions
	Inherits Element
```
```cpp
public ref class BoundaryConditions : public Element
```
```fsharp
type BoundaryConditions =
    class
        inherit Element
    end
```

The BoundaryConditions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssociatedLoadId | The Id of the internal load element associated with a boundary conditions. |
|  | HostElementId | The host element Id for the boundary conditions. |
|  | Point | Returns the position of point boundary conditions. |

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundaryConditionsType | Returns the boundary conditions type. |
|  | GetCurve | Returns curve that define geometry of the line boundary conditions. |
|  | GetDegreesOfFreedomCoordinateSystem | Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation. |
|  | GetLoops | Returns curve loops that define geometry of the area boundary conditions. |
|  | GetOrientTo | Returns the boundary conditions orientation option. |
|  | SetOrientTo | Sets the boundary condition orientation option. |

#### Reference

Autodesk.Revit.DB.Structure Namespace