Revit 2026 API

# SpatialElementFromToCalculationPoints Properties

---

The SpatialElementFromToCalculationPoints type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FromPosition | The "from" position of spatial element connecting calculation point. |
|  | ToPosition | The "to" position of spatial element connecting calculation point. |

#### Reference

SpatialElementFromToCalculationPoints Class

Autodesk.Revit.DB Namespace