Revit 2026 API

# DetailCurveArrayIterator Properties

---

The DetailCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

DetailCurveArrayIterator Class

Autodesk.Revit.DB Namespace