Revit 2026 API

# CustomExporter Methods

---

The CustomExporter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Export(IListElementId) |  |
|  | Export(View) | Exports one 3D or 2D view |
|  | IsRenderingSupported | Checks if view rendering is currently supported in the running instance of Revit. |

#### Reference

CustomExporter Class

Autodesk.Revit.DB Namespace