Revit 2026 API

# OptionalFunctionalityNotAvailableException Methods

---

The OptionalFunctionalityNotAvailableException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

OptionalFunctionalityNotAvailableException Class

Autodesk.Revit.Exceptions Namespace