Revit 2026 API

# UISaveAsOptions Methods

---

The UISaveAsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

UISaveAsOptions Class

Autodesk.Revit.UI Namespace