Revit 2026 API

# FamilySizeTableErrorInfo Class

---

Error information generated from the CSV file import of a FamilySizeTable.

SystemObject Autodesk.Revit.DBFamilySizeTableErrorInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySizeTableErrorInfo : IDisposable
```
```vb
Public Class FamilySizeTableErrorInfo
	Implements IDisposable
```
```cpp
public ref class FamilySizeTableErrorInfo : IDisposable
```
```fsharp
type FamilySizeTableErrorInfo =
    class
        interface IDisposable
    end
```

The FamilySizeTableErrorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilySizeTableErrorInfo | Constructs a new FamilySizeTableErrorInfo with default settings. |

|  | Name | Description |
| --- | --- | --- |
|  | FamilySizeTableErrorType | The error type. |
|  | FilePath | The path of the imported CSV file. |
|  | InvalidColumnIndex | The index of the invalid column. |
|  | InvalidHeaderText | The invalid header text. |
|  | InvalidRowIndex | The index of the invalid row. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FamilySizeTableErrorInfo |

#### Reference

Autodesk.Revit.DB Namespace