Revit 2026 API

# TabbedDialogExtension Methods

---

The TabbedDialogExtension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetContextualHelp | Gets the contextual help. |
|  | SetContextualHelp | Sets the contextual help. |

#### Reference

TabbedDialogExtension Class

Autodesk.Revit.UI Namespace