Revit 2026 API

# Asset Class

---

Represents a connected property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetProperties Autodesk.Revit.DB.VisualAsset

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Asset : AssetProperties
```
```vb
Public Class Asset
	Inherits AssetProperties
```
```cpp
public ref class Asset : public AssetProperties
```
```fsharp
type Asset =
    class
        inherit AssetProperties
    end
```

The Asset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetType | The type of RenderingAsset |
|  | LibraryName | Library name |
|  | Title | Asset title |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Visual Namespace