Revit 2026 API

# ClipPlane Methods

---

The ClipPlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ClipPlane Class

Autodesk.Revit.DB.DirectContext3D Namespace