Revit 2026 API

# LinkedResourceOpenedEventArgs Properties

---

The LinkedResourceOpenedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LinkedResourcePathName | Path of the linked resource. |
|  | ResourceType | The desired linked resource type. |
|  | ResourceTypeId | Element id of the linked resource. |

#### Reference

LinkedResourceOpenedEventArgs Class

Autodesk.Revit.DB.Events Namespace