Revit 2026 API

# DocumentChangedEventArgs Properties

---

The DocumentChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Operation | The operation associated with this event |

#### Reference

DocumentChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace