Revit 2026 API

# SheetCollection Methods

---

The SheetCollection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document) | Creates a new instance of sheet collection with an auto-generated name and adds it to the document. |
|  | Create(Document, String) | Creates a new instance of sheet collection with a specified name and adds it to the document. |

#### Reference

SheetCollection Class

Autodesk.Revit.DB Namespace