Revit 2026 API

# LayoutRuleFixedNumber Class

---

This class indicate the layout rule of a Beam System is Fixed-Number.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleFixedNumber

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LayoutRuleFixedNumber : LayoutRule
```
```vb
Public Class LayoutRuleFixedNumber
	Inherits LayoutRule
```
```cpp
public ref class LayoutRuleFixedNumber : public LayoutRule
```
```fsharp
type LayoutRuleFixedNumber =
    class
        inherit LayoutRule
    end
```

The LayoutRuleFixedNumber type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LayoutRuleFixedNumber | Constructor of LayoutRuleFixedNumber. |

|  | Name | Description |
| --- | --- | --- |
|  | NumberOfLines | Get or set the number of the beams in a beam system. |

|  | Name | Description |
| --- | --- | --- |

To use this type of LayoutRule, only the number of the beams must be set.

#### Reference

Autodesk.Revit.DB Namespace