Revit 2026 API

# PipeSegment Properties

---

The PipeSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleTypeId | The ElementId of the PipeScheduleType. |

#### Reference

PipeSegment Class

Autodesk.Revit.DB.Plumbing Namespace