Revit 2026 API

# DimensionSegmentArrayIterator Properties

---

The DimensionSegmentArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

DimensionSegmentArrayIterator Class

Autodesk.Revit.DB Namespace