Revit 2026 API

# TaskDialogShowingEventArgs Properties

---

The TaskDialogShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Message | The message that has been displayed in the dialog box. |

#### Reference

TaskDialogShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace