Revit 2026 API

# ParameterValuePresenceRule Properties

---

The ParameterValuePresenceRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Parameter | The parameter which will be evaluated to pass this rule. |

#### Reference

ParameterValuePresenceRule Class

Autodesk.Revit.DB Namespace