Revit 2026 API

# LightingFixture Class

---

Provides access to the Lighting Fixture in Autodesk Revit MEP.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel Autodesk.Revit.DB.ElectricalLightingFixture

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightingFixture : MEPModel
```
```vb
Public Class LightingFixture
	Inherits MEPModel
```
```cpp
public ref class LightingFixture : public MEPModel
```
```fsharp
type LightingFixture =
    class
        inherit MEPModel
    end
```

The LightingFixture type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The Lighting Fixture object can only be queried in Autodesk Revit MEP.

#### Reference

Autodesk.Revit.DB.Electrical Namespace