Revit 2026 API

# ExportLineweightKey Class

---

A key used to represent an item stored in an ExportLineweightTable.

SystemObject Autodesk.Revit.DBExportLineweightKey

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportLineweightKey : IDisposable
```
```vb
Public Class ExportLineweightKey
	Implements IDisposable
```
```cpp
public ref class ExportLineweightKey : IDisposable
```
```fsharp
type ExportLineweightKey =
    class
        interface IDisposable
    end
```

The ExportLineweightKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportLineweightKey | Constructs a new default ExportLineweightKey. |
|  | ExportLineweightKey(ExportLineweightKey) | Constructs a new copy of the input ExportLineweightKey object. |
|  | ExportLineweightKey(Int32) | Constructs a new default ExportLineweightKey using the original line weight as input. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalLineweight | The original line weight. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportLineweightKey |

#### Reference

Autodesk.Revit.DB Namespace