Revit 2026 API

# CategorySetIterator Properties

---

The CategorySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CategorySetIterator Class

Autodesk.Revit.DB Namespace