Revit 2026 API

# Instance Methods

---

The Instance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetTotalTransform | Gets the total transform, which includes the true north transform for instances like import instances. |
|  | GetTransform | Gets the transform of the instance. |

#### Reference

Instance Class

Autodesk.Revit.DB Namespace