Revit 2026 API

# SSEPointVisibilitySettings Class

---

Represents the settings contained in the document associated to the point display of Floor, Roof and Toposolid. for serialization public api methods

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSSEPointVisibilitySettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SSEPointVisibilitySettings : Element
```
```vb
Public Class SSEPointVisibilitySettings
	Inherits Element
```
```cpp
public ref class SSEPointVisibilitySettings : public Element
```
```fsharp
type SSEPointVisibilitySettings =
    class
        inherit Element
    end
```

The SSEPointVisibilitySettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the SSE point visibility for the given category. |
|  | SetVisibility | Sets the SSE point visibility for the given category. |

#### Reference

Autodesk.Revit.DB Namespace