Revit 2026 API

# SystemsAnalysisOptions Methods

---

The SystemsAnalysisOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SystemsAnalysisOptions Class

Autodesk.Revit.DB.Analysis Namespace