Revit 2026 API

# ExclusionFilter Methods

---

The ExclusionFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetIdsToExclude | Returns the ids to be excluded by this filter. |

#### Reference

ExclusionFilter Class

Autodesk.Revit.DB Namespace