Revit 2026 API

# AnalyticalDistributionNodePropertyData Methods

---

The AnalyticalDistributionNodePropertyData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

AnalyticalDistributionNodePropertyData Class

Autodesk.Revit.DB.Electrical Namespace