Revit 2026 API

# GroupType Class

---

An element representing a group of elements that may be placed many times in a project or family.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBGroupType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GroupType : ElementType
```
```vb
Public Class GroupType
	Inherits ElementType
```
```cpp
public ref class GroupType : public ElementType
```
```fsharp
type GroupType =
    class
        inherit ElementType
    end
```

The GroupType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Groups | Retrieve a set of all the groups that have this type. |

|  | Name | Description |
| --- | --- | --- |
|  | GetAvailableAttachedDetailGroupTypeIds | Returns the attached detail groups available for this element group type. |
|  | LoadFrom | Replaces the group with the contents of the input file. |

Grouping elements is useful when you need to create entities that represent repeating layouts or are common to many building projects, such as hotel rooms, apartments, or repeating floors.

#### Reference

Autodesk.Revit.DB Namespace