Revit 2026 API

# FilterGlobalParameterAssociationRule Properties

---

The FilterGlobalParameterAssociationRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RuleValue | The user-supplied global parameter value against which values from a Revit document will be tested. |

#### Reference

FilterGlobalParameterAssociationRule Class

Autodesk.Revit.DB Namespace