Revit 2026 API

# NumericRevisionSettings Methods

---

The NumericRevisionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Determines whether a specified NumericRevisionSettings is the same as 'this'. |
|  | IsValid | Determines whether the NumericRevisionSettings object is in a valid state. |

#### Reference

NumericRevisionSettings Class

Autodesk.Revit.DB Namespace