Revit 2026 API

# PipePlumbingFixtureFlowData Methods

---

The PipePlumbingFixtureFlowData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

PipePlumbingFixtureFlowData Class

Autodesk.Revit.DB.Plumbing Namespace