Revit 2026 API

# IIFCEntityTreeUIServer Methods

---

The IIFCEntityTreeUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShowDialog | Shows dialog on managing IFCEntityTreeUI. |

#### Reference

IIFCEntityTreeUIServer Interface

Autodesk.Revit.UI Namespace