Revit 2026 API

# PaperSource Properties

---

The PaperSource type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | Retrieve the paper source name of current project. |

#### Reference

PaperSource Class

Autodesk.Revit.DB Namespace