Revit 2026 API

# AreaLoad Class

---

An object that represents a force applied across an area.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureLoadBase Autodesk.Revit.DB.StructureAreaLoad

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaLoad : LoadBase
```
```vb
Public Class AreaLoad
	Inherits LoadBase
```
```cpp
public ref class AreaLoad : public LoadBase
```
```fsharp
type AreaLoad =
    class
        inherit LoadBase
    end
```

The AreaLoad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | Returns area of the area load. |
|  | ForceVector1 | The force vector applied to the 1st reference point of the area load, oriented according to OrientTo setting. |
|  | ForceVector2 | The force vector applied to the 2nd reference point of the area load, oriented according to OrientTo setting. |
|  | ForceVector3 | The force vector applied to the 3rd reference point of the area load, oriented according to OrientTo setting. |
|  | IsProjected | Indicates if the load is projected. |
|  | NumRefPoints | Returns the total number of reference points for the area load. |

|  | Name | Description |
| --- | --- | --- |
|  | AreCurveLoopsValid |  |
|  | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
|  | Create(Document, ElementId, IListCurveLoop, XYZ, AreaLoadType) |  |
|  | Create(Document, ElementId, IListCurveLoop, IListXYZ, IListInt32, IListInt32, AreaLoadType) |  |
|  | GetLoops | Returns curve loops that define geometry of the area load. |
|  | GetRefPoint | Returns the physical location of the reference point. |
|  | IsCurveLoopsInsideHostBoundaries |  |
|  | IsValidHostId | Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id |
|  | SetLoops |  |

#### Reference

Autodesk.Revit.DB.Structure Namespace