Revit 2026 API

# Zone Properties

---

The Zone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | Get the Area of the Zone. |
|  | Boundary | Returns the boundary of the Zone. |
|  | CalculatedCoolingLoad | **Obsolete.** Get the Calculated Cooling Load of the Zone. |
|  | CalculatedHeatingLoad | **Obsolete.** Get the Calculated Heating Load of the Zone. |
|  | CalculatedSupplyAirflow | **Obsolete.** Get the Calculated Supply Airflow of the Zone. |
|  | CoolingAirTemperature | **Obsolete.** Get or set the Cooling Air Temperature of the Zone. |
|  | CoolingSetPoint | **Obsolete.** Get or set the Cooling Set Point of the Zone. |
|  | DehumidificationSetPoint | **Obsolete.** Get or set the DeHumidification Set Point of the Zone. |
|  | GrossArea | **Obsolete.** Get the Gross Area of the Zone. |
|  | GrossVolume | **Obsolete.** Get the Gross Volume of the Zone. |
|  | HeatingAirTemperature | **Obsolete.** Get or set the Heating Air Temperature of the Zone. |
|  | HeatingSetPoint | **Obsolete.** Get or set the Heating Set Point of the Zone. |
|  | HumidificationSetPoint | **Obsolete.** Get or set the Humidification Set Point of the Zone. |
|  | IsDefaultZone | **Obsolete.** Reports whether this zone is default or not. |
|  | Name | Get or Set the Name of the Zone.(Overrides ElementName) |
|  | Perimeter | **Obsolete.** Get the Perimeter of the Zone. |
|  | Phase | Get the Phase of the Zone. |
|  | ServiceType | **Obsolete.** Get or set the Service Type of the Zone. |
|  | Spaces | Get the Spaces of the Zone. |
|  | Volume | **Obsolete.** Get the Volume of the Zone. |

#### Reference

Zone Class

Autodesk.Revit.DB.Mechanical Namespace