Revit 2026 API

# ValueParsingOptions Class

---

Options for parsing strings into numbers with units.

SystemObject Autodesk.Revit.DBValueParsingOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ValueParsingOptions : IDisposable
```
```vb
Public Class ValueParsingOptions
	Implements IDisposable
```
```cpp
public ref class ValueParsingOptions : IDisposable
```
```fsharp
type ValueParsingOptions =
    class
        interface IDisposable
    end
```

The ValueParsingOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ValueParsingOptions | Creates a new ValueParsingOptions object with default settings. |

|  | Name | Description |
| --- | --- | --- |
|  | AllowedValues | The allowable range of values to be parsed. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ValueParsingOptions |
|  | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
|  | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |

#### Reference

Autodesk.Revit.DB Namespace