Revit 2026 API

# FaceDetailNode Properties

---

The FaceDetailNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LineProperties | Access to the line (pen) properties of the curve being drawn. |

#### Reference

FaceDetailNode Class

Autodesk.Revit.DB Namespace