Revit 2026 API

# DetailLine Class

---

Represents a DetailLine within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBDetailCurve Autodesk.Revit.DBDetailLine

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DetailLine : DetailCurve
```
```vb
Public Class DetailLine
	Inherits DetailCurve
```
```cpp
public ref class DetailLine : public DetailCurve
```
```fsharp
type DetailLine =
    class
        inherit DetailCurve
    end
```

The DetailLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace