Revit 2026 API

# VertexStreamPosition Methods

---

The VertexStreamPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPosition into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

VertexStreamPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace