Revit 2026 API

# ReferenceArrayArrayIterator Properties

---

The ReferenceArrayArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ReferenceArrayArrayIterator Class

Autodesk.Revit.DB Namespace