Revit 2026 API

# KeynoteEntry Properties

---

The KeynoteEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | KeynoteText | The text associated with this KeynoteEntry. |

#### Reference

KeynoteEntry Class

Autodesk.Revit.DB Namespace