Revit 2026 API

# MechanicalEquipmentSetType Methods

---

The MechanicalEquipmentSetType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new type of a mechanical equipment set and adds it to the document. |

#### Reference

MechanicalEquipmentSetType Class

Autodesk.Revit.DB.Mechanical Namespace