Revit 2026 API

# PreviewControl Properties

---

The PreviewControl type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScrollbarVisibility | The visibility of the preview view scrollbars. |
|  | UIView | The UI view representing the preview view. |
|  | ViewId | The view Id. |

#### Reference

PreviewControl Class

Autodesk.Revit.UI Namespace