Revit 2026 API

# RevitServerUnauthenticatedUserException Methods

---

The RevitServerUnauthenticatedUserException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerUnauthenticatedUserException Class

Autodesk.Revit.Exceptions Namespace