Revit 2026 API

# ExportIFCCategoryInfo Methods

---

The ExportIFCCategoryInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsDefault | Determines if a ExportIFCCategoryInfo contains default information. |

#### Reference

ExportIFCCategoryInfo Class

Autodesk.Revit.DB Namespace