Revit 2026 API

# FamilyPointLocation Methods

---

The FamilyPointLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetLocation | Gets the location of the point. |

#### Reference

FamilyPointLocation Class

Autodesk.Revit.DB Namespace