Revit 2026 API

# IIFCImporterServer Methods

---

The IIFCImporterServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ImportIFC | The method that Revit will invoke to perform an import from IFC. |

#### Reference

IIFCImporterServer Interface

Autodesk.Revit.DB.IFC Namespace