Revit 2026 API

# CentralModelAccessDeniedException Methods

---

The CentralModelAccessDeniedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CentralModelAccessDeniedException Class

Autodesk.Revit.Exceptions Namespace