Revit 2026 API

# InsulationTypeSetIterator Methods

---

The InsulationTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

InsulationTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace