Revit 2026 API

# IFCOpeningData Class

---

A class that contains opening data including extrusion data, opening solids and opening element id.

SystemObject Autodesk.Revit.DB.IFCIFCOpeningData

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCOpeningData : IDisposable
```
```vb
Public Class IFCOpeningData
	Implements IDisposable
```
```cpp
public ref class IFCOpeningData : IDisposable
```
```fsharp
type IFCOpeningData =
    class
        interface IDisposable
    end
```

The IFCOpeningData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsRecess | Trus if it is a recess, false if it is an opening. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OpeningElementId | The opening element id. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCOpeningData |
|  | GetExtrusionData | Gets extrusion data. |
|  | GetOpeningSolids | Gets opening solids. |

#### Reference

Autodesk.Revit.DB.IFC Namespace