Revit 2026 API

# ModelCurveArrArrayIterator Methods

---

The ModelCurveArrArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ModelCurveArrArrayIterator Class

Autodesk.Revit.DB Namespace