Revit 2026 API

# InapplicableDataException Methods

---

The InapplicableDataException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InapplicableDataException Class

Autodesk.Revit.Exceptions Namespace