Revit 2026 API

# Line Properties

---

The Line type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Direction | Returns the direction of the line. |
|  | Origin | Returns the origin of the line. |

#### Reference

Line Class

Autodesk.Revit.DB Namespace