Revit 2026 API

# Plane Properties

---

The Plane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Normal | Plane normal. |
|  | Origin | Plane origin. |
|  | XVec | Axis defining the first parametric direction of the plane. |
|  | YVec | Axis defining the second parametric direction of the plane. |

#### Reference

Plane Class

Autodesk.Revit.DB Namespace