Revit 2026 API

# ExternalGeometryId Class

---

This class represents an identifier for geometry from external sources.

SystemObject Autodesk.Revit.DBExternalGeometryId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalGeometryId : IDisposable
```
```vb
Public Class ExternalGeometryId
	Implements IDisposable
```
```cpp
public ref class ExternalGeometryId : IDisposable
```
```fsharp
type ExternalGeometryId =
    class
        interface IDisposable
    end
```

The ExternalGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalGeometryId | Constructs an ExternalGeometryId object holding the given external geometry identifier. |

|  | Name | Description |
| --- | --- | --- |
|  | Id | External geometry identifier. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalGeometryId |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the hash code. (Overrides ObjectGetHashCode) |
|  | IsValidExternalGeometryId | Checks whether a given string represents a valid ExternalGeometryId or not. |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(ExternalGeometryId, ExternalGeometryId) | Determines whether two ExternalGeometryIds are the same. |
|  | Inequality(ExternalGeometryId, ExternalGeometryId) | Determines whether two ExternalGeometryIds are different. |

#### Reference

Autodesk.Revit.DB Namespace