Revit 2026 API

# ElementIsElementTypeFilter Class

---

A filter used to match elements which are ElementTypes.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementIsElementTypeFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementIsElementTypeFilter : ElementQuickFilter
```
```vb
Public Class ElementIsElementTypeFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementIsElementTypeFilter : public ElementQuickFilter
```
```fsharp
type ElementIsElementTypeFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementIsElementTypeFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementIsElementTypeFilter | Constructs a new instance of a filter to match only ElementTypes. |
|  | ElementIsElementTypeFilter(Boolean) | Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace