Revit 2026 API

# DWGExportOptions Methods

---

The DWGExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetPredefinedOptions | Returns an instance DWGExportOptions containing settings from a predefined export setup. |

#### Reference

DWGExportOptions Class

Autodesk.Revit.DB Namespace