Revit 2026 API

# RoutingCriterionBase Methods

---

The RoutingCriterionBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Verify if two criteria are the same. |

#### Reference

RoutingCriterionBase Class

Autodesk.Revit.DB Namespace