Revit 2026 API

# ConnectionValidationWarning Class

---

Contains information about a specific connection validation problem.

SystemObject Autodesk.Revit.DBConnectionValidationWarning

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConnectionValidationWarning : IDisposable
```
```vb
Public Class ConnectionValidationWarning
	Implements IDisposable
```
```cpp
public ref class ConnectionValidationWarning : IDisposable
```
```fsharp
type ConnectionValidationWarning =
    class
        interface IDisposable
    end
```

The ConnectionValidationWarning type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionValidationWarning | Constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Reason | Enumeration for reason of warning. |
|  | Resolution | Enumeration for resolution that was applied. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConnectionValidationWarning |
|  | GetParts | Get ElementIds of affected parts. |

#### Reference

Autodesk.Revit.DB Namespace