Revit 2026 API

# CheckoutElementsRequestTooLargeException Class

---

Exception is thrown when too many elements are requested for checkout

SystemObject SystemException Autodesk.Revit.ExceptionsApplicationException Autodesk.Revit.ExceptionsCentralModelException Autodesk.Revit.ExceptionsCheckoutElementsRequestTooLargeException

**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[SerializableAttribute]
public class CheckoutElementsRequestTooLargeException : CentralModelException
```
```vb
<SerializableAttribute>
Public Class CheckoutElementsRequestTooLargeException
	Inherits CentralModelException
```
```cpp
[SerializableAttribute]
public ref class CheckoutElementsRequestTooLargeException : public CentralModelException
```
```fsharp
[<SerializableAttribute>]
type CheckoutElementsRequestTooLargeException =
    class
        inherit CentralModelException
    end
```

The CheckoutElementsRequestTooLargeException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

Autodesk.Revit.Exceptions Namespace