Revit 2026 API

# CentralModelAlreadyExistsException Methods

---

The CentralModelAlreadyExistsException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CentralModelAlreadyExistsException Class

Autodesk.Revit.Exceptions Namespace