Revit 2026 API

# GroupSetIterator Methods

---

The GroupSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

GroupSetIterator Class

Autodesk.Revit.DB Namespace