Revit 2026 API

# ModelArc Class

---

Represents a ModelArc within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve Autodesk.Revit.DBModelArc

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelArc : ModelCurve
```
```vb
Public Class ModelArc
	Inherits ModelCurve
```
```cpp
public ref class ModelArc : public ModelCurve
```
```fsharp
type ModelArc =
    class
        inherit ModelCurve
    end
```

The ModelArc type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from ModelCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace