Revit 2026 API

# RoutingCriterionBase Class

---

RoutingCriteriaBase is the base class for all routing criteria.

SystemObject Autodesk.Revit.DBRoutingCriterionBase Autodesk.Revit.DBPrimarySizeCriterion

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoutingCriterionBase : IDisposable
```
```vb
Public Class RoutingCriterionBase
	Implements IDisposable
```
```cpp
public ref class RoutingCriterionBase : IDisposable
```
```fsharp
type RoutingCriterionBase =
    class
        interface IDisposable
    end
```

The RoutingCriterionBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RoutingCriterionBase |
|  | IsEqual | Verify if two criteria are the same. |

#### Reference

Autodesk.Revit.DB Namespace