Revit 2026 API

# AngularDimension Methods

---

The AngularDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | SetAngularRadius | Set radius of an Angular Dimension arc. The new radius of the arc. |

#### Reference

AngularDimension Class

Autodesk.Revit.DB Namespace