Revit 2026 API

# InternalOrigin Class

---

A class representing the origin of internal coordinate system. Each Revit project contains one InternalOrigin.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInternalOrigin

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InternalOrigin : Element
```
```vb
Public Class InternalOrigin
	Inherits Element
```
```cpp
public ref class InternalOrigin : public Element
```
```fsharp
type InternalOrigin =
    class
        inherit Element
    end
```

The InternalOrigin type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | The position of the InternalOrigin. |
|  | SharedPosition | The position of the InternalOrigin relative to the active ProjectLocation set for the document. |

|  | Name | Description |
| --- | --- | --- |
|  | Get | Gets the internal origin for the document. |

The internal origin cannot be selected (e.g. as a reference) nor can it be modified.

#### Reference

Autodesk.Revit.DB Namespace