Revit 2026 API

# InSessionViewSheetSet Class

---

Represents the in-session ViewSheetSet.

SystemObject Autodesk.Revit.DBInSessionViewSheetSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
```
```vb
Public Class InSessionViewSheetSet
	Implements IViewSheetSet, IDisposable
```
```cpp
public ref class InSessionViewSheetSet : IViewSheetSet,
	IDisposable
```
```fsharp
type InSessionViewSheetSet =
    class
        interface IViewSheetSet
        interface IDisposable
    end
```

The InSessionViewSheetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsAutomatic | Automatic order or manual order. |
|  | OrderedViewList | Ordered views. |
|  | SheetOrganizationId | ElementId to the BrowserOrganization for sheets. |
|  | ViewOrganizationId | ElementId to the BrowserOrganization for non-sheet views. |
|  | Views | The views. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the InSessionViewSheetSet |

The in-session ViewSheetSet can't be stored in document.

#### Reference

Autodesk.Revit.DB Namespace