Revit 2026 API

# ZoneEquipment Class

---

Represents an early-stage equipment placeholder that provides heating or cooling to part of air system or water loop.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.MechanicalZoneEquipment

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ZoneEquipment : Element
```
```vb
Public Class ZoneEquipment
	Inherits Element
```
```cpp
public ref class ZoneEquipment : public Element
```
```fsharp
type ZoneEquipment =
    class
        inherit Element
    end
```

The ZoneEquipment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new zone equipment |
|  | GetAssociatedZoneEquipment(Document, ElementId) | Gets the associated zone equipment of the specified analytical space. |
|  | GetAssociatedZoneEquipment(Document, ISetElementId) |  |
|  | GetZoneEquipmentData | Gets the zone equipment data. |
|  | MoveSpaceToEquipment |  |

A zone equipment is different from physical equipment. Depending on its behavior type, it may be mapped to multiple physical equipment later.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace