Revit 2026 API

# DefaultOpenFromCloudCallback Class

---

A default callback that may be used to control Revit's behavior when opening a model.

SystemObject Autodesk.Revit.DBDefaultOpenFromCloudCallback

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
```
```vb
Public Class DefaultOpenFromCloudCallback
	Implements IOpenFromCloudCallback, IDisposable
```
```cpp
public ref class DefaultOpenFromCloudCallback : IOpenFromCloudCallback,
	IDisposable
```
```fsharp
type DefaultOpenFromCloudCallback =
    class
        interface IOpenFromCloudCallback
        interface IDisposable
    end
```

The DefaultOpenFromCloudCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefaultOpenFromCloudCallback | Create a default open callback. Open latest by default for all scenarios. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DefaultOpenFromCloudCallback |
|  | OnOpenConflict | A method called when the conflict is happen during the model opening. |

#### Reference

Autodesk.Revit.DB Namespace