Revit 2026 API

# ConicalFace Class

---

A conical face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBConicalFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConicalFace : Face
```
```vb
Public Class ConicalFace
	Inherits Face
```
```cpp
public ref class ConicalFace : public Face
```
```fsharp
type ConicalFace =
    class
        inherit Face
    end
```

The ConicalFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | HalfAngle | Half angle of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radii of the surface. |

|  | Name | Description |
| --- | --- | --- |

For details on the parameterization, refer to the documentation for ConicalSurface.

#### Reference

Autodesk.Revit.DB Namespace