Revit 2026 API

# AreaVolumeSettings Class

---

This class provides access to settings related to volume and area computations.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBAreaVolumeSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaVolumeSettings : Element
```
```vb
Public Class AreaVolumeSettings
	Inherits Element
```
```cpp
public ref class AreaVolumeSettings : public Element
```
```fsharp
type AreaVolumeSettings =
    class
        inherit Element
    end
```

The AreaVolumeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComputeVolumes | True to enable volume computation. False to disable it. |

|  | Name | Description |
| --- | --- | --- |
|  | GetAreaVolumeSettings | Get the area and volume settings of the project. |
|  | GetSpatialElementBoundaryLocation | Gets the spatial element boundary location based on spatial element type. |
|  | SetSpatialElementBoundaryLocation | Sets the spatial element boundary location of a spatial element type. |

#### Reference

Autodesk.Revit.DB Namespace