Revit 2026 API

# ViewNavigationToolSettings Class

---

Represents the settings contained in the document associated to the View Navigation tools (such as the View Cube).

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBViewNavigationToolSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewNavigationToolSettings : Element
```
```vb
Public Class ViewNavigationToolSettings
	Inherits Element
```
```cpp
public ref class ViewNavigationToolSettings : public Element
```
```fsharp
type ViewNavigationToolSettings =
    class
        inherit Element
    end
```

The ViewNavigationToolSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetHomeCamera | Gets a copy of the structure containing information about the store Home view orientation. |
|  | GetViewNavigationToolSettings | Gets the instance of the settings for the given document. |
|  | IsHomeCameraSet | Checks if the home view is set in the settings. |

#### Reference

Autodesk.Revit.DB Namespace