Revit 2026 API

# PlanarFace Properties

---

The PlanarFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FaceNormal | Normal of the planar face. |
|  | Origin | Origin of the surface. |
|  | XVector | The X-vector of the planar face. |
|  | YVector | The Y-vector of the planar face. |

#### Reference

PlanarFace Class

Autodesk.Revit.DB Namespace