Revit 2026 API

# LoadComponent Class

---

An object that represents a load combination component.

SystemObject Autodesk.Revit.DB.StructureLoadComponent

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LoadComponent : IDisposable
```
```vb
Public Class LoadComponent
	Implements IDisposable
```
```cpp
public ref class LoadComponent : IDisposable
```
```fsharp
type LoadComponent =
    class
        interface IDisposable
    end
```

The LoadComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LoadComponent | Constructs a new instance of a LoadComponent. The load case or combination id. The load case or combination factor. |

|  | Name | Description |
| --- | --- | --- |
|  | Factor | Load component factor. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LoadCaseOrCombinationId | Load case or combination id. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LoadComponent |

#### Reference

Autodesk.Revit.DB.Structure Namespace