Revit 2026 API

# MessageBoxData Properties

---

The MessageBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DialogType | An integer that describes the standard windows type of the dialog box. |
|  | Message | The message that has been displayed in the dialog box. |

#### Reference

MessageBoxData Class

Autodesk.Revit.UI.Events Namespace