Revit 2026 API

# SeparatorItem Class

---

A class representing a context menu separator.

SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UISeparatorItem

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SeparatorItem : MenuItem
```
```vb
Public Class SeparatorItem
	Inherits MenuItem
```
```cpp
public ref class SeparatorItem : public MenuItem
```
```fsharp
type SeparatorItem =
    class
        inherit MenuItem
    end
```

The SeparatorItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SeparatorItem | Default constructor. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

A separator can be added between menu items when needed.

#### Reference

Autodesk.Revit.UI Namespace