Revit 2026 API

# AssetPropertyDoubleArray2d Properties

---

The AssetPropertyDoubleArray2d type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property |

#### Reference

AssetPropertyDoubleArray2d Class

Autodesk.Revit.DB.Visual Namespace