Revit 2026 API

# MEPAnalyticalNode Methods

---

The MEPAnalyticalNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsSameNode | Verify if this node is connected to the other node and thus represents the same analytical node in the network. |

#### Reference

MEPAnalyticalNode Class

Autodesk.Revit.DB.Analysis Namespace