Revit 2026 API

# ExportLayerKey Class

---

A key used to represent an item stored in an ExportLayerTable.

SystemObject Autodesk.Revit.DBExportLayerKey

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportLayerKey : IDisposable
```
```vb
Public Class ExportLayerKey
	Implements IDisposable
```
```cpp
public ref class ExportLayerKey : IDisposable
```
```fsharp
type ExportLayerKey =
    class
        interface IDisposable
    end
```

The ExportLayerKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportLayerKey | Constructs a new ExportLayerKey with default values. |
|  | ExportLayerKey(String, String, SpecialType) | Constructs a new ExportLayerKey with categoryName, subCategoryName and a special type. |

|  | Name | Description |
| --- | --- | --- |
|  | CategoryName | The category name. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpecialType | The special type for layer key. |
|  | SubCategoryName | The subcategrory Name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportLayerKey |

#### Reference

Autodesk.Revit.DB Namespace