Revit 2026 API

# SharedParameterApplicableRule Class

---

Tests whether an element supports a shared parameter.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBSharedParameterApplicableRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SharedParameterApplicableRule : FilterRule
```
```vb
Public Class SharedParameterApplicableRule
	Inherits FilterRule
```
```cpp
public ref class SharedParameterApplicableRule : public FilterRule
```
```fsharp
type SharedParameterApplicableRule =
    class
        inherit FilterRule
    end
```

The SharedParameterApplicableRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SharedParameterApplicableRule | Constructs an instance of SharedParameterApplicableRule. |

|  | Name | Description |
| --- | --- | --- |
|  | ParameterName | The name of the parameter that an element must support to pass this rule. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace