Revit 2026 API

# FillPatternElement Class

---

An element that represents a fill pattern.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBFillPatternElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FillPatternElement : Element
```
```vb
Public Class FillPatternElement
	Inherits Element
```
```cpp
public ref class FillPatternElement : public Element
```
```fsharp
type FillPatternElement =
    class
        inherit Element
    end
```

The FillPatternElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new FillPatternElement. |
|  | GetFillPattern | Gets the FillPattern associated to this element. |
|  | GetFillPatternElementByName | Retrieves the FillPatternElement by its name. |
|  | SetFillPattern | Sets the FillPattern associated to this element. |

The FillPatternElement represents a fill pattern in a project. It enables the user to retrieve, modify or create a fill pattern in a project.

#### Reference

Autodesk.Revit.DB Namespace