Revit 2026 API

# DisplayingOptionsDialogEventArgs Properties

---

The DisplayingOptionsDialogEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PagesCount | The count of pages in the options dialog (include the default pages added by Revit). |

#### Reference

DisplayingOptionsDialogEventArgs Class

Autodesk.Revit.UI.Events Namespace