Revit 2026 API

# LeaderArray Class

---

An array that can contain any number of leaders.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLeaderArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LeaderArray : APIObject,
	IEnumerable
```
```vb
Public Class LeaderArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class LeaderArray : public APIObject,
	IEnumerable
```
```fsharp
type LeaderArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The LeaderArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LeaderArray | Initializes a new instance of the LeaderArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets an item at a specified index within the array. |
|  | Size | Returns the number of objects that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the item to the end of the array. |
|  | Clear | Removes every item from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified item into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace