Revit 2026 API

# DistributionSysTypeSetIterator Methods

---

The DistributionSysTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

DistributionSysTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace