Revit 2026 API

# AssetPropertyInt64 Class

---

Represents a property of Int64 value.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyInt64

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyInt64 : AssetProperty
```
```vb
Public Class AssetPropertyInt64
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyInt64 : public AssetProperty
```
```fsharp
type AssetPropertyInt64 =
    class
        inherit AssetProperty
    end
```

The AssetPropertyInt64 type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Visual Namespace