Revit 2026 API

# NurbSpline Class

---

A nurb spline.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBNurbSpline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class NurbSpline : Curve
```
```vb
Public Class NurbSpline
	Inherits Curve
```
```cpp
public ref class NurbSpline : public Curve
```
```fsharp
type NurbSpline =
    class
        inherit Curve
    end
```

The NurbSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CtrlPoints | Returns the control points of the nurb spline. |
|  | Degree | Returns the degree of the nurb spline. |
|  | isRational | Returns whether the nurb spline is rational or not. |
|  | Knots | Return/set the knots of the nurb spline. |
|  | Weights | Returns the weights of the nurb spline. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new geometric NurbSpline object from a HermiteSpline. |
|  | CreateCurve(HermiteSpline) | Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
|  | CreateCurve(IListXYZ, IListDouble) |  |
|  | CreateCurve(Int32, IListDouble, IListXYZ) |  |
|  | CreateCurve(Int32, IListDouble, IListXYZ, IListDouble) |  |
|  | SetControlPointsAndWeights |  |

The nurb spline lies in the plane defined by control point, weight,knots,degree.

#### Reference

Autodesk.Revit.DB Namespace