Revit 2026 API

# RoutingPreferenceRule Methods

---

The RoutingPreferenceRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCriterion | Adds a new routing criterion. |
|  | Dispose |  |
|  | GetCriterion | Gets the specified criteria. |
|  | RemoveCriteron | Removes an existing criterion. |

#### Reference

RoutingPreferenceRule Class

Autodesk.Revit.DB Namespace