Revit 2026 API

# Leader Class

---

A leader object that can be attached to annotation elements such as text notes.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLeader

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Leader : APIObject
```
```vb
Public Class Leader
	Inherits APIObject
```
```cpp
public ref class Leader : public APIObject
```
```fsharp
type Leader =
    class
        inherit APIObject
    end
```

The Leader type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Anchor | Anchor point of the Leader |
|  | Elbow | Elbow point of the Leader. |
|  | End | End point of the Leader. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LeaderShape | Geometric style of the leader |

|  | Name | Description |
| --- | --- | --- |

For information on how to attach or get leaders to/from a text annotation refer to corresponding methods of [!:Autodesk::Revit::DB::TextNote] class.

#### Reference

Autodesk.Revit.DB Namespace