Revit 2026 API

# VertexStream Methods

---

The VertexStream type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

VertexStream Class

Autodesk.Revit.DB.DirectContext3D Namespace