Revit 2026 API

# FilterCategoryRule Methods

---

The FilterCategoryRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllCategoriesFilterable |  |
|  | GetCategories | Gets the rule's categories. |
|  | SetCategories |  |

#### Reference

FilterCategoryRule Class

Autodesk.Revit.DB Namespace