Revit 2026 API

# BoundaryConditions Methods

---

The BoundaryConditions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundaryConditionsType | Returns the boundary conditions type. |
|  | GetCurve | Returns curve that define geometry of the line boundary conditions. |
|  | GetDegreesOfFreedomCoordinateSystem | Gets the origin and rotation of coordinate system that is used by translation and rotation parameters, like X Translation or Z Rotation. |
|  | GetLoops | Returns curve loops that define geometry of the area boundary conditions. |
|  | GetOrientTo | Returns the boundary conditions orientation option. |
|  | SetOrientTo | Sets the boundary condition orientation option. |

#### Reference

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace