Revit 2026 API

# RevitCommandId Methods

---

The RevitCommandId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | LookupCommandId | Looks up and retrieves the Revit command id with the given id string. |
|  | LookupPostableCommandId | Looks up and retrieves the Revit command id with the given id string. |

#### Reference

RevitCommandId Class

Autodesk.Revit.UI Namespace