Revit 2026 API

# ShapeBuilder Class

---

The base class for geometry builder classes.

SystemObject Autodesk.Revit.DBShapeBuilder Autodesk.Revit.DBBRepBuilder Autodesk.Revit.DBTessellatedShapeBuilder Autodesk.Revit.DBViewShapeBuilder Autodesk.Revit.DBWireframeBuilder

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ShapeBuilder : IDisposable
```
```vb
Public Class ShapeBuilder
	Implements IDisposable
```
```cpp
public ref class ShapeBuilder : IDisposable
```
```fsharp
type ShapeBuilder =
    class
        interface IDisposable
    end
```

The ShapeBuilder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ShapeBuilder |

#### Reference

Autodesk.Revit.DB Namespace