Revit 2026 API

# EdgeArrayArrayIterator Properties

---

The EdgeArrayArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

EdgeArrayArrayIterator Class

Autodesk.Revit.DB Namespace