Revit 2026 API

# FaceEdgeNode Class

---

An output node that represents a Face edge.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBFaceDetailNode Autodesk.Revit.DBFaceEdgeNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceEdgeNode : FaceDetailNode
```
```vb
Public Class FaceEdgeNode
	Inherits FaceDetailNode
```
```cpp
public ref class FaceEdgeNode : public FaceDetailNode
```
```fsharp
type FaceEdgeNode =
    class
        inherit FaceDetailNode
    end
```

The FaceEdgeNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetFaceEdge | Returns the Face edge object corresponding to the node. |

See also: [!:Autodesk::Revit::DB::IExportContext2D::OnFaceEdge2D].

#### Reference

Autodesk.Revit.DB Namespace