Revit 2026 API

# FilterDoubleRule Properties

---

The FilterDoubleRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Epsilon | The tolerance within which two floating-point values may be considered equal. |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

#### Reference

FilterDoubleRule Class

Autodesk.Revit.DB Namespace