Revit 2026 API

# Categories Class

---

The Categories object is a map that contains all the top-level Category objects within the Document.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCategoryNameMap Autodesk.Revit.DBCategories

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Categories : CategoryNameMap
```
```vb
Public Class Categories
	Inherits CategoryNameMap
```
```cpp
public ref class Categories : public CategoryNameMap
```
```fsharp
type Categories =
    class
        inherit CategoryNameMap
    end
```

The Categories type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Whether or not the list of top-level categories is empty.(Overrides CategoryNameMapIsEmpty) |
|  | ItemBuiltInCategory | Retrieves a category object corresponding to a BuiltInCategory id. |
|  | ItemString | Gets a category which has the specified name from this list of top-level categories.(Overrides CategoryNameMapItemString) |
|  | Size | The total number of top-level categories in the document.(Overrides CategoryNameMapSize) |

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Identifies if a category which has the specified name is in the list of top-level categories.(Overrides CategoryNameMapContains(String)) |
|  | ForwardIterator | Retrieves a forward moving iterator to the map.(Overrides CategoryNameMapForwardIterator) |
|  | GetEnumerator | Retrieves a forward moving iterator to the map.(Overrides CategoryNameMapGetEnumerator) |
|  | Insert | Inserts the specified category with the specified name into the map.(Overrides CategoryNameMapInsert(String, Category)) |
|  | NewSubcategory | Add a new subcategory into the Autodesk Revit document. |
|  | ReverseIterator | Retrieves a backward moving iterator to the map.(Overrides CategoryNameMapReverseIterator) |

Use this object to retrieve categories by name or by BuiltInCategory id.

#### Reference

Autodesk.Revit.DB Namespace