Revit 2026 API

# EndTreatmentType Properties

---

The EndTreatmentType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndTreatment | String describing the end treatment |

#### Reference

EndTreatmentType Class

Autodesk.Revit.DB.Structure Namespace