Revit 2026 API

# DataStorage Methods

---

The DataStorage type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new DataStorage element and adds it to the document. |

#### Reference

DataStorage Class

Autodesk.Revit.DB.ExtensibleStorage Namespace