Revit 2026 API

# ZoneEquipmentData Methods

---

The ZoneEquipmentData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsDataCompleted | Is the required data completed for this zone equipment? |

#### Reference

ZoneEquipmentData Class

Autodesk.Revit.DB.Mechanical Namespace