Revit 2026 API

# ContourSettingItem Methods

---

The ContourSettingItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ContourSettingItem Class

Autodesk.Revit.DB Namespace