Revit 2026 API

# VertexPosition Properties

---

The VertexPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | The vertex's position. |

#### Reference

VertexPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace