Revit 2026 API

# CableTrayConduitRunBase Class

---

The base class for a cable tray or conduit run in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.ElectricalCableTrayConduitRunBase Autodesk.Revit.DB.ElectricalCableTrayRun Autodesk.Revit.DB.ElectricalConduitRun

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CableTrayConduitRunBase : Element
```
```vb
Public Class CableTrayConduitRunBase
	Inherits Element
```
```cpp
public ref class CableTrayConduitRunBase : public Element
```
```fsharp
type CableTrayConduitRunBase =
    class
        inherit Element
    end
```

The CableTrayConduitRunBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Length | The length of the whole (cable tray or conduit) run default 0.0 |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Electrical Namespace