Revit 2026 API

# Gutter Properties

---

The Gutter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GutterType | Retrieves/set an object that represents the type of the Gutter. |

#### Reference

Gutter Class

Autodesk.Revit.DB.Architecture Namespace