Revit 2026 API

# HermiteSpline Class

---

A Hermite spline.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBHermiteSpline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HermiteSpline : Curve
```
```vb
Public Class HermiteSpline
	Inherits Curve
```
```cpp
public ref class HermiteSpline : public Curve
```
```fsharp
type HermiteSpline =
    class
        inherit Curve
    end
```

The HermiteSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ControlPoints | The control points of the Hermite spline. |
|  | IsPeriodic | Returns whether the Hermite spline is periodic or not. |
|  | Parameters | Returns the params of the Hermite spline. |
|  | Tangents | Returns the tangents of the Hermite spline. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(IListXYZ, Boolean) |  |
|  | Create(IListXYZ, Boolean, HermiteSplineTangents) |  |

The Hermite spline lies in the plane defined by control points.

#### Reference

Autodesk.Revit.DB Namespace