Revit 2026 API

# ParameterSet Properties

---

The ParameterSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of parameters that are in the set. |

#### Reference

ParameterSet Class

Autodesk.Revit.DB Namespace