Revit 2026 API

# MEPFamilyConnectorInfo Class

---

MEP family connector information.

SystemObject Autodesk.Revit.DBMEPConnectorInfo Autodesk.Revit.DBMEPFamilyConnectorInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPFamilyConnectorInfo : MEPConnectorInfo
```
```vb
Public Class MEPFamilyConnectorInfo
	Inherits MEPConnectorInfo
```
```cpp
public ref class MEPFamilyConnectorInfo : public MEPConnectorInfo
```
```fsharp
type MEPFamilyConnectorInfo =
    class
        inherit MEPConnectorInfo
    end
```

The MEPFamilyConnectorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetAssociateFamilyParameterId | Gets the associate family parameter id of the specified connector parameter id. |
|  | GetConnectorParameterValue | Gets the parameter value of the specified connector parameter id. |

#### Reference

Autodesk.Revit.DB Namespace