Revit 2026 API

# Blend Class

---

A blend solid or void form.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBBlend

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Blend : GenericForm
```
```vb
Public Class Blend
	Inherits GenericForm
```
```cpp
public ref class Blend : public GenericForm
```
```fsharp
type Blend =
    class
        inherit GenericForm
    end
```

The Blend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BottomOffset | The offset of the bottom end of the blend relative to the sketch plane. |
|  | BottomProfile | The curves which make up the bottom profile of the sketch. |
|  | BottomSketch | Returns the Bottom Sketch of the Blend. |
|  | TopOffset | The offset of the top end of the blend relative to the sketch plane. |
|  | TopProfile | The curves which make up the top profile of the sketch. |
|  | TopSketch | Returns the Top Sketch of the Blend. |

|  | Name | Description |
| --- | --- | --- |
|  | GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles. |
|  | SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles. |

#### Reference

Autodesk.Revit.DB Namespace