Revit 2026 API

# LinkNode Properties

---

The LinkNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SymbolId | Identifies the Id of the symbol associated with the node. |

#### Reference

LinkNode Class

Autodesk.Revit.DB Namespace