Revit 2026 API

# StructuralSectionSigmaProfile Properties

---

The StructuralSectionSigmaProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendWidth | Bend segment width. |
|  | MiddleBendLength | Middle Bend segment length. |
|  | TopBendLength | Top Bend segment length. |

#### Reference

StructuralSectionSigmaProfile Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace