Revit 2026 API

# MassSurfaceData Class

---

**Note: This API is now obsolete.**

Holds properties and other data about a face in the MassEnergyAnalyticalModel element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisMassSurfaceData

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")]
public class MassSurfaceData : Element
```
```vb
<ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")>
Public Class MassSurfaceData
	Inherits Element
```
```cpp
[ObsoleteAttribute(L"This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")]
public ref class MassSurfaceData : public Element
```
```fsharp
[<ObsoleteAttribute("This class is deprecated in Revit 2023 and may be removed in a later version of Revit. We suggest you use the 'EnergyAnalyticalDetailModel' and 'EnergyAnalysisSurface' classes instead.")>]
type MassSurfaceData =
    class
        inherit Element
    end
```

The MassSurfaceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | Area of the references that the MassSurfaceData provides properties for. |
|  | CategoryIdForConceptualSurfaceType | Returns the mass subcategory ElementId used for ConceptualSurfaceType for this MassSurfaceData. |
|  | ConceptualConstructionId | The id of the conceptual construction associated with the reference surface. |
|  | IsConceptualConstructionByEnergyData | True when the ConceptualConstructionType id is synchronized to the EnergyDataSettings. False when the ConceptualConstructionType id is overridden for this MassSurfaceData. |
|  | IsGlazingShaded | Indicates if shade geometry is auto-generated on the top edge of auto-generated glazing. |
|  | IsSlab | Indicates if a floor is a slab. |
|  | IsUnderground | Indicates if the roof, floor, slab, or wall surface reference is underground. |
|  | MassLevelDataId | The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData related to the same mass as the referenced face. |
|  | MaterialId | The visualization material used for the surface for displaying the energy analytical model. |
|  | MaterialType | material type of mass zone |
|  | PercentageGlazing | The target percentage of the reference wall surface that is to be covered with automatically generated windows. Revit will use this number when determining the size, shape, and location of automatically generated windows. |
|  | PercentageSkylights | The target percentage of the reference roof surface that is to be covered with automatically generated skylights. Revit will use this number when determining the size, shape, and location of automatically generated skylights. |
|  | ReferenceElementId | The ElementId of the element whose face the MassSurfaceData primarily refers to. |
|  | ShadeDepth | How far any auto-generated shades should extend from the wall surface. |
|  | SillHeight | The height above the level where the bottoms of auto-generated windows will be located. |
|  | SkylightWidth | The length dimension to be used for the sides of each individual square skylight produced in the grid of auto-generated skylights. |
|  | SurfaceDataSource | Indicates whether the MassSurfaceData properties are driven by the EnergyDataSettings of the Document or are overridden for the surface. |

|  | Name | Description |
| --- | --- | --- |
|  | GetFaceReferences | Gets References to the faces that the MassSurfaceData provides properties for. |

Properties stored in the MassSurfaceData can be used in regeneration by the MassEnergyAnalyticalModel. For example, faces of the MassEnergyAnalyticalModel take their material values from the settings in the MassSurfaceData.

#### Reference

Autodesk.Revit.DB.Analysis Namespace