Revit 2026 API

# AssetPropertyUInt64 Properties

---

The AssetPropertyUInt64 type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property. |

#### Reference

AssetPropertyUInt64 Class

Autodesk.Revit.DB.Visual Namespace