Revit 2026 API

# ElementArray Class

---

An array that contains element objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBElementArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementArray : APIObject,
	IEnumerable
```
```vb
Public Class ElementArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ElementArray : public APIObject,
	IEnumerable
```
```fsharp
type ElementArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ElementArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementArray | Initializes a new instance of the ElementArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets an element at a specified index within the array. |
|  | Size | Returns the number of elements that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the element to the end of the array. |
|  | Clear | Removes every element from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified element into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace