Revit 2026 API

# FabricWireItem Methods

---

The FabricWireItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a single Fabric wire. |
|  | Dispose |  |

#### Reference

FabricWireItem Class

Autodesk.Revit.DB.Structure Namespace