Revit 2026 API

# ExternalResourceLoadContent Methods

---

The ExternalResourceLoadContent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExternalResourceLoadContent Class

Autodesk.Revit.DB Namespace