Revit 2026 API

# AddInIdAttribute Properties

---

The AddInIdAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | AddInId guid value. |

#### Reference

AddInIdAttribute Class

Autodesk.Revit.DB.Macros Namespace