Revit 2026 API

# FaceSecondDerivatives Class

---

Contains second partial derivatives of a face at a specified point.

SystemObject Autodesk.Revit.DBFaceSecondDerivatives

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceSecondDerivatives : IDisposable
```
```vb
Public Class FaceSecondDerivatives
	Implements IDisposable
```
```cpp
public ref class FaceSecondDerivatives : IDisposable
```
```fsharp
type FaceSecondDerivatives =
    class
        interface IDisposable
    end
```

The FaceSecondDerivatives type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MixedDerivative | The mixed derivative. |
|  | UUDerivative | The second derivative with respect to U. |
|  | VVDerivative | The second derivative with respect to V. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FaceSecondDerivatives |

#### Reference

Autodesk.Revit.DB Namespace