Revit 2026 API

# SlabShapeVertex Methods

---

The SlabShapeVertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SlabShapeVertex Class

Autodesk.Revit.DB Namespace