Revit 2026 API

# AssetPropertyFloat Methods

---

The AssetPropertyFloat type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

AssetPropertyFloat Class

Autodesk.Revit.DB.Visual Namespace