Revit 2026 API

# ApplicationException Methods

---

The ApplicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ApplicationException Class

Autodesk.Revit.Exceptions Namespace