Revit 2026 API

# TessellatedFace Class

---

Defines a planar face bounded by a polyline in 3d space. A face consists of a single connected component and can have holes.

SystemObject Autodesk.Revit.DBTessellatedFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TessellatedFace : IDisposable
```
```vb
Public Class TessellatedFace
	Implements IDisposable
```
```cpp
public ref class TessellatedFace : IDisposable
```
```fsharp
type TessellatedFace =
    class
        interface IDisposable
    end
```

The TessellatedFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TessellatedFace(IListXYZ, ElementId) | Initializes a new instance of the TessellatedFace class |
|  | TessellatedFace(IListIListXYZ, ElementId) | Initializes a new instance of the TessellatedFace class |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaterialId | Material of the face. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TessellatedFace |
|  | GetBoundaryLoops | Get loops bounding the face. |

#### Reference

Autodesk.Revit.DB Namespace