Revit 2026 API

# Solid Methods

---

The Solid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComputeCentroid | Returns the Centroid of this solid. |
|  | GetBoundingBox | Retrieves a box that circumscribes the solid geometry. |
|  | IntersectWithCurve | Calculates and returns the intersection between a curve and this solid. |

#### Reference

Solid Class

Autodesk.Revit.DB Namespace