Revit 2026 API

# StructuralConnectionSettings Properties

---

The StructuralConnectionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IncludeWarningControls | This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed. |

#### Reference

StructuralConnectionSettings Class

Autodesk.Revit.DB.Structure Namespace