Revit 2026 API

# IFCLinkDocumentExportScope Methods

---

The IFCLinkDocumentExportScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCLinkDocumentExportScope Class

Autodesk.Revit.DB.IFC Namespace