Revit 2026 API

# RoutingCondition Class

---

RoutingCondition represents routing information that is used as input when determining if a routing criterion, such as minimum or maximum diameter, is met.

SystemObject Autodesk.Revit.DBRoutingCondition

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoutingCondition : IDisposable
```
```vb
Public Class RoutingCondition
	Implements IDisposable
```
```cpp
public ref class RoutingCondition : IDisposable
```
```fsharp
type RoutingCondition =
    class
        interface IDisposable
    end
```

The RoutingCondition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RoutingCondition | Creates a new RoutingCondition. |

|  | Name | Description |
| --- | --- | --- |
|  | Diameter | The diameter of the segment or fitting specified for the routing condition. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RoutingCondition |

#### Reference

Autodesk.Revit.DB Namespace