Revit 2026 API

# PanelTypeSet Properties

---

The PanelTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of panel types that are in the set. |

#### Reference

PanelTypeSet Class

Autodesk.Revit.DB Namespace