Revit 2026 API

# AssemblyDifference Methods

---

The AssemblyDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

AssemblyDifference Class

Autodesk.Revit.DB Namespace