Revit 2026 API

# DWGImportOptions Methods

---

The DWGImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetLineWeights | Gets array of line weights. |
|  | SetLineWeights |  |

#### Reference

DWGImportOptions Class

Autodesk.Revit.DB Namespace