Revit 2026 API

# StdPostedWarning Class

---

Support for Reviewable Warnings sent from AddOn.

SystemObject Autodesk.Revit.DBStdPostedWarning

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StdPostedWarning : IDisposable
```
```vb
Public Class StdPostedWarning
	Implements IDisposable
```
```cpp
public ref class StdPostedWarning : IDisposable
```
```fsharp
type StdPostedWarning =
    class
        interface IDisposable
    end
```

The StdPostedWarning type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the StdPostedWarning |

Used to create and send Reviewable Warning from AddOn.

#### Reference

Autodesk.Revit.DB Namespace