Revit 2026 API

# CableTrayType Properties

---

The CableTrayType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendMultiplier | Bend multiplier. |
|  | IsWithFitting | Whether this cable tray type is with fitting |
|  | ShapeType | Shape of this cable tray type. |

#### Reference

CableTrayType Class

Autodesk.Revit.DB.Electrical Namespace