Revit 2026 API

# HasValueFilterRule Class

---

Tests whether an element's parameter has a value.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBParameterValuePresenceRule Autodesk.Revit.DBHasValueFilterRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HasValueFilterRule : ParameterValuePresenceRule
```
```vb
Public Class HasValueFilterRule
	Inherits ParameterValuePresenceRule
```
```cpp
public ref class HasValueFilterRule : public ParameterValuePresenceRule
```
```fsharp
type HasValueFilterRule =
    class
        inherit ParameterValuePresenceRule
    end
```

The HasValueFilterRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HasValueFilterRule | constructs an instance of HasValueFilterRule. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace