Revit 2026 API

# BeamSystem Class

---

An object that represents a BeamSystem within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBBeamSystem

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BeamSystem : Element
```
```vb
Public Class BeamSystem
	Inherits Element
```
```cpp
public ref class BeamSystem : public Element
```
```fsharp
type BeamSystem =
    class
        inherit Element
    end
```

The BeamSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BeamSystemType | Retrieves or changes the type of the BeamSystem. |
|  | BeamType | Retrieves or changes the Beam Type of the BeamSystem. |
|  | Direction | The Direction of the BeamSystem. |
|  | Elevation | Retrieves or changes the Elevation of the BeamSystem. |
|  | LayoutRule | Retrieves or changes the LayoutRule of the BeamSystem. |
|  | Level | Get or change the level of the BeamSystem. When the level is changed, the elevation is changed to make the the BeamSystem remain the location. |
|  | Profile | Retrieve or set the profile of the BeamSystem. |

|  | Name | Description |
| --- | --- | --- |
|  | BeamBelongsTo | Find out the BeamSystem to which the beam belongs. |
|  | Create(Document, IListCurve, SketchPlane, Int32) |  |
|  | Create(Document, IListCurve, Level, XYZ, Boolean) |  |
|  | Create(Document, IListCurve, Level, Int32, Boolean) |  |
|  | Create(Document, IListCurve, SketchPlane, XYZ, Boolean) |  |
|  | DropBeamSystem | Drop beam system, it will disassociate all members from the beam system and delete the beam system. |
|  | GetBeamIds | Gets all the beams of the BeamSystem. |

This object is derived from the Element base object. It can be used to access properties of a BeamSystem, such as elevation, level, etc. It also provides access to the beams (FamilyInstances) that are created by this BeamSystem.

#### Reference

Autodesk.Revit.DB Namespace