Revit 2026 API

# PlanCircuitSetIterator Properties

---

The PlanCircuitSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

PlanCircuitSetIterator Class

Autodesk.Revit.DB Namespace