Revit 2026 API

# VertexPosition Methods

---

The VertexPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |

#### Reference

VertexPosition Class

Autodesk.Revit.DB.DirectContext3D Namespace