Revit 2026 API

# IFCFileWriteOptions Methods

---

The IFCFileWriteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCFileWriteOptions Class

Autodesk.Revit.DB.IFC Namespace