Revit 2026 API

# RebarShapeConstraint180DegreeBendRadius Properties

---

The RebarShapeConstraint180DegreeBendRadius type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | A choice of rule for measuring the radius. |

#### Reference

RebarShapeConstraint180DegreeBendRadius Class

Autodesk.Revit.DB.Structure Namespace