Revit 2026 API

# ModificationForbiddenException Methods

---

The ModificationForbiddenException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ModificationForbiddenException Class

Autodesk.Revit.Exceptions Namespace