Revit 2026 API

# BuildingPadType Methods

---

The BuildingPadType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefault | Creates a BuildingPadType element and adds it to the document. |

#### Reference

BuildingPadType Class

Autodesk.Revit.DB Namespace