Revit 2026 API

# VertexPositionNormal Properties

---

The VertexPositionNormal type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Normal | The vertex's normal vector. |
|  | Position | The vertex's position. |

#### Reference

VertexPositionNormal Class

Autodesk.Revit.DB.DirectContext3D Namespace