Revit 2026 API

# IndexPoint Methods

---

The IndexPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

#### Reference

IndexPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace