Revit 2026 API

# TopographySurface Methods

---

The TopographySurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddPoints | **Obsolete.** |
|  | ArePointsDistinct |  |
|  | AsSiteSubRegion | Obtains the subregion object represented by this element. |
|  | ChangePointElevation | **Obsolete.** Changes the elevation value for a point. |
|  | ChangePointsElevation | **Obsolete.** |
|  | ContainsPoint | Identifies whether the given point exists in the topography surface. |
|  | Create(Document, IListXYZ) | **Obsolete.** |
|  | Create(Document, IListXYZ, IListPolymeshFacet) | **Obsolete.** |
|  | DeletePoints | **Obsolete.** |
|  | FindPoints | Filters and returns only the points of the topography surface which lie within the input bounding box. |
|  | GetBoundaryPoints | Gets the points which are on the boundary of the topography surface. |
|  | GetHostedSubRegionIds | Gets the ids of all subregion elements hosted on this topography surface. |
|  | GetInteriorPoints | Gets all of the points that are not boundary points for the topography surface. |
|  | GetPoints | Gets the points that define this topography surface. |
|  | IsBoundaryPoint | Identifies whether the given point is an existing boundary point of the current topography surface. |
|  | IsValidFaceSet |  |
|  | IsValidRegion |  |
|  | MovePoint | **Obsolete.** Moves a point in a TopographySurface to a new designated location. |
|  | MovePoints | **Obsolete.** |

#### Reference

TopographySurface Class

Autodesk.Revit.DB.Architecture Namespace