Revit 2026 API

# ApplicationException Properties

---

The ApplicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FunctionId | The information of the function throwing the exception. |

#### Reference

ApplicationException Class

Autodesk.Revit.Exceptions Namespace