Revit 2026 API

# ParameterSet Class

---

A set that contains parameters.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBParameterSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ParameterSet : APIObject,
	IEnumerable
```
```vb
Public Class ParameterSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ParameterSet : public APIObject,
	IEnumerable
```
```fsharp
type ParameterSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ParameterSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ParameterSet | Initializes a new instance of the ParameterSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of parameters that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every parameter from the set, rendering it empty. |
|  | Contains | Tests for the existence of a parameter within the set. |
|  | Erase | Removes a specified parameter from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified parameter into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace