Revit 2026 API

# InCanvasControlData Methods

---

The InCanvasControlData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

InCanvasControlData Class

Autodesk.Revit.DB Namespace