Revit 2026 API

# RibbonButtonOptions Methods

---

The RibbonButtonOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RibbonButtonOptions Class

Autodesk.Revit.UI Namespace