Revit 2026 API

# CutMarkType Class

---

An object represents the cut mark type in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ArchitectureCutMarkType

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CutMarkType : ElementType
```
```vb
Public Class CutMarkType
	Inherits ElementType
```
```cpp
public ref class CutMarkType : public ElementType
```
```fsharp
type CutMarkType =
    class
        inherit ElementType
    end
```

The CutMarkType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CutLineAngle | The rotation angle of the cut mark. |
|  | CutLineDistance | The distance between 2 cut lines. |
|  | CutLineExtension | The extension distance to the boundary. |
|  | CutLineType | The cut line type of the cut mark. |
|  | CutMarkSymbol | The symbol type of the cut mark. |
|  | CutMarkSymbolSize | The size of the cut mark symbol. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Architecture Namespace