Revit 2026 API

# AngularDimension Class

---

An object that represents an Angular Dimension within the Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDimension Autodesk.Revit.DBAngularDimension Autodesk.Revit.DBArcLengthDimension

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AngularDimension : Dimension
```
```vb
Public Class AngularDimension
	Inherits Dimension
```
```cpp
public ref class AngularDimension : public Dimension
```
```fsharp
type AngularDimension =
    class
        inherit Dimension
    end
```

The AngularDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | SetAngularRadius | Set radius of an Angular Dimension arc. The new radius of the arc. |

#### Reference

Autodesk.Revit.DB Namespace