Revit 2026 API

# WorksetKindFilter Class

---

A filter used to match worksets of the given WorksetKind.

SystemObject Autodesk.Revit.DBWorksetFilter Autodesk.Revit.DBWorksetKindFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WorksetKindFilter : WorksetFilter
```
```vb
Public Class WorksetKindFilter
	Inherits WorksetFilter
```
```cpp
public ref class WorksetKindFilter : public WorksetFilter
```
```fsharp
type WorksetKindFilter =
    class
        inherit WorksetFilter
    end
```

The WorksetKindFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WorksetKindFilter(WorksetKind) | Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind. |
|  | WorksetKindFilter(WorksetKind, Boolean) | Constructs a new instance of WorksetKindFilter filter to match worksets of the given WorksetKind. |

|  | Name | Description |
| --- | --- | --- |
|  | WorksetKind | The WorksetKind. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter.

#### Reference

Autodesk.Revit.DB Namespace