Revit 2026 API

# CategorySetIterator Class

---

An iterator to a category set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCategorySetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CategorySetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CategorySetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CategorySetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CategorySetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CategorySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategorySetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace