Revit 2026 API

# FieldDomainPointsByParameter Class

---

Represents a set of one-dimensional point coordinates (defined usually on curve)

SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByParameter

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FieldDomainPointsByParameter : FieldDomainPoints
```
```vb
Public Class FieldDomainPointsByParameter
	Inherits FieldDomainPoints
```
```cpp
public ref class FieldDomainPointsByParameter : public FieldDomainPoints
```
```fsharp
type FieldDomainPointsByParameter =
    class
        inherit FieldDomainPoints
    end
```

The FieldDomainPointsByParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FieldDomainPointsByParameter | Initializes a new instance of the FieldDomainPointsByParameter class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Analysis Namespace