Revit 2026 API

# RebarShapeMultiplanarDefinition Methods

---

The RebarShapeMultiplanarDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | SetPresenceOfSegments | Simultaneously set the presence of all 3D segments. |

#### Reference

RebarShapeMultiplanarDefinition Class

Autodesk.Revit.DB.Structure Namespace