Revit 2026 API

# VertexIndexPairArrayIterator Methods

---

The VertexIndexPairArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

VertexIndexPairArrayIterator Class

Autodesk.Revit.DB Namespace