Revit 2026 API

# InsulationTypeSet Class

---

A set that contains insulation types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalInsulationTypeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InsulationTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class InsulationTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class InsulationTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type InsulationTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The InsulationTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InsulationTypeSet | Initializes a new instance of the InsulationTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of insulation types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every insulation type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a insulation type within the set. |
|  | Erase | Removes a specified insulation type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified insulation type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace