Revit 2026 API

# EdgeArray Class

---

An array that contains edges.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBEdgeArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EdgeArray : APIObject, IEnumerable
```
```vb
Public Class EdgeArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class EdgeArray : public APIObject,
	IEnumerable
```
```fsharp
type EdgeArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The EdgeArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EdgeArray | Initializes a new instance of the EdgeArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets an edge at a specified index within the array. |
|  | Size | Returns the number of edges that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the edge to the end of the array. |
|  | Clear | Removes every edge from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified edge into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace