Revit 2026 API

# Rebar Class

---

Represents a rebar element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureRebar

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Rebar : Element
```
```vb
Public Class Rebar
	Inherits Element
```
```cpp
public ref class Rebar : public Element
```
```fsharp
type Rebar =
    class
        inherit Element
    end
```

The Rebar type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanHaveVaryingLengthBars | Identifies if a set can have varying length bars or not. |
|  | FreeFormAlignedServerGuid | Guid used for identifying the external IRebarUpdateServer for computing Aligned Free Form Rebar. |
|  | FreeFormSurfaceServerGuid | Guid used for identifying the external IRebarUpdateServer for computing Surface Free Form Rebar. |
|  | HasVariableLengthBars | Identifies if a set has varying length bars or not. |
|  | IncludeFirstBar | Identifies if the first bar in rebar set is shown. |
|  | IncludeLastBar | Identifies if the last bar in rebar set is shown. |
|  | LayoutRule | Identifies the layout rule of rebar set. |
|  | MaxSpacing | Identifies the maximum spacing between rebar in rebar set. |
|  | NumberOfBarPositions | The number of potential bars in the set. |
|  | Quantity | Identifies the number of bars in rebar set. |
|  | ReadOnlyParameters | When set to true, Rebar will report all its parameters as read only. For example, the method Parameter::IsReadOnly() for all Rebar Parameters will return true. When set to false, the return value of Parameter::IsReadOnly() will not be affected. |
|  | ScheduleMark | The Schedule Mark parameter. On creation, the Schedule Mark is set to a value that is unique to the host, but it can be set to any value. |
|  | TotalLength | The length of an individual bar multiplied by Quantity. |
|  | Volume | The volume of an individual bar multiplied by Quantity. |

|  | Name | Description |
| --- | --- | --- |
|  | CanApplyPresentationMode | Checks if a presentation mode can be applied for this rebar in the given view. |
|  | CanBeMatchedWithMultipleShapes | Checks if this Rebar can be matched with multiple Rebar Shapes. |
|  | CanSuppressFirstOrLastBar | Checks if the first or last bar in rebar set can be hidden in the given view. |
|  | CanUseHookType | Checks if the specified RebarHookType id is of a valid RebarHookType for the Rebar's RebarBarType |
|  | ClearPresentationMode | Sets the presentation mode for this rebar set to the default (either for a single view, or for all views). |
|  | ConstraintsCanBeEdited | For ShapeDriven Rebar: returns true, if the Rebar element's external constraints are available for editing using the RebarConstraintsManager class. It will return false if Rebar is in GroupFor FreeForm rebar: constraints can be edited if there is a valid external server Guid assigned to that Rebar |
|  | ContainsValidArcRadiiForStyleAndBarType |  |
|  | CreateFreeForm(Document, Guid, RebarBarType, Element) | Creates a free form rebar that can have constraints. |
|  | CreateFreeForm(Document, RebarBarType, Element, IListCurveLoop, RebarFreeFormValidationResult) | **Obsolete.** |
|  | CreateFreeForm(Document, RebarBarType, Element, IListCurveLoop, RebarStyle) |  |
|  | CreateFreeForm(Document, RebarBarType, Element, IListIListCurve, RebarFreeFormValidationResult) | **Obsolete.** |
|  | CreateFreeForm(Document, RebarBarType, Element, IListIListCurve, RebarStyle) |  |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, Element, XYZ, IListCurve, BarTerminationsData, Boolean, Boolean) |  |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IListCurve, RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | **Obsolete.** |
|  | CreateFromCurves(Document, RebarStyle, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IListCurve, RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId, Boolean, Boolean) | **Obsolete.** |
|  | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, Element, XYZ, IListCurve, BarTerminationsData) |  |
|  | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IListCurve, RebarHookOrientation, RebarHookOrientation) | **Obsolete.** |
|  | CreateFromCurvesAndShape(Document, RebarShape, RebarBarType, RebarHookType, RebarHookType, Element, XYZ, IListCurve, RebarHookOrientation, RebarHookOrientation, Double, Double, ElementId, ElementId) | **Obsolete.** |
|  | CreateFromRebarShape | Creates a new shape driven Rebar, as an instance of a RebarShape. The instance will have the default shape parameters from the RebarShape, and its location is based on the bounding box of the shape in the shape definition. Hooks and cranks are removed from the shape before computing its bounding box. If appropriate hooks and cranks can be found in the document, they will be assigned arbitrarily. |
|  | DoesBarExistAtPosition | Checks whether a bar is included at the specified position. |
|  | EnableCrankLengthOverride | Enables or disables the ability to override crank lengths for this rebar instance. |
|  | EnableHookLengthOverride | Enables or disables the ability to override hook lengths for this rebar instance. |
|  | FindMatchingPredefinedPresentationMode | Determines if there is a matching RebarPresentationMode for the current set of selected hidden and unhidden bars assigned to the given view. |
|  | GetAllRebarShapeIds | Gets the ids of the RebarShapes elements that defines the shapes of the rebar. |
|  | GetBarIndexFromReference | Given a reference that represents a part of a bar, this method will return the bar index. |
|  | GetBendData | Gets the RebarBendData, containing bar and hook information, of the instance. |
|  | GetCenterlineCurves | A chain of curves representing the centerline of the rebar. |
|  | GetCouplerId | Get the id of the Rebar Coupler that is applied to the rebar at the specified end. |
|  | GetCrankAngledLength | Gets the crank angled length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type. |
|  | GetCrankLength | Gets the crank length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type. |
|  | GetCrankOffsetLength | Gets the crank offset length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type. |
|  | GetCrankRatio | Gets the crank ratio at the indicated bar end. |
|  | GetCrankStraightLength | Gets the crank straight length at the indicated bar end. If the crank lengths are overriden will return the overriden value. Otherwise will return the value from the RebarBarType for the existing Crank Type. |
|  | GetCrankTypeId | Gets the id of the Crank Type id that is applied to the rebar. |
|  | GetEndTreatmentTypeId | Get the id of the EndTreatmentType that is applied to the rebar. |
|  | GetFreeFormAccessor | Returns an interface providing access to free-form properties and methods for this Rebar element. |
|  | GetFullGeometryForView | Generates full geometry for the Rebar for a specific view. |
|  | GetHookOrientation | **Obsolete.** Returns the orientation of the termination's plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal. The orientation it's the same for both hook and crank. |
|  | GetHookRotationAngle | **Obsolete.** Gets the termination's out of plane rotation angle at the specified end. The rotation angle it's the same for both hook and crank. |
|  | GetHookTypeId | Get the id of the RebarHookType that is applied to the rebar. |
|  | GetHostId | The element that contains the rebar. |
|  | GetLapLength | Gets the lap length that is used for the specified end - 0 for start, 1 for end. |
|  | GetMovedBarTransform | Returns a transform representing the movement of the bar relative to its default position along the distribution path. |
|  | GetOverridableCrankParameters | Gets the formula parameter ids defined in the RebarShape family which are associated with crank length, crank offset length, crank straight length and crank angled length parameters. |
|  | GetOverridableHookParameters |  |
|  | GetParameterValueAtIndex | Get the parameter value for a bar at the specified index. |
|  | GetPresentationMode | Gets the presentation mode for this rebar set when displayed in the given view. |
|  | GetRebarConstraintsManager | Returns an object for managing the external constraints on the Rebar element |
|  | GetRebarSplice | Gets the rebar splice at the specified bar end - 0 for start, 1 for end. |
|  | GetReinforcementRoundingManager | Returns an object for managing reinforcement rounding override settings. |
|  | GetShapeDrivenAccessor | Returns an interface providing access to shape-driven properties and methods for this Rebar element. |
|  | GetShapeId | Returns the id of the RebarShape element that defines the shape of the rebar. |
|  | GetSpliceStaggerLength | Gets the stagger length that is used for the specified end - 0 for start, 1 for end. |
|  | GetTerminationOrientation | Gets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal. |
|  | GetTerminationRotationAngle | Gets the termination's (e.g hook, crank) out of plane rotation angle at the specified end. |
|  | GetTransformedCenterlineCurves | A chain of curves representing the centerline of the rebar. |
|  | HasPresentationOverrides | Identifies if this Rebar has overridden default presentation settings for the given view. |
|  | HookAngleMatchesRebarShapeDefinition | Checks that the hook angle of the specified RebarHookType matches the hook angle used in the Rebar's RebarShape at the specified end of the bar. |
|  | IsBarHidden | Identifies if a given bar in this rebar set is hidden in this view. |
|  | IsCrankLengthOverrideEnabled | Returns true if the ability to override crank lengths is enabled for this rebar instance, false otherwise. |
|  | IsHookLengthOverrideEnabled | Returns True if the ability to override hook lengths is enabled for this rebar instance, False otherwise. |
|  | IsRebarFreeForm | Returns true if the rebar is free form and false if shape driven. |
|  | IsRebarInSection | Identifies if this Rebar is cut by the view plane of the given view. |
|  | IsRebarShapeDriven | Returns true if the rebar is shape driven and false if free form. |
|  | IsUnobscuredInView | Checks if this rebar element is shown unobscured in a view. |
|  | MoveBarInSet | This method applies the transformation matrix to the rebar bar at the desired position in the rebar set. If the bar was already moved, the method will concatenate the transformation matrix with the existing movement. |
|  | RebarShapeMatchesCurvesAndHooks | **Obsolete.** |
|  | RebarShapeMatchesCurvesHooksAndEndTreatment | **Obsolete.** |
|  | RemoveSplice | Removes the splice relation at the specified end and all the Rebar Constraints involved in splice. |
|  | ResetMovedBarTransform | Reset the transformation representing the movement of the bar relative to its default position along the distribution path. The moved bar transform will be set to Identity. |
|  | SetBarHiddenStatus | Sets the bar in this rebar set to be hidden or unhidden in the given view. |
|  | SetBarIncluded | Sets if the bar at the desired index is included or not. |
|  | SetCrankAngledLengthOverride | Sets the crank angled length at the indicated bar end as an override value. |
|  | SetCrankLengthOverride | Sets the crank length at the indicated bar end as an override value. |
|  | SetCrankOffsetLengthOverride | Sets the crank offset length at the indicated bar end as an override value. |
|  | SetCrankRatioOverride | Sets the crank ratio at the indicated bar end as an override value. |
|  | SetCrankStraightLengthOverride | Sets the crank straight length at the indicated bar end as an override value. |
|  | SetCrankTypeId | Sets the id of the Crank Type to be applied to the rebar. |
|  | SetEndTreatmentTypeId | Sets the id of the EndTreatmentType to be applied to the rebar. This can be done if and only if the end of the bar on which the end treatment is applied has no RebarCoupler on it, otherwise will throw an exception. |
|  | SetHookOrientation | **Obsolete.** Defines the orientation of the termination's plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal. The orientation it's the same for both hook and crank. |
|  | SetHookRotationAngle | **Obsolete.** Sets the terminitation's out of plane hook rotation angle at the specified end. The rotation angle it's the same for both hook and crank. |
|  | SetHookTypeId | Set the id of the RebarHookType to be applied to the rebar. |
|  | SetHostId | The element that contains the rebar. |
|  | SetPresentationMode | Sets the presentation mode for this rebar set when displayed in the given view. |
|  | SetTerminationOrientation | Sets the orientation of the termination's (e.g. hook, crank) plane at the start or at the end of the rebar with respect to the orientation of the first or the last curve and the plane normal. |
|  | SetTerminationRotationAngle | Sets the termination's (e.g hook, crank) out of plane rotation angle at the specified end. |
|  | SetUnobscuredInView | Sets this rebar element to be shown unobscured in a view. |

#### Reference

Autodesk.Revit.DB.Structure Namespace