Revit 2026 API

# AssetPropertyString Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyString

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyString : AssetProperty
```
```vb
Public Class AssetPropertyString
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyString : public AssetProperty
```
```fsharp
type AssetPropertyString =
    class
        inherit AssetProperty
    end
```

The AssetPropertyString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | value of the property |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

Autodesk.Revit.DB.Visual Namespace