Revit 2026 API

# RebarCurvesData Class

---

The class that contains the information needed to calculate and return the result of the external curve generation.

SystemObject Autodesk.Revit.DB.StructureRebarCurvesData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarCurvesData : IDisposable
```
```vb
Public Class RebarCurvesData
	Implements IDisposable
```
```cpp
public ref class RebarCurvesData : IDisposable
```
```fsharp
type RebarCurvesData =
    class
        interface IDisposable
    end
```

The RebarCurvesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddBarGeometry(CurveLoop) | Adds a new bar to the new rebar geometry. This information is set to the rebar after the API execution is finished successfully. |
|  | AddBarGeometry(IListCurve) |  |
|  | CanAddBarGeometry | If the layout rule is Singe or FixedNumber or NumberWithSpacing this function will return true if getNumberOfBarGeometry() is less getBarsNumber(), false otherwise.If the layout rule is MaximumSpacing or MinimumClearSpacing this function will return always true. |
|  | ClearAllAddedBarGeometry | This function will remove all bars geometry that were added by calling AddBarGeometry(). |
|  | Dispose | Releases all resources used by the RebarCurvesData |
|  | GetAddedBarGeometry | Gets the added curves that will represent the bar at index barIndex. |
|  | GetDistributionPath | Gets the distribution path currently stored in the rebar. |
|  | GetNumberOfBarGeometry | Gets the number of Bar Geometry that were added. |
|  | GetRebarUpdateCurvesData | Gets a class that contains information used as input and output for rebar free form calculation. |
|  | SetDistributionPath |  |

#### Reference

Autodesk.Revit.DB.Structure Namespace