Revit 2026 API

# IFCHybridImport Methods

---

The IFCHybridImport type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateMap |  |
|  | Dispose |  |
|  | GetIFCStepIdToElementIdMap | Retrieves the association between the original IFC STEP identifiers and the created or updated Elements. |
|  | ImportElements(Document, String) | **Obsolete.** Imports IFC Elements using AnyCAD. |
|  | ImportElements(Document, String, IFCHybridImportOptions) | Imports IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String) | **Obsolete.** Updates IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String, IFCHybridImportOptions) | Updates IFC Elements using AnyCAD. |

#### Reference

IFCHybridImport Class

Autodesk.Revit.DB.IFC Namespace