Revit 2026 API

# Opening Class

---

An opening in an Autodesk Revit project or family document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBOpening

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Opening : Element
```
```vb
Public Class Opening
	Inherits Element
```
```cpp
public ref class Opening : public Element
```
```fsharp
type Opening =
    class
        inherit Element
    end
```

The Opening type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BoundaryCurves | The geometry information for non-rectangular openings in project documents, or for all openings in family documents. |
|  | BoundaryRect | Retrieves the geometry information if the opening boundary is a rect. |
|  | Host | Retrieves the host element of this opening. |
|  | IsRectBoundary | Retrieves the information whether the opening has a rectangular boundary. |
|  | IsTransparentIn3D | Indicates if the opening is transparent in 3D view when loaded into the project. |
|  | IsTransparentInElevation | Indicates if the opening is transparent in elevation view when loaded into the project. |
|  | SketchId | Returns id of the Sketch or invalidElementId if element deon't own the Sketch. |

|  | Name | Description |
| --- | --- | --- |

The object represents a variety of different types of openings:

  * A rectangular opening in a wall created by two boundary points in a revit project.
  * An opening created by a set of curves applied to a roof, floor, ceiling, beam, brace or column.
  * A vertical shaft opening extending one or more levels.
  * A simple opening created on a wall or ceiling in a family document.

Depending upon the type of opening, some of the properties of this class will not be available. This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object. This object also supports access to a structural analytical model but this feature is only available with Autodesk Revit Structure.

#### Reference

Autodesk.Revit.DB Namespace