Revit 2026 API

# IControllableDropHandler Methods

---

The IControllableDropHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanExecute | Implement this method to inform Revit whether the drop event can be executed onto the given view. |

#### Reference

IControllableDropHandler Interface

Autodesk.Revit.UI Namespace