Revit 2026 API

# AnalysisDisplayLegend Properties

---

The AnalysisDisplayLegend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Height | The height, in sheet size, of the legend's rectangle |

#### Reference

AnalysisDisplayLegend Class

Autodesk.Revit.DB.Analysis Namespace