Revit 2026 API

# RebarShapeDefinitionByArc Properties

---

The RebarShapeDefinitionByArc type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Type | Among those rebar shapes defined by an arc, specify which kind. |

#### Reference

RebarShapeDefinitionByArc Class

Autodesk.Revit.DB.Structure Namespace