Revit 2026 API

# ImportOptions3DM Class

---

The import options used to import 3DM format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBImportOptions3DM

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ImportOptions3DM : BaseImportOptions
```
```vb
Public Class ImportOptions3DM
	Inherits BaseImportOptions
```
```cpp
public ref class ImportOptions3DM : public BaseImportOptions
```
```fsharp
type ImportOptions3DM =
    class
        inherit BaseImportOptions
    end
```

The ImportOptions3DM type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ImportOptions3DM | Constructs a new instance of ImportOptions3DM with default values of all properties. |
|  | ImportOptions3DM(ImportOptions3DM) | Constructs a new instance of ImportOptions3DM as a copy of the provided import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace