Revit 2026 API

# IRevisionsOnSheetUIServer Interface

---

The interface used to provide UI for sheet's Revisions On Sheet property.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public interface IRevisionsOnSheetUIServer : IExternalServer
```
```vb
Public Interface IRevisionsOnSheetUIServer
	Inherits IExternalServer
```
```cpp
public interface class IRevisionsOnSheetUIServer : IExternalServer
```
```fsharp
type IRevisionsOnSheetUIServer =
    interface
        interface IExternalServer
    end
```

The IRevisionsOnSheetUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShowDialog | Shows dialog on managing RevisionsOnSheetUI. |

#### Reference

Autodesk.Revit.UI Namespace