Revit 2026 API

# FaceEdgeNode Methods

---

The FaceEdgeNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFaceEdge | Returns the Face edge object corresponding to the node. |

#### Reference

FaceEdgeNode Class

Autodesk.Revit.DB Namespace