Revit 2026 API

# LoadCombination Methods

---

The LoadCombination type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, String) | Creates a new default LoadCombination. |
|  | Create(Document, String, LoadCombinationType, LoadCombinationState) | Creates a new LoadCombination. |
|  | GetCaseAndCombinationIds | Returns collection of the load combination case and combination IDs. |
|  | GetComponents | Returns collection of the load combination components. |
|  | GetUsageIds | Returns collection of the load combination usage IDs. |
|  | SetComponents |  |
|  | SetUsageIds |  |

#### Reference

LoadCombination Class

Autodesk.Revit.DB.Structure Namespace