Revit 2026 API

# TransmittedModelException Methods

---

The TransmittedModelException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

TransmittedModelException Class

Autodesk.Revit.Exceptions Namespace