Revit 2026 API

# ParameterDownloadOptions Class

---

An option class used for downloading parameters from the Parameters Service.

SystemObject Autodesk.Revit.DBParameterDownloadOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ParameterDownloadOptions : IDisposable
```
```vb
Public Class ParameterDownloadOptions
	Implements IDisposable
```
```cpp
public ref class ParameterDownloadOptions : IDisposable
```
```fsharp
type ParameterDownloadOptions =
    class
        interface IDisposable
    end
```

The ParameterDownloadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ParameterDownloadOptions | Default constructor. |
|  | ParameterDownloadOptions(ISetElementId, Boolean, Boolean, ForgeTypeId) | Initializes a new instance of the ParameterDownloadOptions class |

|  | Name | Description |
| --- | --- | --- |
|  | IsInstance | True if binding to Element instances, false if binding to Element types. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Visible | True if the parameter is visible to the user, false if it is hidden and accessible only via the API. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ParameterDownloadOptions |
|  | GetCategories | Get categories for binding. |
|  | GetGroupTypeId | Get properties palette group identifier. |
|  | SetCategories |  |
|  | SetGroupTypeId | Set properties palette group identifier. |

#### Reference

Autodesk.Revit.DB Namespace