Revit 2026 API

# CurveArrayIterator Methods

---

The CurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

CurveArrayIterator Class

Autodesk.Revit.DB Namespace