Revit 2026 API

# PostDocEventArgs Properties

---

The PostDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document associated with the event. |

#### Reference

PostDocEventArgs Class

Autodesk.Revit.DB.Events Namespace