Revit 2026 API

# TransferringProjectStandardsEventArgs Properties

---

The TransferringProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SourceDocument | Source document. |
|  | TargetDocument | Target document. |

#### Reference

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace