Revit 2026 API

# ElementIntersectsElementFilter Methods

---

The ElementIntersectsElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetElement | Gets the target element. |

#### Reference

ElementIntersectsElementFilter Class

Autodesk.Revit.DB Namespace