Revit 2026 API

# ReinforcementData Methods

---

The ReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ReinforcementData Class

Autodesk.Revit.DB.Structure Namespace