Revit 2026 API

# AppearanceAssetEditScope Class

---

A scope object that provides special access and limitations related to editing appearance assets and their related elements.

SystemObject Autodesk.Revit.DB.VisualAppearanceAssetEditScope

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AppearanceAssetEditScope : IDisposable
```
```vb
Public Class AppearanceAssetEditScope
	Implements IDisposable
```
```cpp
public ref class AppearanceAssetEditScope : IDisposable
```
```fsharp
type AppearanceAssetEditScope =
    class
        interface IDisposable
    end
```

The AppearanceAssetEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AppearanceAssetEditScope | Constructs a new instance of an AppearanceAssetEditScope. |

|  | Name | Description |
| --- | --- | --- |
|  | IsActive | Identifies if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. |
|  | Commit | Finishes the edit scope. |
|  | Dispose | Releases all resources used by the AppearanceAssetEditScope |
|  | Start | Starts the edit scope. |

You can use an AppearanceAssetEditScope to modify the values of the properties of appearance assets and connected assets (such as bitmaps). The following restrictions apply:

  * A single edit scope is allowed only to edit one top level rendering assets (and its connected assets). To edit more than one appearance asset you must start a different edit scope.
  * An edit scope may be reused for editing another asset, so long as it has been committed or canceled before using start to associate it to a new asset.
  * Multiple changes to the asset are allowed before commit.
  * A transaction must be started before using Commit() on the edited asset. The transaction may be opened before or after the edit scope is started, but must be open to allow the changes into the model.

#### Reference

Autodesk.Revit.DB.Visual Namespace