Revit 2026 API

# CorrectionFactorSetIterator Class

---

An iterator to a correction factor set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalCorrectionFactorSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CorrectionFactorSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CorrectionFactorSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CorrectionFactorSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CorrectionFactorSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CorrectionFactorSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CorrectionFactorSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace