Revit 2026 API

# PaperSize Class

---

An object that represents a Paper Size of Print Setup within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPaperSize

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PaperSize : APIObject
```
```vb
Public Class PaperSize
	Inherits APIObject
```
```cpp
public ref class PaperSize : public APIObject
```
```fsharp
type PaperSize =
    class
        inherit APIObject
    end
```

The PaperSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | Retrieve the paper size name of current project. |

|  | Name | Description |
| --- | --- | --- |

This object derived from the APIObject base object.

#### Reference

Autodesk.Revit.DB Namespace