Revit 2026 API

# LossFactor Methods

---

The LossFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LossFactor derived object. |
|  | Dispose |  |

#### Reference

LossFactor Class

Autodesk.Revit.DB.Lighting Namespace