Revit 2026 API

# EvaluatedParameter Methods

---

The EvaluatedParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AsValueString(Document) | Get the parameter value as a string with units. |
|  | AsValueString(Document, FormatOptions) | Get the parameter value as a string with units. |
|  | Dispose |  |

#### Reference

EvaluatedParameter Class

Autodesk.Revit.DB Namespace