Revit 2026 API

# PipeScheduleType Methods

---

The PipeScheduleType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new pipe schedule type with the given name. |
|  | GetPipeScheduleId | Returns an existing pipe schedule type with the same name. |

#### Reference

PipeScheduleType Class

Autodesk.Revit.DB.Plumbing Namespace