Revit 2026 API

# FabricationServiceSettings Properties

---

The FabricationServiceSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AirFluidType | A special fluid type for fabrication HVAC services. |

#### Reference

FabricationServiceSettings Class

Autodesk.Revit.DB Namespace