Revit 2026 API

# ElementCategoryFilter Properties

---

The ElementCategoryFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | The category id. |

#### Reference

ElementCategoryFilter Class

Autodesk.Revit.DB Namespace