Revit 2026 API

# Toposolid Class

---

An object that represents a Toposolid within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCeilingAndFloor Autodesk.Revit.DBToposolid

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Toposolid : CeilingAndFloor
```
```vb
Public Class Toposolid
	Inherits CeilingAndFloor
```
```cpp
public ref class Toposolid : public CeilingAndFloor
```
```fsharp
type Toposolid =
    class
        inherit CeilingAndFloor
    end
```

The Toposolid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostTopoId | The host Toposolid id of the current Toposolid subdivision. If the object is not a Toposolid subdivision, hostTopoId will be InvalidElementId. |
|  | SketchId | Returns id of the sketch. |

|  | Name | Description |
| --- | --- | --- |
|  | CanBeExcavatedBy | Checks if the given element can be used to excavate the Toposolid. |
|  | Create(Document, IListCurveLoop, ElementId, ElementId) |  |
|  | Create(Document, IListXYZ, ElementId, ElementId) |  |
|  | Create(Document, IListCurveLoop, IListXYZ, ElementId, ElementId) |  |
|  | CreateFromTopographySurface | Creates a Toposolid element from a host TopographySurface, and Toposolid sub-divisions from its subregions. |
|  | CreateSubDivision(Document, IListCurveLoop) |  |
|  | CreateSubDivision(Document, ElementId, IListCurveLoop) |  |
|  | ExcavateBy | Excavates the Toposolid by a given element. |
|  | GetIntersectingElementData | Gets intersection data of all intersecting elements. |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid. |
|  | GetSubDivisionIds | Gets all element ids of Toposolid subdivisions with the current Toposolid as its host. |
|  | IsCutVoidStabilityEnabled | Identifies if the setting for stability of Boolean operations for Toposolid elements is enabled or disabled. |
|  | IsSmoothedSurfaceEnabled | Gets smoothed surface setting of Toposolid. |
|  | RemoveExcavationBy | Removes the excavation between the given element and the Toposolid. |
|  | SetCutVoidStability | Enables or disables the setting for stability of Boolean operations for Toposolid elements. |
|  | SetSmoothedSurface | Sets smoothed surface setting of Toposolid. |
|  | Simplify | Simplifies the Toposolid by reducing the number of inner vertices to the given percentage. |
|  | Split |  |

#### Reference

Autodesk.Revit.DB Namespace