Revit 2026 API

# GeomCombination Class

---

An element created by Join and Cut operations applied to combinable elements in an Autodesk Revit family document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGeomCombination

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GeomCombination : CombinableElement
```
```vb
Public Class GeomCombination
	Inherits CombinableElement
```
```cpp
public ref class GeomCombination : public CombinableElement
```
```fsharp
type GeomCombination =
    class
        inherit CombinableElement
    end
```

The GeomCombination type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllMembers | All elements that are joined in this geometry combination. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace