Revit 2026 API

# ViewScheduleExportOptions Methods

---

The ViewScheduleExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ViewScheduleExportOptions Class

Autodesk.Revit.DB Namespace