Revit 2026 API

# ExternallyTaggedNonBReps Class

---

Holds a collection of ExternallyTaggedNonBRep instances.

SystemObject Autodesk.Revit.DBExternallyTaggedNonBReps

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternallyTaggedNonBReps : IDisposable
```
```vb
Public Class ExternallyTaggedNonBReps
	Implements IDisposable
```
```cpp
public ref class ExternallyTaggedNonBReps : IDisposable
```
```fsharp
type ExternallyTaggedNonBReps =
    class
        interface IDisposable
    end
```

The ExternallyTaggedNonBReps type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternallyTaggedNonBReps | Make a new empty collection of ExternallyTaggedNonBRep instances. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Add | Adds a copy of the input ExternallyTaggedNonBRep to this collection. |
|  | CanAddExternallyTaggedNonBRep | Checks if the input geometry could be added to this collection or not. |
|  | Dispose | Releases all resources used by the ExternallyTaggedNonBReps |

#### Reference

Autodesk.Revit.DB Namespace