Revit 2026 API

# Room Class

---

Provides access to the room topology in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElement Autodesk.Revit.DB.ArchitectureRoom

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Room : SpatialElement
```
```vb
Public Class Room
	Inherits SpatialElement
```
```cpp
public ref class Room : public SpatialElement
```
```fsharp
type Room =
    class
        inherit SpatialElement
    end
```

The Room type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BaseOffset | Get or Set the Base Offset of the Room. |
|  | ClosedShell | Return the closedShell of the Room. |
|  | LimitOffset | Get or Set the Limit Offset of the Room. |
|  | UnboundedHeight | Get the Unbounded Height of the Room. |
|  | UpperLimit | Get or Set the Upper Limit of the Room. |
|  | Volume | Get the Volume of the Room. |

|  | Name | Description |
| --- | --- | --- |
|  | IsPointInRoom | Determines if a point lies within the volume of the room. |
|  | Unplace | Remove the room from its location, but the project still contains the room. The room can be placed in another location after unplaced. |

The room object can be queried for its boundary for use in space planning tools.

#### Reference

Autodesk.Revit.DB.Architecture Namespace