Revit 2026 API

# ExportPatternKey Methods

---

The ExportPatternKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportPatternKey Class

Autodesk.Revit.DB Namespace