Revit 2026 API

# ComboBoxData Properties

---

The ComboBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image shown on the ComboBox. |

#### Reference

ComboBoxData Class

Autodesk.Revit.UI Namespace