Revit 2026 API

# MEPAnalyticalSystem Methods

---

The MEPAnalyticalSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new analytical system |
|  | GetAirSystemData | Returns the air system data, null if not available. |
|  | GetWaterLoopData | Returns the water loop data, null if not available. |

#### Reference

MEPAnalyticalSystem Class

Autodesk.Revit.DB.Mechanical Namespace