Revit 2026 API

# PipePressureDropData Methods

---

The PipePressureDropData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

PipePressureDropData Class

Autodesk.Revit.DB.Plumbing Namespace