Revit 2026 API

# PhotometricWebLightDistribution Properties

---

The PhotometricWebLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PhotometricWebFile | The filename of an IES photometric web file. |
|  | TiltAngle | The tilt angle. |

#### Reference

PhotometricWebLightDistribution Class

Autodesk.Revit.DB.Lighting Namespace