Revit 2026 API

# PathReinforcementType Methods

---

The PathReinforcementType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultPathReinforcementType | Creates a new PathReinforcementType object with a default name. |

#### Reference

PathReinforcementType Class

Autodesk.Revit.DB.Structure Namespace