Revit 2026 API

# LinePatternSegment Methods

---

The LinePatternSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

LinePatternSegment Class

Autodesk.Revit.DB Namespace