Revit 2026 API

# FormArrayIterator Methods

---

The FormArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

FormArrayIterator Class

Autodesk.Revit.DB Namespace