Revit 2026 API

# TopographyLinkType Class

---

This class represents the site file brought into the current Revit document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ArchitectureTopographyLinkType

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TopographyLinkType : ElementType
```
```vb
Public Class TopographyLinkType
	Inherits ElementType
```
```cpp
public ref class TopographyLinkType : public ElementType
```
```fsharp
type TopographyLinkType =
    class
        inherit ElementType
    end
```

The TopographyLinkType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Reload | Loads or reloads the link from its currently-stored location. If the link is an external resource, Revit will contact the IExternalResourceServer to get the latest version of the link. |

#### Reference

Autodesk.Revit.DB.Architecture Namespace