Revit 2026 API

# ViewNode Methods

---

The ViewNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetCameraInfo | Information about the observation point (the camera) of the view. |

#### Reference

ViewNode Class

Autodesk.Revit.DB Namespace