Revit 2026 API

# GBXMLImportOptions Class

---

Import options for Green-Building XML format.

SystemObject Autodesk.Revit.DBGBXMLImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GBXMLImportOptions
```
```vb
Public Class GBXMLImportOptions
```
```cpp
public ref class GBXMLImportOptions
```
```fsharp
type GBXMLImportOptions = class end
```

The GBXMLImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GBXMLImportOptions | Default constructor. Sets all options to their default values. |

|  | Name | Description |
| --- | --- | --- |

Not used currently. Reserved for future use.

#### Reference

Autodesk.Revit.DB Namespace