Revit 2026 API

# IFCExternalServiceUIData Methods

---

The IFCExternalServiceUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetParentHwnd | return the parent handle |
|  | GetRevitElementIds | return the list of revit Element Ids |

#### Reference

IFCExternalServiceUIData Class

Autodesk.Revit.UI Namespace