Revit 2026 API

# TemperatureRatingType Properties

---

The TemperatureRatingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CorrectionFactors | Get all correction factors defined in this temperature rating type and its corresponding material type. |
|  | InsulationTypes | Get all insulation types defined in this temperature rating type and its corresponding material type. |
|  | IsInUse | Indicate whether the temperature rating type is in use. |
|  | MaterialType | Get the material type information which this temperature rating type belongs to. |
|  | Name | Get name of temperature rating type. (Overrides ElementTypeName) |
|  | WireSizes | Get all electrical wire sizes defined in this temperature rating type and its corresponding material type. |

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace