Revit 2026 API

# WireSet Properties

---

The WireSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

WireSet Class

Autodesk.Revit.DB.Electrical Namespace