Revit 2026 API

# AssemblyDifferenceConfiguration Class

---

The two assemblies being compared have different spatial configuration

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceConfiguration

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceConfiguration : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceConfiguration
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceConfiguration : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceConfiguration =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceConfiguration type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Assemblies resulting in this difference might be made up of identical elements, but the elements are not arranged in space relative to each other in the same way.

#### Reference

Autodesk.Revit.DB Namespace