Revit 2026 API

# ReferencePointArrayIterator Properties

---

The ReferencePointArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ReferencePointArrayIterator Class

Autodesk.Revit.DB Namespace