Revit 2026 API

# DetailNurbSpline Class

---

Represents a DetailNurbSpline within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBDetailCurve Autodesk.Revit.DBDetailNurbSpline

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DetailNurbSpline : DetailCurve
```
```vb
Public Class DetailNurbSpline
	Inherits DetailCurve
```
```cpp
public ref class DetailNurbSpline : public DetailCurve
```
```fsharp
type DetailNurbSpline =
    class
        inherit DetailCurve
    end
```

The DetailNurbSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace