Revit 2026 API

# Profile Class

---

A geometric profile consisting of a loop of curves.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBProfile

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Profile : GeometryObject
```
```vb
Public Class Profile
	Inherits GeometryObject
```
```cpp
public ref class Profile : public GeometryObject
```
```fsharp
type Profile =
    class
        inherit GeometryObject
    end
```

The Profile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curves | Retrieve the curves that make up the boundary of the profile. |
|  | Filled | Get or set whether the profile is filled. |
|  | Transformed | Transforms this profile and returns the result. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this profile. |

The profile may be filled.

#### Reference

Autodesk.Revit.DB Namespace