Revit 2026 API

# StructuralConnectionHandler Class

---

An object of Structural Connection Handler.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureStructuralConnectionHandler

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralConnectionHandler : Element
```
```vb
Public Class StructuralConnectionHandler
	Inherits Element
```
```cpp
public ref class StructuralConnectionHandler : public Element
```
```fsharp
type StructuralConnectionHandler =
    class
        inherit Element
    end
```

The StructuralConnectionHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApprovalTypeId | Retrieves or changes approval type of the Structural Connection Handler. |
|  | CodeCheckingStatus | Code checking status of the structural connection. |
|  | OverrideTypeParams | Allow or disallow connection's type parameters to be overridden. |
|  | SingleElementEndIndex | Element end index for single element connections (0: start, 1: end). |

|  | Name | Description |
| --- | --- | --- |
|  | AddElementIds |  |
|  | AddReferences |  |
|  | Create(Document, IListElementId, ElementId) |  |
|  | Create(Document, IListElementId, String) |  |
|  | Create(Document, IListElementId, ElementId, IListConnectionInputPoint) |  |
|  | CreateGenericConnection |  |
|  | GetConnectedElementIds | Retrieves list of element ids of connected elements. |
|  | GetInputPoint | Returns point with specified id. Returns null if specified point does not exist |
|  | GetInputPoints | Returns a list of additional points defining certain connections. |
|  | GetInputReferences | Gets references of input elements. |
|  | GetOrigin | Retrieves origin point of Structural Connection Handler element. |
|  | IsCustom | Checks if Structural Connection Handler has the custom connection style. |
|  | IsDetailed | Checks if Structural Connection Handler has the detailed connection style. |
|  | RemoveElementIds |  |
|  | RemoveReferences |  |
|  | SetDefaultElementOrder | Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut. |

#### Reference

Autodesk.Revit.DB.Structure Namespace