Revit 2026 API

# ElectricalDemandFactorValue Methods

---

The ElectricalDemandFactorValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | SetMaxRangeToUnlimited | Sets the max range on the value to unlimited |

#### Reference

ElectricalDemandFactorValue Class

Autodesk.Revit.DB.Electrical Namespace