Revit 2026 API

# FabricationVersionInfo Class

---

The object contains versioning information about fabrication data.

SystemObject Autodesk.Revit.DBFabricationVersionInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationVersionInfo : IDisposable
```
```vb
Public Class FabricationVersionInfo
	Implements IDisposable
```
```cpp
public ref class FabricationVersionInfo : IDisposable
```
```fsharp
type FabricationVersionInfo =
    class
        interface IDisposable
    end
```

The FabricationVersionInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Reason | The user-specified reason for the change. |
|  | Version | The version number of the change. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationVersionInfo |

#### Reference

Autodesk.Revit.DB Namespace