Revit 2026 API

# VendorIdAttribute Class

---

The custom VendorId attribute for Macros macros use only.

SystemObject SystemAttribute Autodesk.Revit.DB.MacrosVendorIdAttribute

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VendorIdAttribute : Attribute
```
```vb
Public Class VendorIdAttribute
	Inherits Attribute
```
```cpp
public ref class VendorIdAttribute : public Attribute
```
```fsharp
type VendorIdAttribute =
    class
        inherit Attribute
    end
```

The VendorIdAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VendorIdAttribute | Constructs a new VendorIdAttribute. |

|  | Name | Description |
| --- | --- | --- |
|  | Value | AddInId VendorId value. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Macros Namespace