Revit 2026 API

# FileNotFoundException Methods

---

The FileNotFoundException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides IOExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

FileNotFoundException Class

Autodesk.Revit.Exceptions Namespace