Revit 2026 API

# Profile Properties

---

The Profile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curves | Retrieve the curves that make up the boundary of the profile. |
|  | Filled | Get or set whether the profile is filled. |
|  | Transformed | Transforms this profile and returns the result. |

#### Reference

Profile Class

Autodesk.Revit.DB Namespace