Revit 2026 API

# RoofBase Properties

---

The RoofBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EaveCuts | Retrieve or set the EaveCutterType. |
|  | FasciaDepth | Retrieve or set the FasciaDepth. |
|  | RoofType | Retrieve or set the Type. |

#### Reference

RoofBase Class

Autodesk.Revit.DB Namespace