Revit 2026 API

# MechanicalFitting Class

---

A mechanical fitting in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel Autodesk.Revit.DB.MechanicalMechanicalFitting

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MechanicalFitting : MEPModel
```
```vb
Public Class MechanicalFitting
	Inherits MEPModel
```
```cpp
public ref class MechanicalFitting : public MEPModel
```
```fsharp
type MechanicalFitting =
    class
        inherit MEPModel
    end
```

The MechanicalFitting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PartType | The part type of the mechanical fitting. |

|  | Name | Description |
| --- | --- | --- |

The mechanical fitting is only available in the Autodesk Revit MEP product.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace