Revit 2026 API

# RibbonItem Class

---

The RibbonItem object represents an item on RibbonPanel, can be a push-button or a pull-down which should contain the information for creating one RibbonItem.

SystemObject Autodesk.Revit.UIRibbonItem More

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RibbonItem
```
```vb
Public Class RibbonItem
```
```cpp
public ref class RibbonItem
```
```fsharp
type RibbonItem = class end
```

The RibbonItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Enabled | Gets or sets a value indicating whether the item is enabled. |
|  | ItemText | Gets or sets the text displayed on the item. |
|  | ItemType | Gets the item type. |
|  | LongDescription | Long description of the command tooltip |
|  | Name | The name of the item. |
|  | ToolTip | The description that appears as a ToolTip for the item. |
|  | ToolTipImage | The image to show as a part of the button extended tooltip |
|  | Visible | Gets or sets a value indicating whether the item is visible. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetContextualHelp | Gets the contextual help bound with this control. |
|  | SetContextualHelp | Sets the contextual help bound with this button. |

This class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIComboBox Autodesk.Revit.UIComboBoxMember Autodesk.Revit.UIRadioButtonGroup Autodesk.Revit.UIRibbonButton Autodesk.Revit.UITextBox