Revit 2026 API

# RevisionSettings Properties

---

The RevisionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RevisionCloudSpacing | Determines the size in paper space of revision clouds drawn in a project. |
|  | RevisionNumbering | Determines how the revision number values will display on sheets. |

#### Reference

RevisionSettings Class

Autodesk.Revit.DB Namespace