Revit 2026 API

# CurveLoopIterator Methods

---

The CurveLoopIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |

#### Reference

CurveLoopIterator Class

Autodesk.Revit.DB Namespace