Revit 2026 API

# InstanceBinding Class

---

The InstanceBinding object is used to signify a binding between a parameter definition and a parameter on each instance of an element, such as a wall.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBBinding Autodesk.Revit.DBElementBinding Autodesk.Revit.DBInstanceBinding

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InstanceBinding : ElementBinding
```
```vb
Public Class InstanceBinding
	Inherits ElementBinding
```
```cpp
public ref class InstanceBinding : public ElementBinding
```
```fsharp
type InstanceBinding =
    class
        inherit ElementBinding
    end
```

The InstanceBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InstanceBinding | Constructs an empty instance binding. |
|  | InstanceBinding(CategorySet) | Constructs an instance binding with the set of categories passed. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Once bound the parameter will appear on all instance of the element and changing the parameter on any one single instance will not change the value on any other instance.

#### Reference

Autodesk.Revit.DB Namespace