Revit 2026 API

# ParameterMapIterator Methods

---

The ParameterMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the map. |

#### Reference

ParameterMapIterator Class

Autodesk.Revit.DB Namespace