Revit 2026 API

# ProjectPosition Methods

---

The ProjectPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ProjectPosition Class

Autodesk.Revit.DB Namespace