Revit 2026 API

# SKPImportOptions Class

---

The import options used to import SKP format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBSKPImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SKPImportOptions : BaseImportOptions
```
```vb
Public Class SKPImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class SKPImportOptions : public BaseImportOptions
```
```fsharp
type SKPImportOptions =
    class
        inherit BaseImportOptions
    end
```

The SKPImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SKPImportOptions | Constructs a new instance of SKPImportOptions with default values of all properties. |
|  | SKPImportOptions(SKPImportOptions) | Constructs a new instance of SKPImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace