Revit 2026 API

# Solid Class

---

A 3d solid.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBSolid

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Solid : GeometryObject
```
```vb
Public Class Solid
	Inherits GeometryObject
```
```cpp
public ref class Solid : public GeometryObject
```
```fsharp
type Solid =
    class
        inherit GeometryObject
    end
```

The Solid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Edges | The edges that belong to the solid. |
|  | Faces | The faces that belong to the solid. |
|  | SurfaceArea | Returns the total surface area of this solid. |
|  | Volume | Returns the signed volume of this solid. |

|  | Name | Description |
| --- | --- | --- |
|  | ComputeCentroid | Returns the Centroid of this solid. |
|  | GetBoundingBox | Retrieves a box that circumscribes the solid geometry. |
|  | IntersectWithCurve | Calculates and returns the intersection between a curve and this solid. |

A solid is defined by the faces and edges that form its boundary.

#### Reference

Autodesk.Revit.DB Namespace