Revit 2026 API

# ComboBox Methods

---

The ComboBox type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Adds a new item to the ComboBox. |
|  | AddItems |  |
|  | AddSeparator | Adds a separator to the drop-down list. |
|  | GetItems | Gets the copy of a collection of the ComboBoxMembers assigned to the ComboBox. |

#### Reference

ComboBox Class

Autodesk.Revit.UI Namespace