Revit 2026 API

# FileImportingEventArgs Properties

---

The FileImportingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Format | Identifies the import format, e.g. DWG or image. |
|  | Path | Path of the source file which is about to be imported. |

#### Reference

FileImportingEventArgs Class

Autodesk.Revit.DB.Events Namespace