Revit 2026 API

# StructuralConnectionApprovalType Methods

---

The StructuralConnectionApprovalType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new StructuralConnectionApprovalType. |
|  | GetAllStructuralConnectionApprovalTypes |  |
|  | IsValidApprovalTypeName | Verifies if the provided approval name is unique in the document. |

#### Reference

StructuralConnectionApprovalType Class

Autodesk.Revit.DB.Structure Namespace