Revit 2026 API

# WireMaterialTypeSet Properties

---

The WireMaterialTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of wire material types that are in the set. |

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace