Revit 2026 API

# IndexTriangle Properties

---

The IndexTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Index0 | The index of the triangle's first vertex. |
|  | Index1 | The index of the triangle's second vertex. |
|  | Index2 | The index of the triangle's third vertex. |

#### Reference

IndexTriangle Class

Autodesk.Revit.DB.DirectContext3D Namespace