Revit 2026 API

# FabricWireType Methods

---

The FabricWireType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultFabricWireType | Creates a new FabricWireType object with a default name. |

#### Reference

FabricWireType Class

Autodesk.Revit.DB.Structure Namespace