Revit 2026 API

# SweptBlend Methods

---

The SweptBlend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles. |
|  | SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles. |

#### Reference

SweptBlend Class

Autodesk.Revit.DB Namespace