Revit 2026 API

# ReinforcementAbbreviationTag Methods

---

The ReinforcementAbbreviationTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ReinforcementAbbreviationTag Class

Autodesk.Revit.DB.Structure Namespace