Revit 2026 API

# RegenerationFailedException Methods

---

The RegenerationFailedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RegenerationFailedException Class

Autodesk.Revit.Exceptions Namespace