Revit 2026 API

# FilterIntegerRule Properties

---

The FilterIntegerRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

#### Reference

FilterIntegerRule Class

Autodesk.Revit.DB Namespace