Revit 2026 API

# SpotDimension Methods

---

The SpotDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanFlip | Verifies that the direction of the dimension can be flipped. |
|  | Flip | Flips dimension to the other side of the host. |

#### Reference

SpotDimension Class

Autodesk.Revit.DB Namespace