Revit 2026 API

# AppearanceAssetEditScope Methods

---

The AppearanceAssetEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. |
|  | Commit | Finishes the edit scope. |
|  | Dispose |  |
|  | Start | Starts the edit scope. |

#### Reference

AppearanceAssetEditScope Class

Autodesk.Revit.DB.Visual Namespace