Revit 2026 API

# RenderingSettings Class

---

Represents the rendering settings for a 3d view.

SystemObject Autodesk.Revit.DBRenderingSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RenderingSettings : IDisposable
```
```vb
Public Class RenderingSettings
	Implements IDisposable
```
```cpp
public ref class RenderingSettings : IDisposable
```
```fsharp
type RenderingSettings =
    class
        interface IDisposable
    end
```

The RenderingSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BackgroundStyle | The enum value that controls the background style for rendering. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LightingSource | The lighting scheme type. |
|  | PrinterResolution | The resolution level when using printer. |
|  | ResolutionTarget | The resolution target. |
|  | ResolutionValue | The rendering resolution in dots per inch (DPI). |
|  | UsesRegionRendering | The bool value that indicates whether to use region rendering. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RenderingSettings |
|  | GetBackgroundSettings | Returns an object that represents the rendering background settings. |
|  | GetRenderingImageExposureSettings | Returns an object that represents the rendering image exposure settings. |
|  | GetRenderingQualitySettings | Returns an object that represents the rendering quality settings. |
|  | GetRenderingRegionOutline | Returns the outline of the rendering region. |
|  | SetBackgroundSettings | Changes the rendering background settings details for the current background style. |
|  | SetRenderingImageExposureSettings | Changes the rendering image exposure settings. |
|  | SetRenderingQualitySettings | Change rendering quality settings. |

#### Reference

Autodesk.Revit.DB Namespace