Revit 2026 API

# CorrectionFactorSetIterator Methods

---

The CorrectionFactorSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

CorrectionFactorSetIterator Class

Autodesk.Revit.DB.Electrical Namespace