Revit 2026 API

# MenuItem Class

---

An abstract base class that represent a context menu item.

SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UICommandMenuItem Autodesk.Revit.UISeparatorItem Autodesk.Revit.UISubMenuItem

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MenuItem : IDisposable
```
```vb
Public Class MenuItem
	Implements IDisposable
```
```cpp
public ref class MenuItem : IDisposable
```
```fsharp
type MenuItem =
    class
        interface IDisposable
    end
```

The MenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MenuItem |

#### Reference

Autodesk.Revit.UI Namespace