Revit 2026 API

# CurtainGridSet Properties

---

The CurtainGridSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

CurtainGridSet Class

Autodesk.Revit.DB Namespace