Revit 2026 API

# ViewNode Class

---

A render node that represents a view.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBViewNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewNode : RenderNode
```
```vb
Public Class ViewNode
	Inherits RenderNode
```
```cpp
public ref class ViewNode : public RenderNode
```
```fsharp
type ViewNode =
    class
        inherit RenderNode
    end
```

The ViewNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LevelOfDetail | The level of detail the view is going to be rendered at. |
|  | ViewId | The Id of the view element. |

|  | Name | Description |
| --- | --- | --- |
|  | GetCameraInfo | Information about the observation point (the camera) of the view. |

See also: [!:Autodesk::Revit::DB::IExportContext::OnViewBegin].

#### Reference

Autodesk.Revit.DB Namespace