Revit 2026 API

# GradientBackgroundSettings Properties

---

The GradientBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroundColor | The color of the ground. |
|  | HorizonColor | The color of the horizon. |
|  | SkyColor | The color of the top of the sky. |

#### Reference

GradientBackgroundSettings Class

Autodesk.Revit.DB Namespace