Revit 2026 API

# ViewExportedEventArgs Properties

---

The ViewExportedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewId | Identifies the view that was exported. |

#### Reference

ViewExportedEventArgs Class

Autodesk.Revit.DB.Events Namespace