Revit 2026 API

# AssemblyMemberDifferentCategory Properties

---

The AssemblyMemberDifferentCategory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId1 | Category id of the first assembly member |
|  | CategoryId2 | Category id of the second assembly member |

#### Reference

AssemblyMemberDifferentCategory Class

Autodesk.Revit.DB Namespace