Revit 2026 API

# TemperatureRatingTypeSet Methods

---

The TemperatureRatingTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every TemperatureRating type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a TemperatureRating type within the set. |
|  | Erase | Removes a specified TemperatureRating type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified TemperatureRating type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace