Revit 2026 API

# InvalidPathArgumentException Methods

---

The InvalidPathArgumentException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InvalidPathArgumentException Class

Autodesk.Revit.Exceptions Namespace