Revit 2026 API

# IFCGuidKey Class

---

IFCGuidKey is used for case-sensitive comparison of GUID values for maps and sets.

SystemObject Autodesk.Revit.DB.IFCIFCGuidKey

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCGuidKey : IDisposable
```
```vb
Public Class IFCGuidKey
	Implements IDisposable
```
```cpp
public ref class IFCGuidKey : IDisposable
```
```fsharp
type IFCGuidKey =
    class
        interface IDisposable
    end
```

The IFCGuidKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCGuidKey(IFCGuidKey) | IFCGuidKey can be used in managed code as well as unmanaged. |
|  | IFCGuidKey(String) | Constructs a new IFCHybridGuid |

|  | Name | Description |
| --- | --- | --- |
|  | IFCGlobalId | IFC GlobalId for map. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCGuidKey |
|  | Equals | Determines whether this IFCGuidKey is equal to another. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Returns the hash code for this IFCGuidKey (Overrides ObjectGetHashCode) |

#### Reference

Autodesk.Revit.DB.IFC Namespace