Revit 2026 API

# ElementIdParameterValue Class

---

A class that holds a ElementId value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBElementIdParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementIdParameterValue : ParameterValue
```
```vb
Public Class ElementIdParameterValue
	Inherits ParameterValue
```
```cpp
public ref class ElementIdParameterValue : public ParameterValue
```
```fsharp
type ElementIdParameterValue =
    class
        inherit ParameterValue
    end
```

The ElementIdParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementIdParameterValue | Default constructor |
|  | ElementIdParameterValue(ElementId) | Value constructor |

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace