Revit 2026 API

# FamilyPointLocation Properties

---

The FamilyPointLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the corresponding reference point in the Family document. |

#### Reference

FamilyPointLocation Class

Autodesk.Revit.DB Namespace