Revit 2026 API

# FilterCategoryRule Class

---

A filter rule that matches elements of a set of categories.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterCategoryRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterCategoryRule : FilterRule
```
```vb
Public Class FilterCategoryRule
	Inherits FilterRule
```
```cpp
public ref class FilterCategoryRule : public FilterRule
```
```fsharp
type FilterCategoryRule =
    class
        inherit FilterRule
    end
```

The FilterCategoryRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterCategoryRule | Initializes a new instance of the FilterCategoryRule class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AllCategoriesFilterable |  |
|  | GetCategories | Gets the rule's categories. |
|  | SetCategories |  |

#### Reference

Autodesk.Revit.DB Namespace