Revit 2026 API

# StructuralConnectionApprovalType Class

---

A type element that represents a connection approval type.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureStructuralConnectionApprovalType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralConnectionApprovalType : ElementType
```
```vb
Public Class StructuralConnectionApprovalType
	Inherits ElementType
```
```cpp
public ref class StructuralConnectionApprovalType : public ElementType
```
```fsharp
type StructuralConnectionApprovalType =
    class
        inherit ElementType
    end
```

The StructuralConnectionApprovalType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new StructuralConnectionApprovalType. |
|  | GetAllStructuralConnectionApprovalTypes |  |
|  | IsValidApprovalTypeName | Verifies if the provided approval name is unique in the document. |

#### Reference

Autodesk.Revit.DB.Structure Namespace