Revit 2026 API

# FilterNumericValueRule Methods

---

The FilterNumericValueRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. |

#### Reference

FilterNumericValueRule Class

Autodesk.Revit.DB Namespace