Revit 2026 API

# Point Properties

---

The Point type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Coord | Returns the coordinates of the point. |
|  | Reference | Returns a stable reference to the point. |

#### Reference

Point Class

Autodesk.Revit.DB Namespace