Revit 2026 API

# RailingType Class

---

An object supporting management of baluster and post placement within the railing type.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ArchitectureRailingType

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RailingType : ElementType
```
```vb
Public Class RailingType
	Inherits ElementType
```
```cpp
public ref class RailingType : public ElementType
```
```fsharp
type RailingType =
    class
        inherit ElementType
    end
```

The RailingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BalusterPlacement | Accesses the object containing properties related to the baluster placement. |
|  | PrimaryHandrailHeight | The height of the primary handrail. |
|  | PrimaryHandrailLateralOffset | The lateral offset of the primary handrail. |
|  | PrimaryHandRailPosition | The position of the primary handrail. |
|  | PrimaryHandrailType | The type of the primary handrail. |
|  | RailStructure | The NonContinuousRailStructure. |
|  | SecondaryHandrailHeight | The height of the secondary handrail. |
|  | SecondaryHandrailLateralOffset | The lateral offset of the secondary handrail. |
|  | SecondaryHandRailPosition | The position of the secondary handrail. |
|  | SecondaryHandrailType | The type of the secondary handrail. |
|  | TopRailHeight | The height of the top rail in the railing system. |
|  | TopRailType | The type of the top rail in the railing system. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Architecture Namespace