Revit 2026 API

# Space Methods

---

The Space type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPointInSpace | Determines if a point lies within the volume of the Space. |

#### Reference

Space Class

Autodesk.Revit.DB.Mechanical Namespace