Revit 2026 API

# PlanViewRange Class

---

This class represents the view range of a plan view or a plan region. It records the element ids of the levels which a plane is relative to and the offset of each plane from that level.

SystemObject Autodesk.Revit.DBPlanViewRange

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PlanViewRange : IDisposable
```
```vb
Public Class PlanViewRange
	Implements IDisposable
```
```cpp
public ref class PlanViewRange : IDisposable
```
```fsharp
type PlanViewRange =
    class
        interface IDisposable
    end
```

The PlanViewRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | View range for the current plane |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LevelAbove | View range for the level above the specified plane |
|  | LevelBelow | View range for the level below the specified plane |
|  | Unlimited | View range is unlimited |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PlanViewRange |
|  | GetLevelId | Get the element id of the level for a View Depth plane |
|  | GetOffset | Get the offset value associated with a View Depth plane |
|  | SetLevelId | Set the level for a View Depth plane |
|  | SetOffset | Set the offset value associated with a View Depth plane |

#### Reference

Autodesk.Revit.DB Namespace