Revit 2026 API

# HermiteSpline Methods

---

The HermiteSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(IListXYZ, Boolean) |  |
|  | Create(IListXYZ, Boolean, HermiteSplineTangents) |  |

#### Reference

HermiteSpline Class

Autodesk.Revit.DB Namespace