Revit 2026 API

# IFCHybridImport Class

---

Driver for Performing Hybrid Imports.

SystemObject Autodesk.Revit.DB.IFCIFCHybridImport

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCHybridImport : IDisposable
```
```vb
Public Class IFCHybridImport
	Implements IDisposable
```
```cpp
public ref class IFCHybridImport : IDisposable
```
```fsharp
type IFCHybridImport =
    class
        interface IDisposable
    end
```

The IFCHybridImport type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCHybridImport | Constructs a new IFCHybridImport instance for importing IFC via Hybrid method. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateMap |  |
|  | Dispose | Releases all resources used by the IFCHybridImport |
|  | GetIFCStepIdToElementIdMap | Retrieves the association between the original IFC STEP identifiers and the created or updated Elements. |
|  | ImportElements(Document, String) | **Obsolete.** Imports IFC Elements using AnyCAD. |
|  | ImportElements(Document, String, IFCHybridImportOptions) | Imports IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String) | **Obsolete.** Updates IFC Elements using AnyCAD. |
|  | UpdateElements(Document, String, IFCHybridImportOptions) | Updates IFC Elements using AnyCAD. |

#### Reference

Autodesk.Revit.DB.IFC Namespace