Revit 2026 API

# EdgeArrayArray Class

---

An array of edge arrays.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBEdgeArrayArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EdgeArrayArray : APIObject,
	IEnumerable
```
```vb
Public Class EdgeArrayArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class EdgeArrayArray : public APIObject,
	IEnumerable
```
```fsharp
type EdgeArrayArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The EdgeArrayArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EdgeArrayArray | Initializes a new instance of the EdgeArrayArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets an edge array at a specified index within the array. |
|  | Size | Returns the number of edge arrays that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the edge array to the end of the array. |
|  | Clear | Removes every edge array from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified edge array into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace