Revit 2026 API

# LineProperties Methods

---

The LineProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

LineProperties Class

Autodesk.Revit.DB Namespace