Revit 2026 API

# ExportLinetypeKey Class

---

A key used to represent an item stored in an ExportLinetypeTable.

SystemObject Autodesk.Revit.DBExportLinetypeKey

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportLinetypeKey : IDisposable
```
```vb
Public Class ExportLinetypeKey
	Implements IDisposable
```
```cpp
public ref class ExportLinetypeKey : IDisposable
```
```fsharp
type ExportLinetypeKey =
    class
        interface IDisposable
    end
```

The ExportLinetypeKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportLinetypeKey | Constructs a new default ExportLinetypeKey. |
|  | ExportLinetypeKey(ExportLinetypeKey) | Constructs a new copy of the input ExportLinetypeKey object. |
|  | ExportLinetypeKey(String) | Constructs a new default ExportLinetypeKey using the original line type name as input. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalLinetypeName | The original linetype name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportLinetypeKey |

#### Reference

Autodesk.Revit.DB Namespace