Revit 2026 API

# FaceSilhouetteNode Class

---

An output node that represents a Face edge.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBFaceDetailNode Autodesk.Revit.DBFaceSilhouetteNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceSilhouetteNode : FaceDetailNode
```
```vb
Public Class FaceSilhouetteNode
	Inherits FaceDetailNode
```
```cpp
public ref class FaceSilhouetteNode : public FaceDetailNode
```
```fsharp
type FaceSilhouetteNode =
    class
        inherit FaceDetailNode
    end
```

The FaceSilhouetteNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetFace | Returns the Face object corresponding to the node. |

See also: [!:Autodesk::Revit::DB::IExportContext2D::OnFaceSilhouette2D].

#### Reference

Autodesk.Revit.DB Namespace