Revit 2026 API

# WorksetConfiguration Methods

---

The WorksetConfiguration type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Close |  |
|  | Dispose |  |
|  | Open |  |

#### Reference

WorksetConfiguration Class

Autodesk.Revit.DB Namespace