Revit 2026 API

# Asset Properties

---

The Asset type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetType | The type of RenderingAsset |
|  | LibraryName | Library name |
|  | Title | Asset title |

#### Reference

Asset Class

Autodesk.Revit.DB.Visual Namespace