Revit 2026 API

# MEPModel Properties

---

The MEPModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | Retrieves the Connector Manager from this MEPModel. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

#### Reference

MEPModel Class

Autodesk.Revit.DB Namespace