Revit 2026 API

# SpatialElementDomainData Methods

---

The SpatialElementDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SpatialElementDomainData Class

Autodesk.Revit.DB Namespace