Revit 2026 API

# CableTrayType Class

---

This class represents a cable tray type in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBMEPCurveType Autodesk.Revit.DB.ElectricalCableTrayType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CableTrayType : MEPCurveType
```
```vb
Public Class CableTrayType
	Inherits MEPCurveType
```
```cpp
public ref class CableTrayType : public MEPCurveType
```
```fsharp
type CableTrayType =
    class
        inherit MEPCurveType
    end
```

The CableTrayType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendMultiplier | Bend multiplier. |
|  | IsWithFitting | Whether this cable tray type is with fitting |
|  | ShapeType | Shape of this cable tray type. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidBendMultiplier | Identifies if the input bend multiplier is valid. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace