Revit 2026 API

# ElectricalAnalyticalLoadSet Methods

---

The ElectricalAnalyticalLoadSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an electrical analytical load set. |
|  | GetLoadIds | Gets Equipment Load ids in the LoadSet. |

#### Reference

ElectricalAnalyticalLoadSet Class

Autodesk.Revit.DB.Electrical Namespace