Revit 2026 API

# UIControlledApplication Methods

---

The UIControlledApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateAddInCommandBinding |  |
|  | CreateRibbonPanel(String) |  |
|  | CreateRibbonPanel(String, String) |  |
|  | CreateRibbonPanel(Tab, String) |  |
|  | CreateRibbonTab |  |
|  | GetDockablePane |  |
|  | GetRibbonPanels |  |
|  | GetRibbonPanels(String) |  |
|  | GetRibbonPanels(Tab) |  |
|  | LoadAddIn |  |
|  | LoadPackageContents |  |
|  | RegisterContextMenu |  |
|  | RegisterDockablePane |  |
|  | RemoveAddInCommandBinding |  |

#### Reference

UIControlledApplication Class

Autodesk.Revit.UI Namespace