Revit 2026 API

# FailureResolution Class

---

Defines a resolution for a failure.

SystemObject Autodesk.Revit.DBFailureResolution Autodesk.Revit.DBDeleteElements Autodesk.Revit.DBDisableAnalyticalModelCB

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailureResolution : IDisposable
```
```vb
Public Class FailureResolution
	Implements IDisposable
```
```cpp
public ref class FailureResolution : IDisposable
```
```fsharp
type FailureResolution =
    class
        interface IDisposable
    end
```

The FailureResolution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FailureResolution |

A failure could have several permitted resolutions. List of applicable resolution types for the specific failure is defined by the FailureDefinition, actual FailureResolutions are instantiated with the FailureMessage before it is posted. Multiple resolutions per failure are allowed, although Revit UI only uses default resolution.

#### Reference

Autodesk.Revit.DB Namespace