Revit 2026 API

# DoubleArrayIterator Properties

---

The DoubleArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

DoubleArrayIterator Class

Autodesk.Revit.DB Namespace