Revit 2026 API

# SheetCollection Class

---

This class represents a sheet collection in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSheetCollection

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SheetCollection : Element
```
```vb
Public Class SheetCollection
	Inherits Element
```
```cpp
public ref class SheetCollection : public Element
```
```fsharp
type SheetCollection =
    class
        inherit Element
    end
```

The SheetCollection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document) | Creates a new instance of sheet collection with an auto-generated name and adds it to the document. |
|  | Create(Document, String) | Creates a new instance of sheet collection with a specified name and adds it to the document. |

#### Reference

Autodesk.Revit.DB Namespace