Revit 2026 API

# FluidTemperature Methods

---

The FluidTemperature type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FluidTemperature Class

Autodesk.Revit.DB.Plumbing Namespace