Revit 2026 API

# CurveLoopsProfile Properties

---

The CurveLoopsProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Profile | Returns the curve loops of the profile. |

#### Reference

CurveLoopsProfile Class

Autodesk.Revit.DB Namespace