Revit 2026 API

# ViewsExportedByContextEventArgs Methods

---

The ViewsExportedByContextEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetViewIds | Gets the views that were exported by CustomExporter. |

#### Reference

ViewsExportedByContextEventArgs Class

Autodesk.Revit.DB.Events Namespace