Revit 2026 API

# ArgumentsInconsistentException Methods

---

The ArgumentsInconsistentException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ArgumentsInconsistentException Class

Autodesk.Revit.Exceptions Namespace