Revit 2026 API

# Toposolid Methods

---

The Toposolid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanBeExcavatedBy | Checks if the given element can be used to excavate the Toposolid. |
|  | Create(Document, IListCurveLoop, ElementId, ElementId) |  |
|  | Create(Document, IListXYZ, ElementId, ElementId) |  |
|  | Create(Document, IListCurveLoop, IListXYZ, ElementId, ElementId) |  |
|  | CreateFromTopographySurface | Creates a Toposolid element from a host TopographySurface, and Toposolid sub-divisions from its subregions. |
|  | CreateSubDivision(Document, IListCurveLoop) |  |
|  | CreateSubDivision(Document, ElementId, IListCurveLoop) |  |
|  | ExcavateBy | Excavates the Toposolid by a given element. |
|  | GetIntersectingElementData | Gets intersection data of all intersecting elements. |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can be used to add or modify points of this Toposolid. |
|  | GetSubDivisionIds | Gets all element ids of Toposolid subdivisions with the current Toposolid as its host. |
|  | IsCutVoidStabilityEnabled | Identifies if the setting for stability of Boolean operations for Toposolid elements is enabled or disabled. |
|  | IsSmoothedSurfaceEnabled | Gets smoothed surface setting of Toposolid. |
|  | RemoveExcavationBy | Removes the excavation between the given element and the Toposolid. |
|  | SetCutVoidStability | Enables or disables the setting for stability of Boolean operations for Toposolid elements. |
|  | SetSmoothedSurface | Sets smoothed surface setting of Toposolid. |
|  | Simplify | Simplifies the Toposolid by reducing the number of inner vertices to the given percentage. |
|  | Split |  |

#### Reference

Toposolid Class

Autodesk.Revit.DB Namespace