Revit 2026 API

# STEPExportOptions Properties

---

The STEPExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationProtocol | The Application Protocol of the exported STEP file. |
|  | TargetUnit | The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default. |

#### Reference

STEPExportOptions Class

Autodesk.Revit.DB Namespace