Revit 2026 API

# ExtensibleStorageFilter Class

---

A filter used to filter elements with extensible storage data based on specific Schema id.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DB.ExtensibleStorageExtensibleStorageFilter

**Namespace:** Autodesk.Revit.DB.ExtensibleStorage**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExtensibleStorageFilter : ElementQuickFilter
```
```vb
Public Class ExtensibleStorageFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ExtensibleStorageFilter : public ElementQuickFilter
```
```fsharp
type ExtensibleStorageFilter =
    class
        inherit ElementQuickFilter
    end
```

The ExtensibleStorageFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExtensibleStorageFilter | Constructs a new instance of a filter to match elements with extensible storage data based on specific Schema id. |

|  | Name | Description |
| --- | --- | --- |
|  | SchemaGuid | Schema id used to filter elements with extensible storage data |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB.ExtensibleStorage Namespace