Revit 2026 API

# SymbolicCurve Properties

---

The SymbolicCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsDrawnInForeground | Indicates if this curve will be drawn in the foreground of the family instance. |
|  | ReferenceType | Indicates the type of reference. |
|  | Subcategory | The subcategory. |

#### Reference

SymbolicCurve Class

Autodesk.Revit.DB Namespace