Revit 2026 API

# DGNImportOptions Class

---

The import options used to import DGN format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBDGNImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DGNImportOptions : BaseImportOptions
```
```vb
Public Class DGNImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class DGNImportOptions : public BaseImportOptions
```
```fsharp
type DGNImportOptions =
    class
        inherit BaseImportOptions
    end
```

The DGNImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DGNImportOptions | Constructs a new instance of DGNImportOptions with default values of all properties. |
|  | DGNImportOptions(DGNImportOptions) | Constructs a new instance of DGNImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |
|  | DGNModelViewName | The model view name to be imported. Need user give a model view name to specify which model view need to be imported into Revit |
|  | IgnoreUnsupportedElementWarning | If true, ignore warning messages about unsupported elements in the DGN file. If false, the import process is aborted if imported dgn files have unsupported elements. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace