Revit 2026 API

# AnalyticalLinkType Methods

---

The AnalyticalLinkType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidAnalyticalFixityState | Returns whether the input fixity state is valid for Analytical Link Type parameters. |

#### Reference

AnalyticalLinkType Class

Autodesk.Revit.DB.Structure Namespace