Revit 2026 API

# AssetSetIterator Class

---

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.VisualAssetSetIterator

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class AssetSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class AssetSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class AssetSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type AssetSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The AssetSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetSetIterator | Initializes a new instance of the AssetSetIterator class |

|  | Name | Description |
| --- | --- | --- |
|  | Current |  |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext |  |
|  | Reset |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace