Revit 2026 API

# KeynoteEntries Methods

---

The KeynoteEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LoadKeynoteEntriesFromFile | Loads the contents of a keynote text file into the provided KeyBasedTreeEntriesLoadContent. |

#### Reference

KeynoteEntries Class

Autodesk.Revit.DB Namespace