Revit 2026 API

# CurveArrArrayIterator Properties

---

The CurveArrArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CurveArrArrayIterator Class

Autodesk.Revit.DB Namespace