Revit 2026 API

# SpatialElementBoundaryOptions Methods

---

The SpatialElementBoundaryOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SpatialElementBoundaryOptions Class

Autodesk.Revit.DB Namespace