Revit 2026 API

# LoadCombination Class

---

An object that represents a load combination.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureLoadCombination

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LoadCombination : Element
```
```vb
Public Class LoadCombination
	Inherits Element
```
```cpp
public ref class LoadCombination : public Element
```
```fsharp
type LoadCombination =
    class
        inherit Element
    end
```

The LoadCombination type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsThirdPartyGenerated | Indicates if the load combination was created by API. |
|  | State | The state of the load combination. |
|  | Type | The type of the load combination. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, String) | Creates a new default LoadCombination. |
|  | Create(Document, String, LoadCombinationType, LoadCombinationState) | Creates a new LoadCombination. |
|  | GetCaseAndCombinationIds | Returns collection of the load combination case and combination IDs. |
|  | GetComponents | Returns collection of the load combination components. |
|  | GetUsageIds | Returns collection of the load combination usage IDs. |
|  | SetComponents |  |
|  | SetUsageIds |  |

#### Reference

Autodesk.Revit.DB.Structure Namespace