Revit 2026 API

# GeomCombination Properties

---

The GeomCombination type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllMembers | All elements that are joined in this geometry combination. |

#### Reference

GeomCombination Class

Autodesk.Revit.DB Namespace