Revit 2026 API

# BoundaryValidation Class

---

Curve loop validators.

SystemObject Autodesk.Revit.DBBoundaryValidation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundaryValidation : IDisposable
```
```vb
Public Class BoundaryValidation
	Implements IDisposable
```
```cpp
public ref class BoundaryValidation : IDisposable
```
```fsharp
type BoundaryValidation =
    class
        interface IDisposable
    end
```

The BoundaryValidation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BoundaryValidation |
|  | IsValidBoundaryOnSketchPlane |  |
|  | IsValidBoundaryOnView |  |
|  | IsValidHorizontalBoundary |  |

#### Reference

Autodesk.Revit.DB Namespace