Revit 2026 API

# ViewSetIterator Properties

---

The ViewSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ViewSetIterator Class

Autodesk.Revit.DB Namespace