Revit 2026 API

# PointLoad Methods

---

The PointLoad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, AnalyticalElementSelector, XYZ, XYZ, PointLoadType) | Creates a new hosted point load within the project. |
|  | Create(Document, ElementId, XYZ, XYZ, XYZ, PointLoadType) | Creates a new custom hosted point load within the project using data at point. |
|  | IsPointInsideHostBoundaries | Indicates if the point is inside panel's boundaries or if the point is on the member's curve.. |
|  | IsValidHostId | Indicates if the provided host id can host point loads The document containing both the host and the load The id of the analytical element that is about to host a point load True if a point load can be placed on the input host id |

#### Reference

PointLoad Class

Autodesk.Revit.DB.Structure Namespace