Revit 2026 API

# FilterStringRule Methods

---

The FilterStringRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. |

#### Reference

FilterStringRule Class

Autodesk.Revit.DB Namespace