Revit 2026 API

# DirectShapeOptions Methods

---

The DirectShapeOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

DirectShapeOptions Class

Autodesk.Revit.DB Namespace