Revit 2026 API

# RoofType Properties

---

The RoofType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the RoofType |

#### Reference

RoofType Class

Autodesk.Revit.DB Namespace