Revit 2026 API

# AnalyticalOpening Methods

---

The AnalyticalOpening type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of an Analytical Opening within the project. |
|  | IsCurveLoopValidForAnalyticalOpening | Checks if curve loop is valid for Analytical Opening. |

#### Reference

AnalyticalOpening Class

Autodesk.Revit.DB.Structure Namespace