Revit 2026 API

# PlanCircuitSet Class

---

A set that can contain any number of plan circuit objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPlanCircuitSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PlanCircuitSet : APIObject,
	IEnumerable
```
```vb
Public Class PlanCircuitSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class PlanCircuitSet : public APIObject,
	IEnumerable
```
```fsharp
type PlanCircuitSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The PlanCircuitSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PlanCircuitSet | Initializes a new instance of the PlanCircuitSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item from the set, rendering it empty. |
|  | Contains | Tests for the existence of an item within the set. |
|  | Erase | Removes a specified object from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified item into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace