Revit 2026 API

# UpdaterInfo Class

---

Information of an updater, such as: Name, AdditionalInformation, name of the application that owns the updater, etc.

SystemObject Autodesk.Revit.DBUpdaterInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class UpdaterInfo : IDisposable
```
```vb
Public Class UpdaterInfo
	Implements IDisposable
```
```cpp
public ref class UpdaterInfo : IDisposable
```
```fsharp
type UpdaterInfo =
    class
        interface IDisposable
    end
```

The UpdaterInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AdditionalInformation | Additional information about the updater. |
|  | ApplicationName | Name of the application that owns the updater. |
|  | IsOptional | Whether the updater is optional or not. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | UpdaterName | Name of the updater. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the UpdaterInfo |

#### Reference

Autodesk.Revit.DB Namespace