Revit 2026 API

# MEPAnalyticalConnection Methods

---

The MEPAnalyticalConnection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanSupportAnalyticalConnection | Checks if the connector can support the analytical connection. |
|  | Create | Creates a new analytical connection between two open connectors. |
|  | CreateMultipleConnections |  |
|  | GetFlow | Gets the flow value of this analytical connection. |

#### Reference

MEPAnalyticalConnection Class

Autodesk.Revit.DB Namespace