Revit 2026 API

# MullionTypeSet Class

---

A set that contains mullion types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMullionTypeSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MullionTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class MullionTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class MullionTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type MullionTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The MullionTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MullionTypeSet | Initializes a new instance of the MullionTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of mullion types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every mullion type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a mullion type within the set. |
|  | Erase | Removes a specified mullion type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified mullion type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace