Revit 2026 API

# MullionTypeSetIterator Class

---

An iterator to a mullion type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMullionTypeSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class MullionTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class MullionTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class MullionTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type MullionTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The MullionTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MullionTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace