Revit 2026 API

# PointCloudInstance Properties

---

The PointCloudInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterAction | The action taken based on the results of the selection filter applied to this point cloud. |
|  | SupportsOverrides | Identifies whether the instance can have graphic overrides. |

#### Reference

PointCloudInstance Class

Autodesk.Revit.DB Namespace