Revit 2026 API

# ElementLevelFilter Class

---

A filter used to match elements by their associated level.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBElementLevelFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementLevelFilter : ElementSlowFilter
```
```vb
Public Class ElementLevelFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class ElementLevelFilter : public ElementSlowFilter
```
```fsharp
type ElementLevelFilter =
    class
        inherit ElementSlowFilter
    end
```

The ElementLevelFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementLevelFilter(ElementId) | Constructs a new instance of an ElementLevelFilter. |
|  | ElementLevelFilter(ElementId, Boolean) | Constructs a new instance of an ElementLevelFilter, with the option to match all elements not associated to the given level id. |

|  | Name | Description |
| --- | --- | --- |
|  | LevelId | The id of the level that will be matched to elements' associated level. |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace