Revit 2026 API

# DWFImportOptions Class

---

The import options used by importing DWF or DWFx format file.

SystemObject Autodesk.Revit.DBDWFImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DWFImportOptions : IDisposable
```
```vb
Public Class DWFImportOptions
	Implements IDisposable
```
```cpp
public ref class DWFImportOptions : IDisposable
```
```fsharp
type DWFImportOptions =
    class
        interface IDisposable
    end
```

The DWFImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DWFImportOptions(DWFImportOptions) | Constructs a new instance of DWFImportOptions as a copy of the import options. |
|  | DWFImportOptions(IListElementId) | Initializes a new instance of the DWFImportOptions class |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DWFImportOptions |
|  | GetSheetViews | Get sheet views where DWF markups are imported. |
|  | SetSheetViews |  |

#### Reference

Autodesk.Revit.DB Namespace