Revit 2026 API

# DocumentClosedEventArgs Properties

---

The DocumentClosedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DocumentId | Id of the document that has just been closed. |

#### Reference

DocumentClosedEventArgs Class

Autodesk.Revit.DB.Events Namespace