Revit 2026 API

# Segment Class

---

This element represents a segment of an MEP curve object.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSegment Autodesk.Revit.DB.PlumbingPipeSegment

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Segment : Element
```
```vb
Public Class Segment
	Inherits Element
```
```cpp
public ref class Segment : public Element
```
```fsharp
type Segment =
    class
        inherit Element
    end
```

The Segment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Description | The description of the segment. |
|  | MaterialId | The ElementId of the MaterialElem. |
|  | Roughness | The roughness value for given material. |
|  | SizeCount | The number of size objects in the segment. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSize | Adds a new MEPSize to the segment. |
|  | GetSizes | Gets the defined sizes of the segment. |
|  | RemoveSize | Remove the existing MEPSize with this nominal diameter from the segment. |

Currently, only pipe curves can be broken into separate segment elements.

#### Reference

Autodesk.Revit.DB Namespace