Revit 2026 API

# ITemporaryGraphicsHandler Methods

---

The ITemporaryGraphicsHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OnClick | Handles mouse click event on a given temporary graphics object managed by TemporaryGraphicsManager. |

#### Reference

ITemporaryGraphicsHandler Interface

Autodesk.Revit.UI Namespace