Revit 2026 API

# SketchEditScope Class

---

A SketchEditScope allows an application to create and maintain an editing session for a Sketch.

SystemObject Autodesk.Revit.DBEditScope Autodesk.Revit.DBSketchEditScope

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SketchEditScope : EditScope
```
```vb
Public Class SketchEditScope
	Inherits EditScope
```
```cpp
public ref class SketchEditScope : public EditScope
```
```fsharp
type SketchEditScope =
    class
        inherit EditScope
    end
```

The SketchEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchEditScope | Instantiates a SketchEditScope object. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | IsElementWithoutSketch | Validates if an element can have a sketch but currently does not. |
|  | IsSketchEditingSupported | Checks whether sketch can be edited. |
|  | IsSketchEditingSupportedForSketchBasedElement | Checks whether the element supports sketch editing. |
|  | Start | Starts a sketch edit mode. |
|  | StartWithNewSketch | Starts a sketch edit mode for an element which, at this moment, doesn't have a sketch. |

Start/end of a SketchEditScope will start/end a transaction group. After a SketchEditScope is started, an application can start transactions and edit the sketch. Individual transactions the application creates inside SketchEditScope will not appear in the undo menu. All transactions committed during the edit mode will be merged into a single one which will bear the given name passed into SketchEditScope constructor.

#### Reference

Autodesk.Revit.DB Namespace