Revit 2026 API

# TaskDialog Class

---

A task dialog is a dialog box that can be used to display information and receive simple input from the user. It has a common set of controls that are arranged in a standard order to assure consistent look and feel.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.UITaskDialog

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TaskDialog : APIObject
```
```vb
Public Class TaskDialog
	Inherits APIObject
```
```cpp
public ref class TaskDialog : public APIObject
```
```fsharp
type TaskDialog =
    class
        inherit APIObject
    end
```

The TaskDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TaskDialog | Creates a task dialog with title. |

|  | Name | Description |
| --- | --- | --- |
|  | AllowCancellation | Whether the task dialog can be cancelled if no cancel button is specified. |
|  | CommonButtons | The push buttons displayed in the task dialog. |
|  | DefaultButton | The default button for the dialog. |
|  | EnableMarqueeProgressBar | Enables a marquee style progress bar to be displayed in the TaskDialog. |
|  | ExpandedContent | ExpandedContent is hidden by default and will display at the bottom of the task dialog when the "Show details" button is pressed. |
|  | ExtraCheckBoxText | ExtraCheckBoxText is used to label the extra checkbox. |
|  | FooterText | FooterText is used in the footer area of the task dialog. |
|  | Id | The Id of the task dialog. |
|  | MainContent | MainContent is the smaller text that appears just below the main instructions. |
|  | MainIcon | The icon shown in the task dialog. |
|  | MainInstruction | The large primary text that appears at the top of a task dialog. |
|  | Title | Title of the task dialog. |
|  | TitleAutoPrefix | Whether the TaskDialog's title will automatically have the add-in name added as a prefix. |
|  | VerificationText | VerificationText is used to label the verification checkbox. |

|  | Name | Description |
| --- | --- | --- |
|  | AddCommandLink(TaskDialogCommandLinkId, String) | Adds a CommandLink associated to the given id, displaying the indicating main content. |
|  | AddCommandLink(TaskDialogCommandLinkId, String, String) | Adds a CommandLink associated to the given id, displaying the indicating main and supporting content. |
|  | EnableDoNotShowAgain | Enables the "Do not show again" for a task dialog. |
|  | Show | Shows the task dialog. |
|  | Show(String, String) | Shows a task dialog with title, main instruction and a Close button. |
|  | Show(String, String, TaskDialogCommonButtons) | Shows a task dialog with title, main instruction and common buttons. |
|  | Show(String, String, TaskDialogCommonButtons, TaskDialogResult) | Shows a task dialog with title, main instruction, common buttons and default buttons. |
|  | WasExtraCheckBoxChecked | Gets the status of the extra checkbox. |
|  | WasVerificationChecked | Gets the status of the verification checkbox. |

There are two ways to create and show a task dialog to the user. The first option is to construct the TaskDialog, set its properties individually, and use the instance method Show() to show it to the user. The second is to use one of the static Show() methods to construct and show the dialog in one step. When you use the static methods only a subset of the options can be specified.

Please follow Revit standards to create task dialogs. The standards are listed in the remarks of each property or method.

#### Reference

Autodesk.Revit.UI Namespace