Revit 2026 API

# GeomCombinationSet Class

---

A set that contains GeomCombination objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeomCombinationSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GeomCombinationSet : APIObject,
	IEnumerable
```
```vb
Public Class GeomCombinationSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class GeomCombinationSet : public APIObject,
	IEnumerable
```
```fsharp
type GeomCombinationSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The GeomCombinationSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GeomCombinationSet | Initializes a new instance of the GeomCombinationSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of GeomCombinations that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item GeomCombination the set, rendering it empty. |
|  | Contains | Tests for the existence of an GeomCombination within the set. |
|  | Erase | Removes a specified GeomCombination from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified element into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace