Revit 2026 API

# PulldownButtonData Class

---

This class contains information necessary to construct a pulldown button in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIPulldownButtonData Autodesk.Revit.UISplitButtonData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PulldownButtonData : ButtonData
```
```vb
Public Class PulldownButtonData
	Inherits ButtonData
```
```cpp
public ref class PulldownButtonData : public ButtonData
```
```fsharp
type PulldownButtonData =
    class
        inherit ButtonData
    end
```

The PulldownButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PulldownButtonData | Constructs a new instance of PulldownButtonData. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace