Revit 2026 API

# SlabShapeCrease Class

---

Represents a crease of a slab shape edited element.

SystemObject Autodesk.Revit.DBSlabShapeCrease

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SlabShapeCrease : IDisposable
```
```vb
Public Class SlabShapeCrease
	Implements IDisposable
```
```cpp
public ref class SlabShapeCrease : IDisposable
```
```fsharp
type SlabShapeCrease =
    class
        interface IDisposable
    end
```

The SlabShapeCrease type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreaseType | The type of the crease. |
|  | Curve | The geometry of the crease. |
|  | EndPoints | The vertices of the crease. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SlabShapeCrease |

#### Reference

Autodesk.Revit.DB Namespace