Revit 2026 API

# PlanCircuit Methods

---

The PlanCircuit type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetPointInside | Returns a point inside the circuit. |

#### Reference

PlanCircuit Class

Autodesk.Revit.DB Namespace