Revit 2026 API

# RebarBendData Methods

---

The RebarBendData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RebarBendData Class

Autodesk.Revit.DB.Structure Namespace