Revit 2026 API

# EnergyAnalysisDetailModel Class

---

Manage the analytical thermal model.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisEnergyAnalysisDetailModel

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EnergyAnalysisDetailModel : Element
```
```vb
Public Class EnergyAnalysisDetailModel
	Inherits Element
```
```cpp
public ref class EnergyAnalysisDetailModel : public Element
```
```fsharp
type EnergyAnalysisDetailModel =
    class
        inherit Element
    end
```

The EnergyAnalysisDetailModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BuildingTypeId | The building type element. |
|  | ExportCategory | Export elements of this category in energy analysis. |
|  | ExportMullions | Indicates if to specify the setting for exporting mullions. |
|  | IncludeShadingSurfaces | Indicates if to set and get the setting for if shading surfaces should be included. |
|  | SimplifyCurtainSystems | Indicates if to specify the setting for simplified curtain systems. |
|  | Tier | Level of computation for energy analysis model. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new energy analysis detailed model. |
|  | GetAnalyticalOpenings | The collection of analytical openings. |
|  | GetAnalyticalShadingSurfaces | The collection of analytical shading surfaces. |
|  | GetAnalyticalSpaces | The collection of analytical spaces. |
|  | GetAnalyticalSurfaces | The collection of analytical surfaces. |
|  | GetMainEnergyAnalysisDetailModel | Gets the EnergyAnalysisDetailModel in given document. |
|  | TransformModel | Transforms all surfaces in the model according to the document's active ground plane, shared coordinates and true north. |

The Export to gbXML and the Heating and Cooling Loads features produces an analytical thermal model from the physical model of a building. The analytical thermal model is composed of spaces, zones and planar surfaces that represent the actual volumetric elements of the building. If there are currently no EnergyAnalysisDetailModel elements in the document, when the first one is generated it will be considered the persistent energy model (and maybe removed and recreated by actions the user takes in the UI). If there is already a persistent EnergyAnalysisDetailModel element in the document, the API can generate other independent energy models, but they will not be affected by the actions the user takes in the UI. The EnergyAnalysisDetailModel will remain in the document until it is discarded (either by the actions of the user, or by a call to Document.Delete() ).

#### Reference

Autodesk.Revit.DB.Analysis Namespace