Revit 2026 API

# ButtonData Properties

---

The ButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Image | The image of the button. |
|  | LargeImage | The large image of the button. |
|  | Text | The user-visible text of the button. |

#### Reference

ButtonData Class

Autodesk.Revit.UI Namespace