Revit 2026 API

# ContentNode Methods

---

The ContentNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAsset | Returns an an instance of an Asset object, which contains definitions of the content node. |
|  | GetTransform | A transformation matrix associated with the node. |

#### Reference

ContentNode Class

Autodesk.Revit.DB Namespace