Revit 2026 API

# ParameterMapIterator Class

---

An iterator to a map relating a parameter name (the key, a String) to a parameter.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBParameterMapIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ParameterMapIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ParameterMapIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ParameterMapIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ParameterMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ParameterMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ParameterMapIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |
|  | Key | Retrieves the key that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the map. |

#### Reference

Autodesk.Revit.DB Namespace