Revit 2026 API

# FaceArray Class

---

An array that contains faces.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFaceArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceArray : APIObject, IEnumerable
```
```vb
Public Class FaceArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class FaceArray : public APIObject,
	IEnumerable
```
```fsharp
type FaceArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The FaceArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FaceArray | Initializes a new instance of the FaceArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a face at a specified index within the array. |
|  | Size | Returns the number of faces that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the face to the end of the array. |
|  | Clear | Removes every face from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified face into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace