Revit 2026 API

# IndexStreamPoint Methods

---

The IndexStreamPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddPoint | Inserts a IndexPoint into the stream and associated buffer. |
|  | AddPoints |  |

#### Reference

IndexStreamPoint Class

Autodesk.Revit.DB.DirectContext3D Namespace