Revit 2026 API

# ViewExportingEventArgs Properties

---

The ViewExportingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewId | Identifies the view about to be exported. |

#### Reference

ViewExportingEventArgs Class

Autodesk.Revit.DB.Events Namespace