Revit 2026 API

# AssemblyDifferenceMemberDifference Class

---

The two assemblies being compared have different members

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceMemberDifference

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceMemberDifference : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceMemberDifference
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceMemberDifference : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceMemberDifference =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceMemberDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MemberDifference | Difference between the assembly members |
|  | MemberId1 | Id of the member in the first assembly |
|  | MemberId2 | Id of the member in the second assembly |

|  | Name | Description |
| --- | --- | --- |

This difference means that there is a member of the first assembly which is different from the corresponding member of the second assembly. Details about the difference are in memberDifference.

#### Reference

Autodesk.Revit.DB Namespace