Revit 2026 API

# CableTray Class

---

This class represents a cable tray in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DB.ElectricalCableTrayConduitBase Autodesk.Revit.DB.ElectricalCableTray

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CableTray : CableTrayConduitBase
```
```vb
Public Class CableTray
	Inherits CableTrayConduitBase
```
```cpp
public ref class CableTray : public CableTrayConduitBase
```
```fsharp
type CableTray =
    class
        inherit CableTrayConduitBase
    end
```

The CableTray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveNormal | The up-direction vector of the cable tray. |
|  | RungSpace | Distance between two rungs for the ladder cable tray. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of cable tray. |
|  | GetShapeType | Returns the shape type for the cable tray. |
|  | IsValidCableTrayType | Identifies if a cable tray type is valid. |
|  | IsValidRungSpace | Identifies if the input rung space is valid. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace