Revit 2026 API

# SubMenuItem Class

---

A class representing a menu flyout.

SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UISubMenuItem

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SubMenuItem : MenuItem
```
```vb
Public Class SubMenuItem
	Inherits MenuItem
```
```cpp
public ref class SubMenuItem : public MenuItem
```
```fsharp
type SubMenuItem =
    class
        inherit MenuItem
    end
```

The SubMenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SubMenuItem | Initialize the item data. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

To add a child menu, create a new ContextMenu object and add MenuItem on it, pass the child ContextMenu object to SubMenuItem constructor and create SubMenuItem object, use AddItem() method to add the SubMenuItem object to parent ContextMenu.

#### Reference

Autodesk.Revit.UI Namespace