Revit 2026 API

# CategorySet Class

---

A set that can contains Category objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCategorySet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CategorySet : APIObject,
	IEnumerable
```
```vb
Public Class CategorySet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class CategorySet : public APIObject,
	IEnumerable
```
```fsharp
type CategorySet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The CategorySet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategorySet | Initializes a new instance of the CategorySet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of categories that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item from the set, rendering it empty. |
|  | Contains | Tests for the existence of a category within the set. |
|  | Erase | Removes a specified category from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified category into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace