Revit 2026 API

# TransferredProjectStandardsEventArgs Properties

---

The TransferredProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SourceDocument | Source document. |
|  | TargetDocument | Target document. |

#### Reference

TransferredProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace