Revit 2026 API

# IntersectionResultArrayIterator Class

---

An iterator to a array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBIntersectionResultArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class IntersectionResultArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class IntersectionResultArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class IntersectionResultArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type IntersectionResultArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The IntersectionResultArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IntersectionResultArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace