Revit 2026 API

# VoltageType Methods

---

The VoltageType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SetVoltageValue | Assign new values to modify voltage type, all of the unit are volt. |

#### Reference

VoltageType Class

Autodesk.Revit.DB.Electrical Namespace