Revit 2026 API

# ParameterFilterElement Methods

---

The ParameterFilterElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllRuleParametersApplicable(ElementFilter) | Checks that the parameters of the rules used by the given ElementFilter are valid for this filter's categories. |
|  | AllRuleParametersApplicable(Document, ICollectionElementId, ElementFilter) |  |
|  | ClearRules | Removes all rules from this filter. |
|  | Create(Document, String, ICollectionElementId) |  |
|  | Create(Document, String, ICollectionElementId, ElementFilter) |  |
|  | ElementFilterIsAcceptableForParameterFilterElement(ElementFilter) | Checks that an ElementFilter is acceptable for use in defining the filtering rules for a ParameterFilterElement (i.e., for view filtering). |
|  | ElementFilterIsAcceptableForParameterFilterElement(Document, ISetElementId, ElementFilter) |  |
|  | GetCategories | Gets the categories admitted by this filter. |
|  | GetElementFilter | Returns an ElementFilter representing the combination of rules used by this filter. |
|  | GetElementFilterParameters | Retrieves a list of the parameters associated with each rule in the filter. |
|  | GetElementFilterParametersForCategory | Retrieves a list of the parameters associated with all rules in the filter that are combined (using logical AND) with a FilterCategoryRule corresponding to single %categoryId%. |
|  | SetCategories |  |
|  | SetElementFilter | Sets the rules that must be satisfied for a given element to pass this filter. |

#### Reference

ParameterFilterElement Class

Autodesk.Revit.DB Namespace