Revit 2026 API

# AssetPropertyInteger Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyInteger

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyInteger : AssetProperty
```
```vb
Public Class AssetPropertyInteger
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyInteger : public AssetProperty
```
```fsharp
type AssetPropertyInteger =
    class
        inherit AssetProperty
    end
```

The AssetPropertyInteger type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

Autodesk.Revit.DB.Visual Namespace