Revit 2026 API

# LinkOperations Class

---

This class is used to extend the IExternalResourceServer interface with methods to support operations for elements that are LinkTypes.

SystemObject Autodesk.Revit.DBLinkOperations Autodesk.Revit.DBCADLinkOperations Autodesk.Revit.DBRevitLinkOperations

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkOperations : IDisposable
```
```vb
Public Class LinkOperations
	Implements IDisposable
```
```cpp
public ref class LinkOperations : IDisposable
```
```fsharp
type LinkOperations =
    class
        interface IDisposable
    end
```

The LinkOperations type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LinkOperations |
|  | SetOnLocalLinkSharedCoordinatesSavedCallback | Sets the callback that will be called when the Revit user saves new shared coordinate settings to a linked document obtained from an IExternalResourceServer. |

#### Reference

Autodesk.Revit.DB Namespace