Revit 2026 API

# ItemData Class

---

Base class used to contain information necessary to construct RibbonItem and ContextMenuItem

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ItemData : IDisposable
```
```vb
Public Class ItemData
	Implements IDisposable
```
```cpp
public ref class ItemData : IDisposable
```
```fsharp
type ItemData =
    class
        interface IDisposable
    end
```

The ItemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The internal name of the item. |
|  | ToolTip | The tooltip of item. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ItemData |

#### Reference

Autodesk.Revit.UI Namespace