Revit 2026 API

# TriangulationInterfaceForTriangulatedShellComponent Class

---

This class is used to call FacetingUtils::convertTrianglesToQuads with a triangulation defined by a TriangulatedShellComponent.

SystemObject Autodesk.Revit.DBTriangulationInterface Autodesk.Revit.DBTriangulationInterfaceForTriangulatedShellComponent

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TriangulationInterfaceForTriangulatedShellComponent : TriangulationInterface
```
```vb
Public Class TriangulationInterfaceForTriangulatedShellComponent
	Inherits TriangulationInterface
```
```cpp
public ref class TriangulationInterfaceForTriangulatedShellComponent : public TriangulationInterface
```
```fsharp
type TriangulationInterfaceForTriangulatedShellComponent =
    class
        inherit TriangulationInterface
    end
```

The TriangulationInterfaceForTriangulatedShellComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TriangulationInterfaceForTriangulatedShellComponent | Constructs an interface object for a TriangulatedShellComponent. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Compare to TriangulationInterfaceForTriangulatedSolidOrShell, which treats with the entire solid or shell as a single triangulated structure.

#### Reference

Autodesk.Revit.DB Namespace