Revit 2026 API

# WireSizeSet Properties

---

The WireSizeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of wire sizes that are in the set. |

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace