Revit 2026 API

# ReinforcementData Class

---

Abstract class for various reinforcement data

SystemObject Autodesk.Revit.DB.StructureReinforcementData Autodesk.Revit.DB.StructureRebarReinforcementData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReinforcementData : IDisposable
```
```vb
Public Class ReinforcementData
	Implements IDisposable
```
```cpp
public ref class ReinforcementData : IDisposable
```
```fsharp
type ReinforcementData =
    class
        interface IDisposable
    end
```

The ReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ReinforcementData |

#### Reference

Autodesk.Revit.DB.Structure Namespace