Revit 2026 API

# RebarReinforcementData Methods

---

The RebarReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarReinforcementData, or  if the operation fails. |

#### Reference

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace