Revit 2026 API

# AreaReinforcement Class

---

An object that represents an Area Reinforcement within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureAreaReinforcement

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaReinforcement : Element
```
```vb
Public Class AreaReinforcement
	Inherits Element
```
```cpp
public ref class AreaReinforcement : public Element
```
```fsharp
type AreaReinforcement =
    class
        inherit Element
    end
```

The AreaReinforcement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AdditionalBottomCoverOffset | Additional offset from the bottom or interior cover reference. |
|  | AdditionalTopCoverOffset | Additional offset from the top or exterior cover reference. |
|  | AreaReinforcementType | Retrieves the type of the Area Reinforcement. |
|  | Direction | Retrieve the Major Direction of the Area Reinforcement. |

|  | Name | Description |
| --- | --- | --- |
|  | ConvertRebarInSystemToRebars | Converts all RebarInSystem elements owned by the input AreaReinforcement to equivalent Rebar elements. |
|  | Create(Document, Element, XYZ, ElementId, ElementId, ElementId) | Creates a new AreaReinforcement object based on a host boundary. |
|  | Create(Document, Element, IListCurve, XYZ, ElementId, ElementId, ElementId) |  |
|  | GetBoundaryCurveIds | Retrieves the set of curves forming the boundary of the Area Reinforcement. |
|  | GetHostId | The element that contains the Area Reinforcement. |
|  | GetLayerDirection | Gets the direction of the layer. The lines are distributed along this direction. |
|  | GetLineFromLayerAtIndex | Gets the line from the desired layer at the specified index. |
|  | GetMovedLineTransform | Returns a transform representing the movement of the line relative to its default position along the direction of the desired layer. |
|  | GetNumberOfLines | Gets the number of lines on the specified layer. It also counts the excluded ones. |
|  | GetRebarInSystemIds | Returns the ids of the RebarInSystem elements owned by the AreaReinforcement element. |
|  | IsLayerActive | Identifies if the layer is active or not. |
|  | IsLineIncluded | Checks whether the line from the desired layer at the specified position is included or not. |
|  | IsUnobscuredInView | Checks if Area Reinforcement is shown unobscured in a view. |
|  | MoveLine | This method applies the translation to the line from the desired layer, at the specified position. If the line was already moved, the method will concatenate the translation with the existing movement. The line will be translated only along the direction of the specified layer. |
|  | RemoveAreaReinforcementSystem | Deletes the specified AreaReinforcement, and converts its RebarInSystem elements to equivalent Rebar elements. |
|  | ResetMovedLineTransform | Reset the transformation representing the movement of the line relative to its default position along the direction of the specified layer. The moved line transform will be set to Identity. |
|  | SetLayerActive | Sets if the desired layer is active or not. |
|  | SetLineIncluded | Sets if the line from desired layer at the specified position is included or not. |
|  | SetUnobscuredInView | Sets Area Reinforcement to be shown unobscured in a view. |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object. The Area Reinforcement element is available only in the Autodesk Revit Structure product.

#### Reference

Autodesk.Revit.DB.Structure Namespace