Revit 2026 API

# Mullion Class

---

Represents a CurtainGrid within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInstance Autodesk.Revit.DBFamilyInstance Autodesk.Revit.DBMullion

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Mullion : FamilyInstance
```
```vb
Public Class Mullion
	Inherits FamilyInstance
```
```cpp
public ref class Mullion : public FamilyInstance
```
```fsharp
type Mullion =
    class
        inherit FamilyInstance
    end
```

The Mullion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LocationCurve | This method get the curve location of the current Mullion. |
|  | Lock | Get - to get whether the Mullion line is locked. Set - Lock/unlock the Mullion. |
|  | Lockable | Get - to get whether the Mullion can be lock or unlock. |
|  | MullionType | The MullionType style of this Mullion. Get - to access type of mullion Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown. |

|  | Name | Description |
| --- | --- | --- |
|  | BreakMullion | This method is used to break the current Mullion at ends with its neighboring mullions. |
|  | JoinMullion | This method is used to control the join condition the current Mullion with its neighboring mullions. |

#### Reference

Autodesk.Revit.DB Namespace