Revit 2026 API

# LinePattern Methods

---

The LinePattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetSegments | Gets the sequence of segments that defines this line pattern. |
|  | SetSegments |  |

#### Reference

LinePattern Class

Autodesk.Revit.DB Namespace