Revit 2026 API

# RectangleLightShape Properties

---

The RectangleLightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmitLength | The emit length. |
|  | EmitWidth | The emit width. |

#### Reference

RectangleLightShape Class

Autodesk.Revit.DB.Lighting Namespace