Revit 2026 API

# FabricationDimensionDefinition Methods

---

The FabricationDimensionDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FabricationDimensionDefinition Class

Autodesk.Revit.DB Namespace