Revit 2026 API

# IntegerRange Class

---

A class to define a range of a sequence of consecutive integer numbers

SystemObject Autodesk.Revit.DBIntegerRange

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IntegerRange : IDisposable
```
```vb
Public Class IntegerRange
	Implements IDisposable
```
```cpp
public ref class IntegerRange : IDisposable
```
```fsharp
type IntegerRange =
    class
        interface IDisposable
    end
```

The IntegerRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | High | The upper limit of the range |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Low | The lower limit of the range |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IntegerRange |

#### Reference

Autodesk.Revit.DB Namespace