Revit 2026 API

# VertexPositionColored Properties

---

The VertexPositionColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | The vertex's position. |

#### Reference

VertexPositionColored Class

Autodesk.Revit.DB.DirectContext3D Namespace