Revit 2026 API

# FlexPipeType Class

---

A flex pipe type in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBMEPCurveType Autodesk.Revit.DB.PlumbingFlexPipeType

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FlexPipeType : MEPCurveType
```
```vb
Public Class FlexPipeType
	Inherits MEPCurveType
```
```cpp
public ref class FlexPipeType : public MEPCurveType
```
```fsharp
type FlexPipeType =
    class
        inherit MEPCurveType
    end
```

The FlexPipeType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The flex pipe type is only available in the Autodesk Revit MEP product.

#### Reference

Autodesk.Revit.DB.Plumbing Namespace