Revit 2026 API

# PointOnFace Class

---

Define a ReferencePoint relative to a Face.

SystemObject Autodesk.Revit.DBPointElementReference Autodesk.Revit.DBPointOnFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointOnFace : PointElementReference
```
```vb
Public Class PointOnFace
	Inherits PointElementReference
```
```cpp
public ref class PointOnFace : public PointElementReference
```
```fsharp
type PointOnFace =
    class
        inherit PointElementReference
    end
```

The PointOnFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UV | The location of the point in the surface's coordinate system. |

|  | Name | Description |
| --- | --- | --- |
|  | GetFaceReference | Get a copy of the face reference. |
|  | SetFaceReference | Change the face reference. |

A ReferencePoint on a Face has its X and Y basis vectors parallel to the Face, but is free to rotate around its Z basis vector. It must lie on the face (unlike PointOnPlane).

#### Reference

Autodesk.Revit.DB Namespace