Revit 2026 API

# CableTrayConduitBase Class

---

The CableTrayConduitBase class is implemented as the base class for cable tray or conduit

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DB.ElectricalCableTrayConduitBase Autodesk.Revit.DB.ElectricalCableTray Autodesk.Revit.DB.ElectricalConduit

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CableTrayConduitBase : MEPCurve
```
```vb
Public Class CableTrayConduitBase
	Inherits MEPCurve
```
```cpp
public ref class CableTrayConduitBase : public MEPCurve
```
```fsharp
type CableTrayConduitBase =
    class
        inherit MEPCurve
    end
```

The CableTrayConduitBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RunId | The id of the run to which this element belongs. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidEndPoints | Identifies if two end points are valid. |
|  | IsValidLevelId | Identifies if a level id is valid. |
|  | IsWithFitting | Return whether its cable tray/conduit type is with fitting |

#### Reference

Autodesk.Revit.DB.Electrical Namespace