Revit 2026 API

# ViewPosition Properties

---

The ViewPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | Specifies view's position. |
|  | ViewAnchor | Specifies the method by which the view will be positioned on the sheet. Default is set to ViewAnchor.ViewOrigin. |

#### Reference

ViewPosition Class

Autodesk.Revit.DB Namespace