Revit 2026 API

# IRevisionsOnSheetUIServer Methods

---

The IRevisionsOnSheetUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShowDialog | Shows dialog on managing RevisionsOnSheetUI. |

#### Reference

IRevisionsOnSheetUIServer Interface

Autodesk.Revit.UI Namespace