Revit 2026 API

# GroupNode Class

---

A node that represents set of individual elements grouped together in some form, such as an instance of a family or linked Revit file, or an instance of a part of symbol's geometry.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBGroupNode Autodesk.Revit.DBInstanceNode Autodesk.Revit.DBLinkNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GroupNode : RenderNode
```
```vb
Public Class GroupNode
	Inherits RenderNode
```
```cpp
public ref class GroupNode : public RenderNode
```
```fsharp
type GroupNode =
    class
        inherit RenderNode
    end
```

The GroupNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetTransform | A transformation matrix associated with the node. |

#### Reference

Autodesk.Revit.DB Namespace