Revit 2026 API

# CategoryNameMapIterator Properties

---

The CategoryNameMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the category that is the current focus of the iterator. |
|  | Key | Retrieves the category name that is the current focus of the iterator. |

#### Reference

CategoryNameMapIterator Class

Autodesk.Revit.DB Namespace