Revit 2026 API

# ScheduleSortGroupField Methods

---

The ScheduleSortGroupField type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ScheduleSortGroupField Class

Autodesk.Revit.DB Namespace