Revit 2026 API

# AreaTag Class

---

Provides access to the area topology in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElementTag Autodesk.Revit.DBAreaTag

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaTag : SpatialElementTag
```
```vb
Public Class AreaTag
	Inherits SpatialElementTag
```
```cpp
public ref class AreaTag : public SpatialElementTag
```
```fsharp
type AreaTag =
    class
        inherit SpatialElementTag
    end
```

The AreaTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The area that the tag is associated with. |
|  | AreaTagType | The tag type. |

|  | Name | Description |
| --- | --- | --- |

The areaTag object can be queried for its boundary for use in space planning tools.

#### Reference

Autodesk.Revit.DB Namespace