Revit 2026 API

# InstanceNode Methods

---

The InstanceNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSymbolGeometryId | Gets the SymbolGeometryId associated with the node. |

#### Reference

InstanceNode Class

Autodesk.Revit.DB Namespace