Revit 2026 API

# ClassificationEntries Class

---

A collection of ClassificationEntry objects that make up the classification table.

SystemObject Autodesk.Revit.DBKeyBasedTreeEntries Autodesk.Revit.DBClassificationEntries

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ClassificationEntries : KeyBasedTreeEntries
```
```vb
Public Class ClassificationEntries
	Inherits KeyBasedTreeEntries
```
```cpp
public ref class ClassificationEntries : public KeyBasedTreeEntries
```
```fsharp
type ClassificationEntries =
    class
        inherit KeyBasedTreeEntries
    end
```

The ClassificationEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | LoadClassificationEntriesFromFile | Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent. |

#### Reference

Autodesk.Revit.DB Namespace