Revit 2026 API

# ClosestPointsPairBetweenTwoCurves Methods

---

The ClosestPointsPairBetweenTwoCurves type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ClosestPointsPairBetweenTwoCurves Class

Autodesk.Revit.DB Namespace