Revit 2026 API

# SlabShapeVertex Class

---

Represents a vertex of a slab shape edited element.

SystemObject Autodesk.Revit.DBSlabShapeVertex

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SlabShapeVertex : IDisposable
```
```vb
Public Class SlabShapeVertex
	Implements IDisposable
```
```cpp
public ref class SlabShapeVertex : IDisposable
```
```fsharp
type SlabShapeVertex =
    class
        interface IDisposable
    end
```

The SlabShapeVertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Position | The vertex position |
|  | VertexType | The vertex type |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SlabShapeVertex |

#### Reference

Autodesk.Revit.DB Namespace