Revit 2026 API

# CommandMenuItem Class

---

A class representing a single command menu item.

SystemObject Autodesk.Revit.UIMenuItem Autodesk.Revit.UICommandMenuItem

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CommandMenuItem : MenuItem
```
```vb
Public Class CommandMenuItem
	Inherits MenuItem
```
```cpp
public ref class CommandMenuItem : public MenuItem
```
```fsharp
type CommandMenuItem =
    class
        inherit MenuItem
    end
```

The CommandMenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommandMenuItem | Initialize the item data. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | SetAvailabilityClassName | Set availabilityClassName of CommandMenuItem |
|  | SetToolTip | Set toolTip of CommandMenuItem |

To add a menu item that can be executed, implement IExternalCommand interface and pass external command class name to CommandMenuItem constructor, create the CommandMenuItem object and use AddItem() method to add the object to context menu.

#### Reference

Autodesk.Revit.UI Namespace