Revit 2026 API

# LinearDimension Methods

---

The LinearDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |

#### Reference

LinearDimension Class

Autodesk.Revit.DB Namespace