Revit 2026 API

# SlabEdge Class

---

An object that represents a slab edge within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBHostedSweep Autodesk.Revit.DBSlabEdge

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SlabEdge : HostedSweep
```
```vb
Public Class SlabEdge
	Inherits HostedSweep
```
```cpp
public ref class SlabEdge : public HostedSweep
```
```fsharp
type SlabEdge =
    class
        inherit HostedSweep
    end
```

The SlabEdge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SlabEdgeType | Retrieves/set an object that represents the type of the SlabEdge. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSegment | Add segments to the slab edge.(Overrides HostedSweepAddSegment(Reference)) |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

#### Reference

Autodesk.Revit.DB Namespace