Revit 2026 API

# ReferenceArrayArrayIterator Methods

---

The ReferenceArrayArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ReferenceArrayArrayIterator Class

Autodesk.Revit.DB Namespace