Revit 2026 API

# FabricationItemFolder Methods

---

The FabricationItemFolder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetItemFiles | Gets the item files in this item folder. |
|  | GetSubFolders | Gets the item folder's sub folders. |

#### Reference

FabricationItemFolder Class

Autodesk.Revit.DB Namespace