Revit 2026 API

# DirectoryNotFoundException Methods

---

The DirectoryNotFoundException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides IOExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

DirectoryNotFoundException Class

Autodesk.Revit.Exceptions Namespace