Revit 2026 API

# FormatValueOptions Class

---

Options for formatting numbers with units into strings.

SystemObject Autodesk.Revit.DBFormatValueOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FormatValueOptions : IDisposable
```
```vb
Public Class FormatValueOptions
	Implements IDisposable
```
```cpp
public ref class FormatValueOptions : IDisposable
```
```fsharp
type FormatValueOptions =
    class
        interface IDisposable
    end
```

The FormatValueOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FormatValueOptions | Creates a new FormatValueOptions object with default settings. |

|  | Name | Description |
| --- | --- | --- |
|  | AppendUnitSymbol | Indicates if a unit symbol should be appended regardless of the settings in the FormatOptions. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FormatValueOptions |
|  | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
|  | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |

#### Reference

Autodesk.Revit.DB Namespace