Revit 2026 API

# Area Properties

---

The Area type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaScheme | The area scheme. |
|  | IsGrossInterior | The boolean value that indicates whether the area is gross interior. |

#### Reference

Area Class

Autodesk.Revit.DB Namespace