Revit 2026 API

# AssetPropertyUInt64 Class

---

Represents a property of UInt64 value.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyUInt64

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyUInt64 : AssetProperty
```
```vb
Public Class AssetPropertyUInt64
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyUInt64 : public AssetProperty
```
```fsharp
type AssetPropertyUInt64 =
    class
        inherit AssetProperty
    end
```

The AssetPropertyUInt64 type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Visual Namespace