Revit 2026 API

# ScheduleHeightsOnSheet Methods

---

The ScheduleHeightsOnSheet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBodyRowHeights | Returns each row's height of schedule body on sheet view. |

#### Reference

ScheduleHeightsOnSheet Class

Autodesk.Revit.DB Namespace