Revit 2026 API

# CodeCheckingParameterServiceData Methods

---

The CodeCheckingParameterServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |

#### Reference

CodeCheckingParameterServiceData Class

Autodesk.Revit.DB.Structure Namespace