Revit 2026 API

# LayerModifier Methods

---

The LayerModifier type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

LayerModifier Class

Autodesk.Revit.DB Namespace