Revit 2026 API

# MaterialNode Methods

---

The MaterialNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAppearance | Appearance properties associated with the material. |
|  | GetAppearanceOverride | Returns appearance properties that override the preset appearance of the material. |

#### Reference

MaterialNode Class

Autodesk.Revit.DB Namespace