Revit 2026 API

# OpenOptions Methods

---

The OpenOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetOpenWorksetsConfiguration | Gets the object used to configure the worksets to open when the model is opened. |
|  | SetOpenWorksetsConfiguration | Sets the object used to configure the worksets to open when the model is opened. |

#### Reference

OpenOptions Class

Autodesk.Revit.DB Namespace