Revit 2026 API

# VertexIndexPair Class

---

Represents a connection between vertices in the top and bottom profile of a blend.

SystemObject Autodesk.Revit.DBVertexIndexPair

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexIndexPair
```
```vb
Public Class VertexIndexPair
```
```cpp
public ref class VertexIndexPair
```
```fsharp
type VertexIndexPair = class end
```

The VertexIndexPair type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexIndexPair | Initializes a new instance of the VertexIndexPair class |

|  | Name | Description |
| --- | --- | --- |
|  | Bottom | The index of the vertex pair from the bottom profile. |
|  | Top | The index of the vertex pair from the top profile. |

|  | Name | Description |
| --- | --- | --- |

Use objects of this type in GetVertexConnectionMap, SetVertexConnectionMap(VertexIndexPairArray), GetVertexConnectionMap and SetVertexConnectionMap(VertexIndexPairArray) to get/set the vertex connection map.

#### Reference

Autodesk.Revit.DB Namespace