Revit 2026 API

# Macro Class

---

An individual Autodesk Revit Macro which can be executed.

SystemObject Autodesk.Revit.DB.MacrosMacro

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Macro : IDisposable
```
```vb
Public Class Macro
	Implements IDisposable
```
```cpp
public ref class Macro : IDisposable
```
```fsharp
type Macro =
    class
        interface IDisposable
    end
```

The Macro type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MacroModule | The Macro module. |
|  | Name | The macro name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the Macro |
|  | Execute | Executes the macro. |

#### Reference

Autodesk.Revit.DB.Macros Namespace