Revit 2026 API

# SweptBlend Class

---

A swept blend solid or void form.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBSweptBlend

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SweptBlend : GenericForm
```
```vb
Public Class SweptBlend
	Inherits GenericForm
```
```cpp
public ref class SweptBlend : public GenericForm
```
```fsharp
type SweptBlend =
    class
        inherit GenericForm
    end
```

The SweptBlend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BottomProfile | The curves which make up the bottom profile of the sketch. |
|  | BottomProfileSymbol | The bottom family symbol profile of the swept blend. |
|  | BottomSketch | The bottom profile sketch of the swept blend. |
|  | PathSketch | The sketched path for the swept blend. |
|  | SelectedPath | The selected curve used for the swept blend path. |
|  | TopProfile | The curves which make up the top profile of the sketch. |
|  | TopProfileSymbol | The top family symbol profile of the swept blend. |
|  | TopSketch | The top profile sketch of the swept blend. |

|  | Name | Description |
| --- | --- | --- |
|  | GetVertexConnectionMap | Gets the mapping between the vertices in the top and bottom profiles. |
|  | SetVertexConnectionMap | Sets the mapping between the vertices in the top and bottom profiles. |

#### Reference

Autodesk.Revit.DB Namespace