Revit 2026 API

# ClassificationEntries Methods

---

The ClassificationEntries type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LoadClassificationEntriesFromFile | Loads the contents of a classification text file into the provided KeyBasedTreeEntriesLoadContent. |

#### Reference

ClassificationEntries Class

Autodesk.Revit.DB Namespace