Revit 2026 API

# WallSweep Class

---

Represents a wall sweep or reveal.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBWallSweep

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WallSweep : HostObject
```
```vb
Public Class WallSweep
	Inherits HostObject
```
```cpp
public ref class WallSweep : public HostObject
```
```fsharp
type WallSweep =
    class
        inherit HostObject
    end
```

The WallSweep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new wall sweep or reveal. |
|  | GetHostIds | Gets a list of all host walls on which the sweep resides. |
|  | GetWallSweepInfo | Gets the information of the wall sweep or reveal. |
|  | WallAllowsWallSweep | Validates that the wall is of a type that may be a host for a wall sweep or reveal. |

This element may represent either a standalone sweep or reveal element created by the Revit user interface or API, or a "fixed" wall sweep or reveal that was created by the contents of a wall's compound structure.

#### Reference

Autodesk.Revit.DB Namespace