Revit 2026 API

# CurveArrArrayIterator Methods

---

The CurveArrArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

CurveArrArrayIterator Class

Autodesk.Revit.DB Namespace