Revit 2026 API

# GroupType Methods

---

The GroupType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAvailableAttachedDetailGroupTypeIds | Returns the attached detail groups available for this element group type. |
|  | LoadFrom | Replaces the group with the contents of the input file. |

#### Reference

GroupType Class

Autodesk.Revit.DB Namespace