Revit 2026 API

# MEPConnectorInfo Class

---

MEP connector information.

SystemObject Autodesk.Revit.DBMEPConnectorInfo Autodesk.Revit.DBMEPFamilyConnectorInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPConnectorInfo : IDisposable
```
```vb
Public Class MEPConnectorInfo
	Implements IDisposable
```
```cpp
public ref class MEPConnectorInfo : IDisposable
```
```fsharp
type MEPConnectorInfo =
    class
        interface IDisposable
    end
```

The MEPConnectorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPrimary | True if this is the primary connector. |
|  | IsSecondary | True if this is the secondary connector. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LinkedConnector | The linked connector or  if there is no linked connector |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MEPConnectorInfo |

#### Reference

Autodesk.Revit.DB Namespace