Revit 2026 API

# EditScope Methods

---

The EditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. |
|  | Commit | Finishes the edit scope. |
|  | Dispose |  |

#### Reference

EditScope Class

Autodesk.Revit.DB Namespace