Revit 2026 API

# AssemblyCodeTable Methods

---

The AssemblyCodeTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAssemblyCodeTable | Returns the AssemblyCodeTable for the specified document. |

#### Reference

AssemblyCodeTable Class

Autodesk.Revit.DB Namespace