Revit 2026 API

# FaceSplitter Methods

---

The FaceSplitter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundaries | Gets the boundaries. |

#### Reference

FaceSplitter Class

Autodesk.Revit.DB Namespace