Revit 2026 API

# SATExportOptions Methods

---

The SATExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SATExportOptions Class

Autodesk.Revit.DB Namespace