Revit 2026 API

# SpatialElementCalculationPoint Properties

---

The SpatialElementCalculationPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | The position of the "in" spatial element calculation point. |

#### Reference

SpatialElementCalculationPoint Class

Autodesk.Revit.DB Namespace