Revit 2026 API

# MEPModel Methods

---

The MEPModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAssignedElectricalSystems | Retrieves the electrical systems this electrical panel currently is assigned to. |
|  | GetElectricalSystems | Retrieves the electrical systems that are currently created using this MEPModel. |

#### Reference

MEPModel Class

Autodesk.Revit.DB Namespace