Revit 2026 API

# FamilyInstancePlacingArgs Methods

---

The FamilyInstancePlacingArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FamilyInstancePlacingArgs Class

Autodesk.Revit.UI Namespace