Revit 2026 API

# PaperSourceSet Properties

---

The PaperSourceSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

PaperSourceSet Class

Autodesk.Revit.DB Namespace