Revit 2026 API

# ElementMulticategoryFilter Methods

---

The ElementMulticategoryFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetCategoryIds | Gets the category ids assigned to this filter. |

#### Reference

ElementMulticategoryFilter Class

Autodesk.Revit.DB Namespace