Revit 2026 API

# FilterElement Class

---

The base class for filter elements in the document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBFilterElement Autodesk.Revit.DBParameterFilterElement Autodesk.Revit.DBSelectionFilterElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterElement : Element
```
```vb
Public Class FilterElement
	Inherits Element
```
```cpp
public ref class FilterElement : public Element
```
```fsharp
type FilterElement =
    class
        inherit Element
    end
```

The FilterElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | IsNameUnique(String) | Determines whether a potential filter element name is unique. |
|  | IsNameUnique(Document, String) | Determines whether the given name could be applied to a new FilterElement, or if it could not be applied because the name is already in use. |

#### Reference

Autodesk.Revit.DB Namespace