Revit 2026 API

# RebarShapeConstraintProjectedSegmentLength Methods

---

The RebarShapeConstraintProjectedSegmentLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |

#### Reference

RebarShapeConstraintProjectedSegmentLength Class

Autodesk.Revit.DB.Structure Namespace