Revit 2026 API

# ReloadSwapOutInfo Methods

---

The ReloadSwapOutInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ReloadSwapOutInfo Class

Autodesk.Revit.DB Namespace