Revit 2026 API

# DoubleClickOptions Class

---

Provides access to settings that control what happens when the current user double-clicks on an element.

SystemObject Autodesk.Revit.UIDoubleClickOptions

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DoubleClickOptions : IDisposable
```
```vb
Public Class DoubleClickOptions
	Implements IDisposable
```
```cpp
public ref class DoubleClickOptions : IDisposable
```
```fsharp
type DoubleClickOptions =
    class
        interface IDisposable
    end
```

The DoubleClickOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DoubleClickOptions |
|  | GetAction | Returns the active user's desired action for a particular double-click target. |
|  | GetDoubleClickOptions | Returns the current user's DoubleClickOptions. |
|  | GetRenameOnSlowDoubleClickInProjectBrowser | Returns the user's desire to rename item in project browser on slow double-click. |
|  | IsSupportedAction | Checks whether the specified double-click target supports the specified action. |
|  | SetAction | Changes the double-click action associated with a specified target. |
|  | SetRenameOnSlowDoubleClickInProjectBrowser | Sets whether the desired action is to rename item in project browser on slow double-click. |

These settings are stored on a per-user basis. Revit will follow these settings for all projects and families for this user.

#### Reference

Autodesk.Revit.UI Namespace