Revit 2026 API

# NurbsSurfaceData Methods

---

The NurbsSurfaceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | Dispose |  |
|  | GetControlPoint | Get the list of control points. |
|  | GetControlPoints | Get the list of control points. |
|  | GetKnotsU | Get the list of knots in the u-direction. |
|  | GetKnotsV | Get the list of knots in the v-direction. |
|  | GetKnotU | Get the knot in the u-direction. |
|  | GetKnotV | Get the knot in the v-direction. |
|  | GetNumberOfControlPoints | Get the number of control points. |
|  | GetNumberOfKnotsU | Get the number of knots in the u-direction. |
|  | GetNumberOfKnotsV | Get the number of knots in the v-direction. |
|  | GetNumberOfWeights | Get the number of weights. |
|  | GetWeight | Get the weight. |
|  | GetWeights | Get the list of weights. |
|  | IsValid | Check if the object contains a valid NurbsSurfaceData. |

#### Reference

NurbsSurfaceData Class

Autodesk.Revit.DB Namespace