Revit 2026 API

# LinkNode Class

---

An output node that represents a linked Revit document.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBGroupNode Autodesk.Revit.DBLinkNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinkNode : GroupNode
```
```vb
Public Class LinkNode
	Inherits GroupNode
```
```cpp
public ref class LinkNode : public GroupNode
```
```fsharp
type LinkNode =
    class
        inherit GroupNode
    end
```

The LinkNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SymbolId | Identifies the Id of the symbol associated with the node. |

|  | Name | Description |
| --- | --- | --- |
|  | GetDocument | Returns the document associated with the link. |

See also: [!:Autodesk::Revit::DB::IExportContext::OnLinkBegin].

#### Reference

Autodesk.Revit.DB Namespace