Revit 2026 API

# MEPAnalyticalSegment Methods

---

The MEPAnalyticalSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetFlowCharacteristics | Gets all flow characteristics of the segment. |
|  | GetFlowConvergenceCharacteristic | Gets the flow convergence characteristic of the segment. |
|  | GetFlowTransitionCharacteristic | Gets the flow transition characteristic of the segment. |
|  | GetLossCoefficientOverride | Gets the overridden value of loss coefficient, dimensionless. |
|  | GetNetworkSegmentId | Gets the NetworkSegmentId. |
|  | GetPressureDropOverride | Gets the overidden value of pressuer drop, in kg/(ft*s^2). |
|  | IsSegmentOverridable | Verifies if the segment can be overridden (e.g., the pressure drop of the pump and curve segments are calculated from the network and cannot be overridden). |
|  | SetLossCoefficientOverride | Sets the overridden value of loss coefficient. |
|  | SetOverrideType | Sets the override type of pressure loss calculation. |
|  | SetPressureDropOverride | Sets the overridden value of pressure drop. |

#### Reference

MEPAnalyticalSegment Class

Autodesk.Revit.DB.Analysis Namespace