Revit 2026 API

# CorrectionFactorSet Methods

---

The CorrectionFactorSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every correction factor from the set, rendering it empty. |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

CorrectionFactorSet Class

Autodesk.Revit.DB.Electrical Namespace