Revit 2026 API

# PipeFittingAndAccessoryPressureDropItem Methods

---

The PipeFittingAndAccessoryPressureDropItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

PipeFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Plumbing Namespace