Revit 2026 API

# CitySet Class

---

An set that contains cities.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCitySet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CitySet : APIObject, IEnumerable
```
```vb
Public Class CitySet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class CitySet : public APIObject,
	IEnumerable
```
```fsharp
type CitySet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The CitySet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CitySet | Initializes a new instance of the CitySet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of cities that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every city from the set, rendering it empty. |
|  | Contains | Tests for the existence of a city within the set. |
|  | Erase | Removes a specified city from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified city into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace