Revit 2026 API

# DuctFittingAndAccessoryPressureDropUIData Methods

---

The DuctFittingAndAccessoryPressureDropUIData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetUIDataItems | Gets all UI data items stored in the UI data. |
|  | GetUnits | Gets units. |

#### Reference

DuctFittingAndAccessoryPressureDropUIData Class

Autodesk.Revit.UI.Mechanical Namespace