Revit 2026 API

# ElectricalAnalyticalNode Properties

---

The ElectricalAnalyticalNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NodeType | The type of electrical analytical node. |
|  | TotalLoad | The Total Connected Load. |

#### Reference

ElectricalAnalyticalNode Class

Autodesk.Revit.DB.Electrical Namespace