Revit 2026 API

# GroundConductorSizeSet Methods

---

The GroundConductorSizeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every GroundConductorSize from the set, rendering it empty. |
|  | Contains | Tests for the existence of a GroundConductorSize within the set. |
|  | Erase | Removes a specified GroundConductorSize from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified GroundConductorSize into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace