Revit 2026 API

# AnalyticalModelSelector Methods

---

The AnalyticalModelSelector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

AnalyticalModelSelector Class

Autodesk.Revit.DB.Structure Namespace