Revit 2026 API

# RevisionsOnSheetUIServiceData Class

---

UI data wrapper for RevisionsOnSheetUIService.

SystemObject Autodesk.Revit.UIRevisionsOnSheetUIServiceData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RevisionsOnSheetUIServiceData : IDisposable
```
```vb
Public Class RevisionsOnSheetUIServiceData
	Implements IDisposable
```
```cpp
public ref class RevisionsOnSheetUIServiceData : IDisposable
```
```fsharp
type RevisionsOnSheetUIServiceData =
    class
        interface IDisposable
    end
```

The RevisionsOnSheetUIServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | return the document |
|  | IsReset | flag to indicate the value has been reset |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ParamId | the parameter id |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RevisionsOnSheetUIServiceData |
|  | GetParentHwnd | return the parent handle |
|  | GetRevitElementIds | return the list of revit Element Ids |

#### Reference

Autodesk.Revit.UI Namespace