Revit 2026 API

# GroundConductorSize Class

---

**Note: This API is now obsolete.**

Represents electrical ground conductor size definition information.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalGroundConductorSize

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")]
public class GroundConductorSize : APIObject
```
```vb
<ObsoleteAttribute("GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")>
Public Class GroundConductorSize
	Inherits APIObject
```
```cpp
[ObsoleteAttribute(L"GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")]
public ref class GroundConductorSize : public APIObject
```
```fsharp
[<ObsoleteAttribute("GroundConductorSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by GroundConductorSize properly during document upgrade.")>]
type GroundConductorSize =
    class
        inherit APIObject
    end
```

The GroundConductorSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Ampacity | Get ampacity which is used for specifying size, the unit is ampere. |
|  | ConductorSize | Get conductor size corresponding to specific ampacity. |
|  | MaterialBelongTo | Get the material type which include this ground conductor size information. |

|  | Name | Description |
| --- | --- | --- |

Ground conductor size is defined based on corresponding wire material type.

#### Reference

Autodesk.Revit.DB.Electrical Namespace