Revit 2026 API

# ApplicationEntryPoint Methods

---

The ApplicationEntryPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FinishInitializationEO | For Revit Macros internal use only. |
|  | Initialize | For Revit Macros internal use only. |
|  | OnShutdownEO | For Revit Macros internal use only. |

#### Reference

ApplicationEntryPoint Class

Autodesk.Revit.DB.Macros Namespace