Revit 2026 API

# CurveIntersectResult Methods

---

The CurveIntersectResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetOverlaps | Gets information about the points shared between the two curves. |

#### Reference

CurveIntersectResult Class

Autodesk.Revit.DB Namespace