Revit 2026 API

# SSEPointVisibilitySettings Methods

---

The SSEPointVisibilitySettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the SSE point visibility for the given category. |
|  | SetVisibility | Sets the SSE point visibility for the given category. |

#### Reference

SSEPointVisibilitySettings Class

Autodesk.Revit.DB Namespace