Revit 2026 API

# IFCFileWriteOptions Class

---

This class contains options to write an IFC file.

SystemObject Autodesk.Revit.DB.IFCIFCFileWriteOptions

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCFileWriteOptions : IDisposable
```
```vb
Public Class IFCFileWriteOptions
	Implements IDisposable
```
```cpp
public ref class IFCFileWriteOptions : IDisposable
```
```fsharp
type IFCFileWriteOptions =
    class
        interface IDisposable
    end
```

The IFCFileWriteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCFileWriteOptions | Creates a default IFCFileWriteOptions. The default file format is ifc. |

|  | Name | Description |
| --- | --- | --- |
|  | FileFormat | The file format of the IFC file. |
|  | FileName | The full file name of the IFC file to be written. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCFileWriteOptions |

#### Reference

Autodesk.Revit.DB.IFC Namespace