Revit 2026 API

# AnalyticalLinkType Class

---

An object that specifies the analysis properties for an AnalyticalLink element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureAnalyticalLinkType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalyticalLinkType : ElementType
```
```vb
Public Class AnalyticalLinkType
	Inherits ElementType
```
```cpp
public ref class AnalyticalLinkType : public ElementType
```
```fsharp
type AnalyticalLinkType =
    class
        inherit ElementType
    end
```

The AnalyticalLinkType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RotationX | Fixity of rotation around X. |
|  | RotationY | Fixity of rotation around Y. |
|  | RotationZ | Fixity of rotation around Z. |
|  | TranslationX | Fixity of translation along X. |
|  | TranslationY | Fixity of translation along Y. |
|  | TranslationZ | Fixity of translation along Z. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidAnalyticalFixityState | Returns whether the input fixity state is valid for Analytical Link Type parameters. |

#### Reference

Autodesk.Revit.DB.Structure Namespace