Revit 2026 API

# AnalysisDisplayColorSettings Class

---

Contains color settings for analysis display style element.

SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayColorSettings

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayColorSettings : IDisposable
```
```vb
Public Class AnalysisDisplayColorSettings
	Implements IDisposable
```
```cpp
public ref class AnalysisDisplayColorSettings : IDisposable
```
```fsharp
type AnalysisDisplayColorSettings =
    class
        interface IDisposable
    end
```

The AnalysisDisplayColorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayColorSettings | Constructs a default instance of color settings. |
|  | AnalysisDisplayColorSettings(AnalysisDisplayColorSettings) | Constructs a new copy of the input AnalysisDisplayColorSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | ColorSettingsType | Stores type of color settings |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MaxColor | Color assigned to the maximum value. |
|  | MinColor | Color assigned to the minimum value. |

|  | Name | Description |
| --- | --- | --- |
|  | AreIntermediateColorsValid |  |
|  | Colors | Get number of colors, including min, max and intermediate. |
|  | Dispose | Releases all resources used by the AnalysisDisplayColorSettings |
|  | GetIntermediateColors | Get intermediate color entries (other than the minimum and maximum settings). |
|  | IsEqual | Compares two color settings objects. |
|  | SetIntermediateColors |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace