Revit 2026 API

# InsulationLiningBase Class

---

Acts as the base class for duct insulation, pipe insulation and duct lining elements.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DBInsulationLiningBase Autodesk.Revit.DB.MechanicalDuctInsulation Autodesk.Revit.DB.MechanicalDuctLining Autodesk.Revit.DB.PlumbingPipeInsulation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class InsulationLiningBase : MEPCurve
```
```vb
Public Class InsulationLiningBase
	Inherits MEPCurve
```
```cpp
public ref class InsulationLiningBase : public MEPCurve
```
```fsharp
type InsulationLiningBase =
    class
        inherit MEPCurve
    end
```

The InsulationLiningBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostElementId | The id of the host element for the insulation or lining element. |
|  | Thickness | Thickness of the insulation or lining element. |

|  | Name | Description |
| --- | --- | --- |
|  | GetInsulationIds | Returns the ids of the insulation elements associated to a given element. |
|  | GetLiningIds | Returns the ids of the lining elements associated to a given element. |
|  | IsValidThickness | Identifies if the given thickness value is valid for assignment to insulation or lining elements. |

#### Reference

Autodesk.Revit.DB Namespace