Revit 2026 API

# CombinableElement Properties

---

The CombinableElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Combinations | The geometry combinations that this element belongs to. |

#### Reference

CombinableElement Class

Autodesk.Revit.DB Namespace