Revit 2026 API

# DuplicateTypeNamesHandlerArgs Class

---

A structure that provides information about an attempt to copy types with names that already exist in the destination document.

SystemObject Autodesk.Revit.DBDuplicateTypeNamesHandlerArgs

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuplicateTypeNamesHandlerArgs : IDisposable
```
```vb
Public Class DuplicateTypeNamesHandlerArgs
	Implements IDisposable
```
```cpp
public ref class DuplicateTypeNamesHandlerArgs : IDisposable
```
```fsharp
type DuplicateTypeNamesHandlerArgs =
    class
        interface IDisposable
    end
```

The DuplicateTypeNamesHandlerArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document that contains the types with duplicate names. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DuplicateTypeNamesHandlerArgs |
|  | GetTypeIds | Returns ids of the types with duplicate names. |

#### Reference

Autodesk.Revit.DB Namespace