Revit 2026 API

# BaseArray Methods

---

The BaseArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetCopiedMemberIds | Retrieves the copied member Ids of the Array. |
|  | GetOriginalMemberIds | Retrieves the original member Ids of the Array. |

#### Reference

BaseArray Class

Autodesk.Revit.DB Namespace