Revit 2026 API

# LinePatternSegment Class

---

Represents a segment in a line pattern.

SystemObject Autodesk.Revit.DBLinePatternSegment

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinePatternSegment : IDisposable
```
```vb
Public Class LinePatternSegment
	Implements IDisposable
```
```cpp
public ref class LinePatternSegment : IDisposable
```
```fsharp
type LinePatternSegment =
    class
        interface IDisposable
    end
```

The LinePatternSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LinePatternSegment | Creates a line pattern segment. |
|  | LinePatternSegment(LinePatternSegmentType, Double) | Creates a line pattern segment with given type and length. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Length | Gets and sets the length of the segment. |
|  | Type | Gets and sets the type of the segment. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LinePatternSegment |

#### Reference

Autodesk.Revit.DB Namespace