Revit 2026 API

# DocumentClosingEventArgs Properties

---

The DocumentClosingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DocumentId | Id of the document that is about to be closed. |

#### Reference

DocumentClosingEventArgs Class

Autodesk.Revit.DB.Events Namespace