Revit 2026 API

# RebarContainerType Class

---

Represents a Rebar Container Type, used in the generation of Rebar Container.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureRebarContainerType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarContainerType : ElementType
```
```vb
Public Class RebarContainerType
	Inherits ElementType
```
```cpp
public ref class RebarContainerType : public ElementType
```
```fsharp
type RebarContainerType =
    class
        inherit ElementType
    end
```

The RebarContainerType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultRebarContainerType | Creates a new RebarContainerType object with a default name. |
|  | GetOrCreateRebarContainerType | Creates or returns a RebarContainerType object with a given name. |

#### Reference

Autodesk.Revit.DB.Structure Namespace