Revit 2026 API

# DoubleArrayIterator Methods

---

The DoubleArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

DoubleArrayIterator Class

Autodesk.Revit.DB Namespace