Revit 2026 API

# FormulaEditingEventArgs Methods

---

The FormulaEditingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Apply | Applies formula to the parameter |

#### Reference

FormulaEditingEventArgs Class

Autodesk.Revit.UI.Events Namespace