Revit 2026 API

# FieldDomainPoints Methods

---

The FieldDomainPoints type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FieldDomainPoints Class

Autodesk.Revit.DB.Analysis Namespace