Revit 2026 API

# DefinitionBindingMapIterator Methods

---

The DefinitionBindingMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the map. |

#### Reference

DefinitionBindingMapIterator Class

Autodesk.Revit.DB Namespace