Revit 2026 API

# AssetPropertyFloatArray Methods

---

The AssetPropertyFloatArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetValue | Get the value of the property. |

#### Reference

AssetPropertyFloatArray Class

Autodesk.Revit.DB.Visual Namespace