Revit 2026 API

# IndexStream Methods

---

The IndexStream type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IndexStream Class

Autodesk.Revit.DB.DirectContext3D Namespace