Revit 2026 API

# InternalOrigin Properties

---

The InternalOrigin type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Position | The position of the InternalOrigin. |
|  | SharedPosition | The position of the InternalOrigin relative to the active ProjectLocation set for the document. |

#### Reference

InternalOrigin Class

Autodesk.Revit.DB Namespace