Revit 2026 API

# RenderingImageExposureSettings Class

---

Represents the exposure settings of rendering.

SystemObject Autodesk.Revit.DBRenderingImageExposureSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RenderingImageExposureSettings : IDisposable
```
```vb
Public Class RenderingImageExposureSettings
	Implements IDisposable
```
```cpp
public ref class RenderingImageExposureSettings : IDisposable
```
```fsharp
type RenderingImageExposureSettings =
    class
        interface IDisposable
    end
```

The RenderingImageExposureSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExposureValue | The value of rendering image exposure. |
|  | Highlights | The highlights value. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Saturation | The value of rendering image saturation. |
|  | Shadows | The shadows value. |
|  | WhitePoint | The white point value. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RenderingImageExposureSettings |

#### Reference

Autodesk.Revit.DB Namespace