Revit 2026 API

# ExternalDefinition Methods

---

The ExternalDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetGroupTypeId | Returns the identifier of the parameter definition's parameter group. (Overrides DefinitionGetGroupTypeId) |

#### Reference

ExternalDefinition Class

Autodesk.Revit.DB Namespace