Revit 2026 API

# ParameterSetIterator Methods

---

The ParameterSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

ParameterSetIterator Class

Autodesk.Revit.DB Namespace