Revit 2026 API

# Floor Properties

---

The Floor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FloorType | Retrieves/sets an object that represents the type of the floor. |
|  | SketchId | Returns id of the sketch. |
|  | SpanDirectionAngle | Retrieve the span direction angle of the floor. |

#### Reference

Floor Class

Autodesk.Revit.DB Namespace