Revit 2026 API

# AnalysisDisplayColorEntry Methods

---

The AnalysisDisplayColorEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | HasValue | Check if color entry has associated value. |
|  | IsEqual | Compare color entries. |

#### Reference

AnalysisDisplayColorEntry Class

Autodesk.Revit.DB.Analysis Namespace