Revit 2026 API

# IStructuralSectionsServer Methods

---

The IStructuralSectionsServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralSectionsUpdate | The server's method that will be called when Revit User clicks the Section Type parameter's button in the family dialog. |

#### Reference

IStructuralSectionsServer Interface

Autodesk.Revit.DB.Structure Namespace