Revit 2026 API

# SlabShapeCreaseArrayIterator Properties

---

The SlabShapeCreaseArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

SlabShapeCreaseArrayIterator Class

Autodesk.Revit.DB Namespace