Revit 2026 API

# RevitAPIPreDocEventArgs Properties

---

The RevitAPIPreDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document associated with the event. |

#### Reference

RevitAPIPreDocEventArgs Class

Autodesk.Revit.DB.Events Namespace