Revit 2026 API

# DockablePaneId Class

---

Identifier for a pane that participates in the Revit docking window system.

SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.UIDockablePaneId

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DockablePaneId : GuidEnum
```
```vb
Public Class DockablePaneId
	Inherits GuidEnum
```
```cpp
public ref class DockablePaneId : public GuidEnum
```
```fsharp
type DockablePaneId =
    class
        inherit GuidEnum
    end
```

The DockablePaneId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DockablePaneId | Creates a new DockablePaneId instance. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(DockablePaneId, DockablePaneId) | Compares two DockablePaneId instances. |
|  | Inequality(DockablePaneId, DockablePaneId) | Compares two DockablePaneId instances. |

#### Reference

Autodesk.Revit.UI Namespace