Revit 2026 API

# FamilyStructuralMaterialTypeFilter Class

---

A filter used to match families that have the given structural material type.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DB.StructureFamilyStructuralMaterialTypeFilter

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyStructuralMaterialTypeFilter : ElementSlowFilter
```
```vb
Public Class FamilyStructuralMaterialTypeFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class FamilyStructuralMaterialTypeFilter : public ElementSlowFilter
```
```fsharp
type FamilyStructuralMaterialTypeFilter =
    class
        inherit ElementSlowFilter
    end
```

The FamilyStructuralMaterialTypeFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyStructuralMaterialTypeFilter(StructuralMaterialType) | Constructs a new instance of a filter to match families that have the given structural material type. |
|  | FamilyStructuralMaterialTypeFilter(StructuralMaterialType, Boolean) | Constructs a new instance of a filter to match families by structural material type, with the option to match all families which are not of the given structural material type. |

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialType | The family structural material type. |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB.Structure Namespace