Revit 2026 API

# PanelScheduleSheetInstance Properties

---

The PanelScheduleSheetInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Origin | The sheet instance offset in drawing sheet coordinates. |
|  | ScheduleId | The panel schedule id. |

#### Reference

PanelScheduleSheetInstance Class

Autodesk.Revit.DB.Electrical Namespace