Revit 2026 API

# RevolvedFace Properties

---

The RevolvedFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | Curve | Profile curve of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radius of the surface. |

#### Reference

RevolvedFace Class

Autodesk.Revit.DB Namespace