Revit 2026 API

# RebarCoupler Properties

---

The RebarCoupler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CouplerMark | gets and sets the coupler mark |
|  | RotationAngle | Indetifies the rotation angle of the coupler around its axis. |

#### Reference

RebarCoupler Class

Autodesk.Revit.DB.Structure Namespace