Revit 2026 API

# Floor Class

---

An object that represents a Floor within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCeilingAndFloor Autodesk.Revit.DBFloor

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Floor : CeilingAndFloor
```
```vb
Public Class Floor
	Inherits CeilingAndFloor
```
```cpp
public ref class Floor : public CeilingAndFloor
```
```fsharp
type Floor =
    class
        inherit CeilingAndFloor
    end
```

The Floor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FloorType | Retrieves/sets an object that represents the type of the floor. |
|  | SketchId | Returns id of the sketch. |
|  | SpanDirectionAngle | Retrieve the span direction angle of the floor. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop, ElementId, ElementId) |  |
|  | Create(Document, IListCurveLoop, ElementId, ElementId, Boolean, Line, Double) |  |
|  | GetDefaultFloorType | Returns id of default floor type. |
|  | GetNormalAtVerticalProjectionPoint | Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space. |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can be used to add or modify points of this Floor. |
|  | GetSpanDirectionSymbolIds | Retrieves span direction symbol ElementIds. |
|  | GetVerticalProjectionPoint | Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection of an arbitrary point in project space. |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

#### Reference

Autodesk.Revit.DB Namespace