Revit 2026 API

# IndexTriangle Class

---

A triangle primitive consisting of three indices.

SystemObject Autodesk.Revit.DB.DirectContext3DIndexPrimitive Autodesk.Revit.DB.DirectContext3DIndexTriangle

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexTriangle : IndexPrimitive
```
```vb
Public Class IndexTriangle
	Inherits IndexPrimitive
```
```cpp
public ref class IndexTriangle : public IndexPrimitive
```
```fsharp
type IndexTriangle =
    class
        inherit IndexPrimitive
    end
```

The IndexTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IndexTriangle | Constructs the triangle primitive. |

|  | Name | Description |
| --- | --- | --- |
|  | Index0 | The index of the triangle's first vertex. |
|  | Index1 | The index of the triangle's second vertex. |
|  | Index2 | The index of the triangle's third vertex. |

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

Indices of a triangle's vertices can be listed in either the clockwise or counterclockwise winding order, according to the triangle's orientation in space. A DirectContext3D triangle faces the viewer if its vertices are in counterclockwise order from the viewer's point of view.

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace