Revit 2026 API

# InitialColor Methods

---

The InitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the InitialColor derived object. |
|  | Dispose |  |

#### Reference

InitialColor Class

Autodesk.Revit.DB.Lighting Namespace