Revit 2026 API

# CurtainCell Class

---

Represents a CurtainCell within Autodesk Revit.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurtainCell

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurtainCell : APIObject
```
```vb
Public Class CurtainCell
	Inherits APIObject
```
```cpp
public ref class CurtainCell : public APIObject
```
```fsharp
type CurtainCell =
    class
        inherit APIObject
    end
```

The CurtainCell type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveLoops | The cell boundaries on the reference face. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges. |
|  | PlanarizedCurveLoops | The planarized curve loops for cell boundaries. The boundaries can have more than one CurveLoop. Each item in the returned array represents a CurveLoop containing 3 or more than 3 edges. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace