Revit 2026 API

# AssetPropertyInt64 Properties

---

The AssetPropertyInt64 type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property. |

#### Reference

AssetPropertyInt64 Class

Autodesk.Revit.DB.Visual Namespace