Revit 2026 API

# ViewSheetSetting Properties

---

The ViewSheetSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AvailableViews | All views that can be printed. |
|  | CurrentViewSheetSet | The current view sheet set of PrintSetup. |
|  | InSession | The in-session view sheet set of Print Setup. |

#### Reference

ViewSheetSetting Class

Autodesk.Revit.DB Namespace