Revit 2026 API

# SphericalLightDistribution Class

---

This class encapsulates a spherical light distribution.

SystemObject Autodesk.Revit.DB.LightingLightDistribution Autodesk.Revit.DB.LightingSphericalLightDistribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SphericalLightDistribution : LightDistribution
```
```vb
Public Class SphericalLightDistribution
	Inherits LightDistribution
```
```cpp
public ref class SphericalLightDistribution : public LightDistribution
```
```fsharp
type SphericalLightDistribution =
    class
        inherit LightDistribution
    end
```

The SphericalLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SphericalLightDistribution | Creates a spherical light distribution object. |
|  | SphericalLightDistribution(SphericalLightDistribution) | Creates a copy of the given spherical light distribution |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Lighting Namespace