Revit 2026 API

# MEPCurveType Class

---

The base type class for MEP curves, such as ducts, pipes, cable trays and conduits.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBMEPCurveType More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPCurveType : HostObjAttributes
```
```vb
Public Class MEPCurveType
	Inherits HostObjAttributes
```
```cpp
public ref class MEPCurveType : public HostObjAttributes
```
```fsharp
type MEPCurveType =
    class
        inherit HostObjAttributes
    end
```

The MEPCurveType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cross | The default cross fitting of the MEP curve type. |
|  | Elbow | The default elbow fitting of the MEP curve type. |
|  | MultiShapeTransition | The default multi shape transition fitting of the MEP curve type. |
|  | PreferredJunctionType | The preferred junction type of the MEP curve type. |
|  | Roughness | The roughness of the MEP curve type. For PipeTypes, please use Segment::Roughness |
|  | RoutingPreferenceManager | The RoutingPreferenceManager for the MEPCurveType |
|  | Shape | The shape of the profile. |
|  | Tap | The default tap fitting of the MEP curve type. |
|  | Tee | The default tee fitting of the MEP curve type. |
|  | Transition | The default transition fitting of the MEP curve type. |
|  | Union | The default union fitting of the MEP curve type. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBMEPCurveType Autodesk.Revit.DB.ElectricalCableTrayType Autodesk.Revit.DB.ElectricalConduitType Autodesk.Revit.DB.MechanicalDuctType Autodesk.Revit.DB.MechanicalFlexDuctType Autodesk.Revit.DB.PlumbingFlexPipeType Autodesk.Revit.DB.PlumbingPipeType