Revit 2026 API

# IFCImportOptions Methods

---

The IFCImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetConversionData | Get the data used in the creation of the associated Revit file for an IFC link operation, if it exists. |
|  | GetExtraOptions | Get the list of extra options to be passed into the importer. Each entry in the map is a pair of option name and value. |
|  | SetExtraOptions |  |

#### Reference

IFCImportOptions Class

Autodesk.Revit.DB.IFC Namespace