Revit 2026 API

# BuildingPad Methods

---

The BuildingPad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | GetBoundary | Gets the boundary of current BuildingPad element. |
|  | SetBoundary |  |

#### Reference

BuildingPad Class

Autodesk.Revit.DB.Architecture Namespace