Revit 2026 API

# FootPrintRoof Class

---

Represents kinds of FootPrintRoofs.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBRoofBase Autodesk.Revit.DBFootPrintRoof

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FootPrintRoof : RoofBase
```
```vb
Public Class FootPrintRoof
	Inherits RoofBase
```
```cpp
public ref class FootPrintRoof : public RoofBase
```
```fsharp
type FootPrintRoof =
    class
        inherit RoofBase
    end
```

The FootPrintRoof type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Retrieve all the CurtainGrid objects of a FootPrintRoof. |
|  | DefinesSlope | Retrieve or set the DefinesSlope of the curve. |
|  | ExtendIntoWall | Retrieve or set whether extend into wall the curve. |
|  | Offset | Retrieve or set the Offset of the curve. |
|  | Overhang | Retrieve or set the Overhang of the curve. |
|  | SlopeAngle | Retrieve or set the SlopeAngle of the curve. |

|  | Name | Description |
| --- | --- | --- |
|  | GetProfiles | Retrieve all the curveLoops of FootPrintRoof. |

The FootPrintRoof object represents some kinds of FootPrintRoof in Revit. The RoofType property is used to distinguish the type of the roof.

#### Reference

Autodesk.Revit.DB Namespace