Revit 2026 API

# StructuralMaterialTypeFilter Properties

---

The StructuralMaterialTypeFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | StructuralMaterialType | The structural material type. |

#### Reference

StructuralMaterialTypeFilter Class

Autodesk.Revit.DB.Structure Namespace