Revit 2026 API

# GenericForm Methods

---

The GenericForm type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the generic form. |
|  | SetVisibility | Sets the visibility for the generic form. |

#### Reference

GenericForm Class

Autodesk.Revit.DB Namespace