Revit 2026 API

# WireMaterialType Properties

---

The WireMaterialType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroundConductorSizes | Get all ground conductor size types defined in this wire material type. |
|  | IsInUse | Indicate whether the wire material type is in use. |
|  | Name | Get name of wire material type. (Overrides ElementTypeName) |
|  | TemperatureRatings | Get all temperature rating type definitions defined in this wire material type. |

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace