Revit 2026 API

# GeomCombinationSet Properties

---

The GeomCombinationSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of GeomCombinations that are in the set. |

#### Reference

GeomCombinationSet Class

Autodesk.Revit.DB Namespace