Revit 2026 API

# SiteSubRegion Class

---

Represents a proxy class exposing the interfaces needed to access details of a subregion.

SystemObject Autodesk.Revit.DB.ArchitectureSiteSubRegion

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SiteSubRegion : IDisposable
```
```vb
Public Class SiteSubRegion
	Implements IDisposable
```
```cpp
public ref class SiteSubRegion : IDisposable
```
```fsharp
type SiteSubRegion =
    class
        interface IDisposable
    end
```

The SiteSubRegion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostId | The element id of the topography surface hosting this SiteSubRegion. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | TopographySurface | The TopographySurface element which this SiteSubRegion represents. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop) | **Obsolete.** |
|  | Create(Document, IListCurveLoop, ElementId) | **Obsolete.** |
|  | Dispose | Releases all resources used by the SiteSubRegion |
|  | GetBoundary | Gets the boundary of current subregion. |
|  | IsValidBoundary |  |
|  | SetBoundary | **Obsolete.** |

In the Revit database, both TopographySurface elements and subregion elements are represented by the same TopographySurface element subclass. In the Revit API, this SiteSubRegion class exists to separate the interfaces for subregions from those of topography surfaces.

#### Reference

Autodesk.Revit.DB.Architecture Namespace