Revit 2026 API

# StructuralSectionGeneralC Properties

---

The StructuralSectionGeneralC type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LipLength | Lip segment length. |

#### Reference

StructuralSectionGeneralC Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace