Revit 2026 API

# SketchPlane Properties

---

The SketchPlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsSuitableForModelElements | Identifies if the sketch plane can be assigned to model elements. |

#### Reference

SketchPlane Class

Autodesk.Revit.DB Namespace