Revit 2026 API

# ControlledApplication Methods

---

The ControlledApplication type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetFailureDefinitionRegistry | Returns the instance of FailureDefinitionRegistry. |
|  | GetLibraryPaths | Returns path information identifying where Revit searches for content. |
|  | IsJournalPlaying | Determines if the application is currently in journal playback mode. |
|  | OpenSharedParameterFile |  |
|  | RegisterFailuresProcessor | Registers Revit application-wide instance of Failures Processor. |
|  | SetLibraryPaths |  |
|  | WriteJournalComment | Writes a comment to the Revit journal file |

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace