Revit 2026 API

# FabricationPartSizeMap Methods

---

The FabricationPartSizeMap type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FabricationPartSizeMap Class

Autodesk.Revit.DB.Fabrication Namespace