Revit 2026 API

# RenderNode Class

---

This is the base class of all render nodes in a model-exporting process.

SystemObject Autodesk.Revit.DBRenderNode More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RenderNode : IDisposable
```
```vb
Public Class RenderNode
	Implements IDisposable
```
```cpp
public ref class RenderNode : IDisposable
```
```fsharp
type RenderNode =
    class
        interface IDisposable
    end
```

The RenderNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NodeName | A readable name of the output node. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RenderNode |

A node can be both geometric (such as an element, light, etc.) or non-geometric (e.g. material). Some types of nodes are container modes, which include other render nodes.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBContentNode Autodesk.Revit.DBElementNode Autodesk.Revit.DBFaceDetailNode Autodesk.Revit.DBFaceNode Autodesk.Revit.DBGroupNode Autodesk.Revit.DBMaterialNode Autodesk.Revit.DBModelCurveNode Autodesk.Revit.DBTextNode Autodesk.Revit.DBViewNode