Revit 2026 API

# IModelExportContext Methods

---

The IModelExportContext type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
| OnPoint|  This method is called when a Point is being output.

#### Reference

IModelExportContext Interface

Autodesk.Revit.DB Namespace