Revit 2026 API

# GroupSet Properties

---

The GroupSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of groups that are in the set. |

#### Reference

GroupSet Class

Autodesk.Revit.DB Namespace