Revit 2026 API

# ElementSetIterator Methods

---

The ElementSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

ElementSetIterator Class

Autodesk.Revit.DB Namespace