Revit 2026 API

# PrimarySizeCriterion Class

---

This class contains a size criterion for a RoutingPreferenceRule.

SystemObject Autodesk.Revit.DBRoutingCriterionBase Autodesk.Revit.DBPrimarySizeCriterion

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrimarySizeCriterion : RoutingCriterionBase
```
```vb
Public Class PrimarySizeCriterion
	Inherits RoutingCriterionBase
```
```cpp
public ref class PrimarySizeCriterion : public RoutingCriterionBase
```
```fsharp
type PrimarySizeCriterion =
    class
        inherit RoutingCriterionBase
    end
```

The PrimarySizeCriterion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrimarySizeCriterion | Constructs a PrimarySizeCriterion with a minimum and maximum size. |

|  | Name | Description |
| --- | --- | --- |
|  | MaximumSize | The maximum size of this criterion. |
|  | MinimumSize | The minimum size of this criterion. |

|  | Name | Description |
| --- | --- | --- |
|  | All | Creates a criterion with a range of all sizes. |
|  | None | Creates a criterion with a range of no sizes. |

#### Reference

Autodesk.Revit.DB Namespace