Revit 2026 API

# StructuralSectionGeneralW Properties

---

The StructuralSectionGeneralW type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FlangeFillet | Flange Fillet - fillet radius at the flange end. |
|  | TopWebFillet | Top Web Fillet - fillet radius at the top of web. |

#### Reference

StructuralSectionGeneralW Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace