Revit 2026 API

# FileDialog Class

---

Base class supporting display of the dialog used to navigate to and select a file from Autodesk Revit.

SystemObject Autodesk.Revit.UIFileDialog Autodesk.Revit.UIFileOpenDialog Autodesk.Revit.UIFileSaveDialog

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FileDialog : IDisposable
```
```vb
Public Class FileDialog
	Implements IDisposable
```
```cpp
public ref class FileDialog : IDisposable
```
```fsharp
type FileDialog =
    class
        interface IDisposable
    end
```

The FileDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefaultFilterEntry | The default entry (from the filter) to be selected in the dialog. |
|  | Filter | The filter string representing a collection of extensions allowed by the dialog. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Title | The title to show on the dialog. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FileDialog |
|  | GetSelectedModelPath | Returns the selected file path chosen by the user. |
|  | IsValidFilterString | Determines if the input string is acceptable as input for a FileDialog filter string. |
|  | Show | Shows the dialog using the stored settings. |

#### Reference

Autodesk.Revit.UI Namespace