Revit 2026 API

# PathOfTravel Class

---

An element which holds a graphical representation of the shortest route between two points in the plane of a floor plan view. The shortest route is calculated to go around model geometry visible in the view. Route calculation is affected by properties of the RouteAnalysisSettings element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisPathOfTravel

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PathOfTravel : Element
```
```vb
Public Class PathOfTravel
	Inherits Element
```
```cpp
public ref class PathOfTravel : public Element
```
```fsharp
type PathOfTravel =
    class
        inherit Element
    end
```

The PathOfTravel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LineStyle | The line style of the path. |
|  | PathEnd | The end point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update. |
|  | PathMidpoint | The midpoint of the path. The Z coordinate will equal the view's level elevation. |
|  | PathStart | The start point of the path. The Z coordinate will equal the view's level elevation. To update path calculations, call update. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(View, XYZ, XYZ) | Creates a new path of travel between two points. |
|  | Create(View, XYZ, XYZ, PathOfTravelCalculationStatus) | Creates a new path of travel between two points and provides creation result status. |
|  | CreateMapped(View, IListXYZ, IListXYZ) |  |
|  | CreateMapped(View, IListXYZ, IListXYZ, IListPathOfTravelCalculationStatus) |  |
|  | CreateMultiple(View, IListXYZ, IListXYZ) |  |
|  | CreateMultiple(View, IListXYZ, IListXYZ, IListPathOfTravelCalculationStatus) |  |
|  | FindEndsOfShortestPaths |  |
|  | FindShortestPaths |  |
|  | FindStartsOfLongestPathsFromRooms |  |
|  | GetCurves | Gets the array of curves representing the path of travel. |
|  | GetWaypoints | return the waypoints set for the Path of Travel |
|  | InsertWaypoint | Insert a waypoint at the specified index |
|  | IsInRevealObstaclesMode | Returns current state of Reveal Obstacles mode for the given view. |
|  | RemoveWaypoint | Remove a waypoint. |
|  | SetRevealObstaclesMode | Sets Reveal Obstacles mode for the given view. |
|  | SetWaypoint | Updates the specified waypoint. |
|  | Update | Updates the path of travel by recalculating the path between the original start and end points. |
|  | UpdateMultiple(Document, IListElementId) |  |
|  | UpdateMultiple(Document, IListElementId, IListPathOfTravelCalculationStatus) |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace