Revit 2026 API

# CircuitNamingScheme Class

---

This class represents a circuit naming scheme in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.ElectricalCircuitNamingScheme

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CircuitNamingScheme : Element
```
```vb
Public Class CircuitNamingScheme
	Inherits Element
```
```cpp
public ref class CircuitNamingScheme : public Element
```
```fsharp
type CircuitNamingScheme =
    class
        inherit Element
    end
```

The CircuitNamingScheme type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |
|  | GetCombinedParameters | Gets the combined parameters. |
|  | IsNameUnique | Validates whether the CircuitNamingScheme name is unique in document. |
|  | IsValidCombinedParameters |  |
|  | SetCombinedParameters |  |

#### Reference

Autodesk.Revit.DB.Electrical Namespace