Revit 2026 API

# FamilySymbolProfile Class

---

Represents a family symbol based profile for sweep or swept blend elements.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSweepProfile Autodesk.Revit.DBFamilySymbolProfile

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySymbolProfile : SweepProfile
```
```vb
Public Class FamilySymbolProfile
	Inherits SweepProfile
```
```cpp
public ref class FamilySymbolProfile : public SweepProfile
```
```fsharp
type FamilySymbolProfile =
    class
        inherit SweepProfile
    end
```

The FamilySymbolProfile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Angle | The angle of the rotation of the profile in radians. |
|  | IsFlipped | Indicates if the symbol profile is flipped or not. |
|  | Profile | Returns the family symbol of the profile. |
|  | XOffset | The offset of the profile to the origin of the sketch plane in the X direction. |
|  | YOffset | The offset of the profile to the origin of the sketch plane in the Y direction. |

|  | Name | Description |
| --- | --- | --- |

Use objects of this type in methods as NewSweep() and NewSweptBlend() in FamilyItemFactory to create the profile.

#### Reference

Autodesk.Revit.DB Namespace