Revit 2026 API

# FilterStringEquals Class

---

Tests whether string values from the document match a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringEquals

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringEquals : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringEquals
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringEquals : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringEquals =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringEquals type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringEquals | Constructs an instance of FilterStringEquals. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace