Revit 2026 API

# ValidateCurveLoopsOptions Class

---

Options for array of curve loops validation.

SystemObject Autodesk.Revit.DBValidateCurveLoopsOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ValidateCurveLoopsOptions : IDisposable
```
```vb
Public Class ValidateCurveLoopsOptions
	Implements IDisposable
```
```cpp
public ref class ValidateCurveLoopsOptions : IDisposable
```
```fsharp
type ValidateCurveLoopsOptions =
    class
        interface IDisposable
    end
```

The ValidateCurveLoopsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ValidateCurveLoopsOptions |

#### Reference

Autodesk.Revit.DB Namespace