Revit 2026 API

# LayoutRuleMaximumSpacing Properties

---

The LayoutRuleMaximumSpacing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Spacing | Get or set the spacing of the beam system. |

#### Reference

LayoutRuleMaximumSpacing Class

Autodesk.Revit.DB Namespace