Revit 2026 API

# BoundarySegment Class

---

An object that represents a segment of an area boundary.

SystemObject Autodesk.Revit.DBBoundarySegment

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundarySegment : IDisposable
```
```vb
Public Class BoundarySegment
	Implements IDisposable
```
```cpp
public ref class BoundarySegment : IDisposable
```
```fsharp
type BoundarySegment =
    class
        interface IDisposable
    end
```

The BoundarySegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | Retrieve the id of the element that produces this boundary segment. If the segment is created from an element in a link, this is the id of the RevitLinkInstance. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LinkElementId | Retrieve the element id of the element in a link instance that forms this boundary. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BoundarySegment |
|  | GetCurve | Get a copy of the curve that is formed along this boundary. |

These objects define the exterior boundary of an area. The geometry of the segment can be retrieved along with the id of the element that is responsible for producing that boundary.

#### Reference

Autodesk.Revit.DB Namespace