Revit 2026 API

# Point Class

---

A 3D point.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Point : GeometryObject
```
```vb
Public Class Point
	Inherits GeometryObject
```
```cpp
public ref class Point : public GeometryObject
```
```fsharp
type Point =
    class
        inherit GeometryObject
    end
```

The Point type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Coord | Returns the coordinates of the point. |
|  | Reference | Returns a stable reference to the point. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(XYZ) | Creates a point at the given coordinates. |
|  | Create(XYZ, ElementId) | Creates a point at the given coordinates and assigns it the specified GraphicsStyle. |

The point lies at a given XYZ coordinate location.

#### Reference

Autodesk.Revit.DB Namespace