Revit 2026 API

# IndexPrimitive Methods

---

The IndexPrimitive type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IndexPrimitive Class

Autodesk.Revit.DB.DirectContext3D Namespace