Revit 2026 API

# PlanTopologySet Properties

---

The PlanTopologySet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

PlanTopologySet Class

Autodesk.Revit.DB Namespace