Revit 2026 API

# Settings Class

---

The settings object provides access to general components of the Autodesk Revit application, such as Categories.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Settings : APIObject
```
```vb
Public Class Settings
	Inherits APIObject
```
```cpp
public ref class Settings : public APIObject
```
```fsharp
type Settings =
    class
        inherit APIObject
    end
```

The Settings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Categories | Retrieves an object that provides access to all the categories contained in the Autodesk Revit application and project. |
|  | ElectricalSetting | Retrieves an object that provides access to all the electrical settings include voltage type, distribution system type, demand factor, wire type in the Autodesk Revit application and project. |
|  | TilePatterns | Retrieves an object that provides access to the TilePattern objects in the document. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace