Revit 2026 API

# CurveExtents Methods

---

The CurveExtents type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

CurveExtents Class

Autodesk.Revit.DB Namespace