Revit 2026 API

# ViewSet Properties

---

The ViewSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of views that are in the set. |

#### Reference

ViewSet Class

Autodesk.Revit.DB Namespace