Revit 2026 API

# ViewsExportingByContextEventArgs Methods

---

The ViewsExportingByContextEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetViewIds | Gets the views about to be exported by CustomExporter. |

#### Reference

ViewsExportingByContextEventArgs Class

Autodesk.Revit.DB.Events Namespace