Revit 2026 API

# CurveArrayIterator Properties

---

The CurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

CurveArrayIterator Class

Autodesk.Revit.DB Namespace