Revit 2026 API

# RegenerationAttribute Properties

---

The RegenerationAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Option | Regeneration option. |

#### Reference

RegenerationAttribute Class

Autodesk.Revit.Attributes Namespace