Revit 2026 API

# CentralModelVersionArchivedException Class

---

Exception is thrown when last central version merged into the local model has been archived in the central model. Reload Latest or Synchronized with Central needs to be conducted before the current failed operation is retried.

SystemObject SystemException Autodesk.Revit.ExceptionsApplicationException Autodesk.Revit.ExceptionsCentralModelException Autodesk.Revit.ExceptionsCentralModelVersionArchivedException

**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[SerializableAttribute]
public class CentralModelVersionArchivedException : CentralModelException
```
```vb
<SerializableAttribute>
Public Class CentralModelVersionArchivedException
	Inherits CentralModelException
```
```cpp
[SerializableAttribute]
public ref class CentralModelVersionArchivedException : public CentralModelException
```
```fsharp
[<SerializableAttribute>]
type CentralModelVersionArchivedException =
    class
        inherit CentralModelException
    end
```

The CentralModelVersionArchivedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

Autodesk.Revit.Exceptions Namespace