Revit 2026 API

# AreaScheme Class

---

The area scheme associated with a particular area plan.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBAreaScheme

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaScheme : Element
```
```vb
Public Class AreaScheme
	Inherits Element
```
```cpp
public ref class AreaScheme : public Element
```
```fsharp
type AreaScheme =
    class
        inherit Element
    end
```

The AreaScheme type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsGrossBuildingArea | Indicates if the area scheme is a Gross Building Area scheme. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace