Revit 2026 API

# PolylineNode Methods

---

The PolylineNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetPolyline | Returns the polyline object corresponding to the node. |

#### Reference

PolylineNode Class

Autodesk.Revit.DB Namespace