Revit 2026 API

# Conduit Class

---

This class represents a conduit in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DB.ElectricalCableTrayConduitBase Autodesk.Revit.DB.ElectricalConduit

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Conduit : CableTrayConduitBase
```
```vb
Public Class Conduit
	Inherits CableTrayConduitBase
```
```cpp
public ref class Conduit : public CableTrayConduitBase
```
```fsharp
type Conduit =
    class
        inherit CableTrayConduitBase
    end
```

The Conduit type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of conduit. |
|  | IsValidConduitType | Identifies if a conduit type is valid. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace