Revit 2026 API

# NavisworksExportOptions Methods

---

The NavisworksExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetSelectedElementIds | Returns the element ids of the elements to export. Empty by default. |
|  | SetSelectedElementIds |  |

#### Reference

NavisworksExportOptions Class

Autodesk.Revit.DB Namespace