Revit 2026 API

# WallFoundation Properties

---

The WallFoundation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WallId | Returns the id of the host wall. |

#### Reference

WallFoundation Class

Autodesk.Revit.DB Namespace