Revit 2026 API

# IndexStream Class

---

The base class for DirectContext3D index streams, which are used to write vertex indices into buffers.

SystemObject Autodesk.Revit.DB.DirectContext3DIndexStream Autodesk.Revit.DB.DirectContext3DIndexStreamLine Autodesk.Revit.DB.DirectContext3DIndexStreamPoint Autodesk.Revit.DB.DirectContext3DIndexStreamTriangle

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexStream : IDisposable
```
```vb
Public Class IndexStream
	Implements IDisposable
```
```cpp
public ref class IndexStream : IDisposable
```
```fsharp
type IndexStream =
    class
        interface IDisposable
    end
```

The IndexStream type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IndexStream |

This base class cannot be used directly. Instead, a steam that is specific for each type of primitive (point, line, or triangle) must be used.

  * Use IndexStreamPoint to insert IndexPoint instances.
  * Use IndexStreamLine to insert IndexLine instances.
  * Use IndexStreamTriangle to insert IndexTriangle instances.

The process of putting vertex indices into a buffer involves using a stream-buffer pair as follows:
  1. Map the index buffer (see IndexBuffer).
  2. Get a stream for the appropriate primitive type from the buffer.
  3. Add sequences of indices corresponding to primitives of the same type to the stream. The indices will be written into the buffer that was used to create the stream.
  4. Unmap the buffer.

As an alternative to using streams, it is possible to write data into a buffer using a handle to its mapped memory.

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace