Revit 2026 API

# GroundConductorSizeSetIterator Class

---

An iterator to a GroundConductorSize set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalGroundConductorSizeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class GroundConductorSizeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class GroundConductorSizeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class GroundConductorSizeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type GroundConductorSizeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The GroundConductorSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroundConductorSizeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace