Revit 2026 API

# IFCTransaction Methods

---

The IFCTransaction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Commit | Commits all changes made to the IFC file during the transaction. |
|  | Dispose |  |
|  | RollBack | Rolls back all changes made to the IFC file during the transaction. |

#### Reference

IFCTransaction Class

Autodesk.Revit.DB.IFC Namespace