Revit 2026 API

# PipeFittingAndAccessoryConnectorData Methods

---

The PipeFittingAndAccessoryConnectorData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCoordination | Gets the coordination of the connector |

#### Reference

PipeFittingAndAccessoryConnectorData Class

Autodesk.Revit.DB.Plumbing Namespace