Revit 2026 API

# DisplayingOptionsDialogEventArgs Methods

---

The DisplayingOptionsDialogEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddTab | Add tab to option dialog with tab name and handler information. |

#### Reference

DisplayingOptionsDialogEventArgs Class

Autodesk.Revit.UI.Events Namespace