Revit 2026 API

# ViewActivatedEventArgs Properties

---

The ViewActivatedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentActiveView | The view that has just become active. |
|  | PreviousActiveView | The previously active view. |

#### Reference

ViewActivatedEventArgs Class

Autodesk.Revit.UI.Events Namespace