Revit 2026 API

# InsulationTypeSet Methods

---

The InsulationTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every insulation type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a insulation type within the set. |
|  | Erase | Removes a specified insulation type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified insulation type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

InsulationTypeSet Class

Autodesk.Revit.DB.Electrical Namespace