Revit 2026 API

# SiteLocation Class

---

Contains the geographical location information for the project's site.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBSiteLocation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SiteLocation : ElementType
```
```vb
Public Class SiteLocation
	Inherits ElementType
```
```cpp
public ref class SiteLocation : public ElementType
```
```fsharp
type SiteLocation =
    class
        inherit ElementType
    end
```

The SiteLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Elevation | The elevation of the site location. |
|  | GeoCoordinateSystemDefinition | The XML string which describes the geographic coordinate system. |
|  | GeoCoordinateSystemId | The geographic coordinate system ID, such as "AMG-50" and "Beijing1954/a.GK3d-40". |
|  | Latitude | The latitude of the site location. |
|  | Longitude | The longitude of the site location. |
|  | PlaceName | The place name of the site. |
|  | TimeZone | The time-zone for the site. |
|  | WeatherStationName | The name of the weather station at the site location. |

|  | Name | Description |
| --- | --- | --- |
|  | ConvertFromProjectTime | Converts project time to UTC time. |
|  | ConvertToProjectTime | Converts local time or UTC time to project time. |
|  | IsCompatibleWith | Checks whether the geographic coordinate system of this site is compatible with the given site . True if he geographic coordinate system of this site is compatible with the given site, false otherwise. |
|  | SetGeoCoordinateSystem | Set the geographic coordinate system for this site. Similar to acquire coordinate system from a link in the UI. |

Each project may have one site which dictates where in the world the project is based. On this site there may be several locations of the same project. These are represented by ProjectLocation objects. The site location object can be found by using the SiteLocation property on the Document object. The properties of this object can be changed such that it represents any location on the planet or to a known city. Cities already programmed into Revit can be found from the Cities property on the Application object.

#### Reference

Autodesk.Revit.DB Namespace