Revit 2026 API

# ConduitType Properties

---

The ConduitType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsWithFitting | Whether this conduit type is with fitting |

#### Reference

ConduitType Class

Autodesk.Revit.DB.Electrical Namespace