Revit 2026 API

# CableTrayConduitBase Properties

---

The CableTrayConduitBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RunId | The id of the run to which this element belongs. |

#### Reference

CableTrayConduitBase Class

Autodesk.Revit.DB.Electrical Namespace