Revit 2026 API

# PrimaryDesignOptionMemberFilter Class

---

A filter used to find elements contained in any primary design option of any design option set.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBPrimaryDesignOptionMemberFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrimaryDesignOptionMemberFilter : ElementSlowFilter
```
```vb
Public Class PrimaryDesignOptionMemberFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class PrimaryDesignOptionMemberFilter : public ElementSlowFilter
```
```fsharp
type PrimaryDesignOptionMemberFilter =
    class
        inherit ElementSlowFilter
    end
```

The PrimaryDesignOptionMemberFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PrimaryDesignOptionMemberFilter | Constructs a new instance of a filter to match elements contained in any primary design option of any design option set. |
|  | PrimaryDesignOptionMemberFilter(Boolean) | Constructs a new instance of a filter to match elements contained in any primary design option of any design option set, with the option to invert the filter and find elements not contained in any primary design option of any design option set. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter will only pass elements in a primary design option. It will not pass elements in the main model not associated to any design option. This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace