Revit 2026 API

# PrintSetup Class

---

Represents the Print Setup (Application Menu->Print->Print Setup) within Autodesk Revit.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPrintSetup

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PrintSetup : APIObject
```
```vb
Public Class PrintSetup
	Inherits APIObject
```
```cpp
public ref class PrintSetup : public APIObject
```
```fsharp
type PrintSetup =
    class
        inherit APIObject
    end
```

The PrintSetup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentPrintSetting | The current Print Setting of Print Setup. |
|  | InSession | The in-session Print Setting of Print Setup. |

|  | Name | Description |
| --- | --- | --- |
|  | Delete | Delete the current print setting, and make the In-Session setting as the current one. |
|  | Rename | Rename the current print setting with the specified name. |
|  | Revert | Revert the current print setting. |
|  | Save | Save the changes for the current print setting. |
|  | SaveAs | Save the current print setting to another print setting with the specified name. |

The Print Setup object can only get from PrintManager object.

#### Reference

Autodesk.Revit.DB Namespace