Revit 2026 API

# LocationCurve Class

---

Provides location functionality for all elements that are based upon a curve.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLocation Autodesk.Revit.DBLocationCurve

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LocationCurve : Location
```
```vb
Public Class LocationCurve
	Inherits Location
```
```cpp
public ref class LocationCurve : public Location
```
```fsharp
type LocationCurve =
    class
        inherit Location
    end
```

The LocationCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curve | Provides the ability to get and set the curve of a curve based element. |
|  | ElementsAtJoin | Get all elements joining to the end of this element's location curve or change the order of elements participation in the end join with this location curve's end. |
|  | JoinType | Get/change the type of the join at the specified end. |

|  | Name | Description |
| --- | --- | --- |

The location line objects adds additional functionality to its base location object class. This includes reading and writing the curve contained within the element.

#### Reference

Autodesk.Revit.DB Namespace