Revit 2026 API

# StructuralSectionsServiceData Methods

---

The StructuralSectionsServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |

#### Reference

StructuralSectionsServiceData Class

Autodesk.Revit.DB.Structure Namespace