Revit 2026 API

# RPCNode Class

---

This class represents an RPC content in a model-exporting process.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBContentNode Autodesk.Revit.DBRPCNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RPCNode : ContentNode
```
```vb
Public Class RPCNode
	Inherits ContentNode
```
```cpp
public ref class RPCNode : public ContentNode
```
```fsharp
type RPCNode =
    class
        inherit ContentNode
    end
```

The RPCNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

See also: [!:Autodesk::Revit::DB::IExportContext::OnRPC].

#### Reference

Autodesk.Revit.DB Namespace