Revit 2026 API

# MultiSegmentGrid Properties

---

The MultiSegmentGrid type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Text | name shared by grids in this MultiSegmentGrid |

#### Reference

MultiSegmentGrid Class

Autodesk.Revit.DB Namespace