Revit 2026 API

# PostEventArgs Properties

---

The PostEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler). |

#### Reference

PostEventArgs Class

Autodesk.Revit.DB.Events Namespace