Revit 2026 API

# AreaLoad Methods

---

The AreaLoad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreCurveLoopsValid |  |
|  | Create(Document, ElementId, XYZ, AreaLoadType) | Creates a new hosted area load within the project. |
|  | Create(Document, ElementId, IListCurveLoop, XYZ, AreaLoadType) |  |
|  | Create(Document, ElementId, IListCurveLoop, IListXYZ, IListInt32, IListInt32, AreaLoadType) |  |
|  | GetLoops | Returns curve loops that define geometry of the area load. |
|  | GetRefPoint | Returns the physical location of the reference point. |
|  | IsCurveLoopsInsideHostBoundaries |  |
|  | IsValidHostId | Indicates if the provided host id can host area loads The document containing both the host and the load The id of the analytical element that is about to host an area load True if an area load can be placed on the input host id |
|  | SetLoops |  |

#### Reference

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace