Revit 2026 API

# DocumentSavedAsEventArgs Properties

---

The DocumentSavedAsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsSavingAsCentralFile | Indicates whether the document is to be saved as central file. |
|  | OriginalPath | Original path of the document. |

#### Reference

DocumentSavedAsEventArgs Class

Autodesk.Revit.DB.Events Namespace