Revit 2026 API

# PlanCircuit Class

---

An object that represents an enclosed area in a plan view within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPlanCircuit

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PlanCircuit : APIObject
```
```vb
Public Class PlanCircuit
	Inherits APIObject
```
```cpp
public ref class PlanCircuit : public APIObject
```
```fsharp
type PlanCircuit =
    class
        inherit APIObject
    end
```

The PlanCircuit type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | The enclosed area of the circuit. |
|  | IsRoomLocated | Reports whether there is a room located in this circuit. |
|  | SideNum | The number of sides in the circuit. |

|  | Name | Description |
| --- | --- | --- |
|  | GetPointInside | Returns a point inside the circuit. |

Plan circuits are enclosed regions as seen on a plan view. They are used to determine the boundary extents of rooms based on the placement of walls. In the Autodesk Revit API, you can use plan circuits to create new rooms.

#### Reference

Autodesk.Revit.DB Namespace