Revit 2026 API

# ElementWorksetFilter Class

---

A filter used to match elements which reside in a given workset.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementWorksetFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementWorksetFilter : ElementQuickFilter
```
```vb
Public Class ElementWorksetFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementWorksetFilter : public ElementQuickFilter
```
```fsharp
type ElementWorksetFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementWorksetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementWorksetFilter(WorksetId) | Constructs a new instance of a filter to match elements in a given workset. |
|  | ElementWorksetFilter(WorksetId, Boolean) | Constructs a new instance of a filter to match elements in a given workset. |

|  | Name | Description |
| --- | --- | --- |
|  | WorksetId | The workset id. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter.

#### Reference

Autodesk.Revit.DB Namespace