Revit 2026 API

# LogicalOrFilter Class

---

A filter that contains a set of filters. The filter passes when any filter in the set passes.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementLogicalFilter Autodesk.Revit.DBLogicalOrFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LogicalOrFilter : ElementLogicalFilter
```
```vb
Public Class LogicalOrFilter
	Inherits ElementLogicalFilter
```
```cpp
public ref class LogicalOrFilter : public ElementLogicalFilter
```
```fsharp
type LogicalOrFilter =
    class
        inherit ElementLogicalFilter
    end
```

The LogicalOrFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LogicalOrFilter(IListElementFilter) | Initializes a new instance of the LogicalOrFilter class |
|  | LogicalOrFilter(ElementFilter, ElementFilter) | Constructs a new instance of the logical filter with two input filters. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The component filters may be reordered by Revit to cause the quickest acting filters to be evaluated first.

#### Reference

Autodesk.Revit.DB Namespace