Revit 2026 API

# AssetPropertyDoubleMatrix44 Properties

---

The AssetPropertyDoubleMatrix44 type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property |

#### Reference

AssetPropertyDoubleMatrix44 Class

Autodesk.Revit.DB.Visual Namespace