Revit 2026 API

# MEPAnalyticalConnectionType Class

---

Represents an analytical connection type between mechanical equipment and piping network.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBMEPAnalyticalConnectionType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPAnalyticalConnectionType : ElementType
```
```vb
Public Class MEPAnalyticalConnectionType
	Inherits ElementType
```
```cpp
public ref class MEPAnalyticalConnectionType : public ElementType
```
```fsharp
type MEPAnalyticalConnectionType =
    class
        inherit ElementType
    end
```

The MEPAnalyticalConnectionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PressureLoss | The pressure loss of this analytical connection type. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an analytical connection type element. |
|  | FindTypeByName | Finds the analytical connection type by its name. |
|  | IsNameUnused | Checks if this is an unused name. |

#### Reference

Autodesk.Revit.DB Namespace