Revit 2026 API

# FabricationNetworkChangeService Methods

---

The FabricationNetworkChangeService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplyChange | Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both. |
|  | ChangeService(ISetElementId, Int32, Int32) |  |
|  | ChangeService(ISetElementId, Int32, Int32, Boolean) |  |
|  | ChangeSize |  |
|  | Dispose |  |
|  | GetElementsThatFailed | Gets the set of fabrication parts that had failures due to either there was no corresponding part in the service, the size was out of range, or a connection could not be made. |
|  | GetInLinePartTypes | Get a set of element identifiers of fabrication part types for in-line parts. |
|  | GetMapOfAllSizesForStraights | Get a set of FabricationPartSizeMapSet of all straight sizes for all services. |
|  | GetStraightsThatWereNotChanged | Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range. |
|  | SetMapOfInLinePartTypes |  |
|  | SetMapOfSizesForStraights |  |
|  | SetPaletteId | Set the fabrication palette identifier to change the elements to. |
|  | SetRestrictPalette | Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier. |
|  | SetSelection |  |
|  | SetServiceId | Set the fabrication service identifier to change the elements to. |

#### Reference

FabricationNetworkChangeService Class

Autodesk.Revit.DB.Fabrication Namespace