Revit 2026 API

# ForbiddenForDynamicUpdateException Methods

---

The ForbiddenForDynamicUpdateException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ForbiddenForDynamicUpdateException Class

Autodesk.Revit.Exceptions Namespace