Revit 2026 API

# ExportLineweightTableIterator Methods

---

The ExportLineweightTableIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsDone | Identifies if the iteration has completed. |
|  | MoveNext | Increments the iterator to the next item. |
|  | Reset | Resets the iterator to the initial state. |

#### Reference

ExportLineweightTableIterator Class

Autodesk.Revit.DB Namespace