Revit 2026 API

# AreaFilter Class

---

A filter used to match areas.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBAreaFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AreaFilter : ElementSlowFilter
```
```vb
Public Class AreaFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class AreaFilter : public ElementSlowFilter
```
```fsharp
type AreaFilter =
    class
        inherit ElementSlowFilter
    end
```

The AreaFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreaFilter | Constructs a filter which matches only areas. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace