Revit 2026 API

# CurtainSystem Methods

---

The CurtainSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCurtainGrid | Add CurtainGrid on the specified face for the CurtainSystem. |
|  | RemoveCurtainGrid | Remove CurtainGrid from the specified face for the CurtainSystem. |

#### Reference

CurtainSystem Class

Autodesk.Revit.DB Namespace