Revit 2026 API

# PushButtonData Class

---

This class contains information necessary to construct a push button in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIPushButtonData Autodesk.Revit.UIToggleButtonData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PushButtonData : ButtonData
```
```vb
Public Class PushButtonData
	Inherits ButtonData
```
```cpp
public ref class PushButtonData : public ButtonData
```
```fsharp
type PushButtonData =
    class
        inherit ButtonData
    end
```

The PushButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PushButtonData | Constructs a new instance of PushButtonData. |

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyName | The assembly path of the button. |
|  | AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button. |
|  | ClassName | The name of the class containing the implementation for the command. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace