Revit 2026 API

# FamilySymbol Class

---

An element that represents a single type with a Family.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBInsertableObject Autodesk.Revit.DBFamilySymbol More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilySymbol : InsertableObject
```
```vb
Public Class FamilySymbol
	Inherits InsertableObject
```
```cpp
public ref class FamilySymbol : public InsertableObject
```
```fsharp
type FamilySymbol =
    class
        inherit InsertableObject
    end
```

The FamilySymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Family | The Family object to which the symbol belongs. |
|  | IsActive | Identifies whether the symbol is active. |
|  | StructuralMaterialType | This property returns the physical material from which the type is made. |

|  | Name | Description |
| --- | --- | --- |
|  | Activate | Activates the symbol to ensure that its geometry is accessible. |
|  | CanHaveStructuralSection | Identifies if this FamilySymbol can have a structural section. |
|  | GetFamilyPointLocations | Returns the Point Locations for the Family Symbol. |
|  | GetStructuralSection | Gets the structural section from element. |
|  | GetThermalProperties | Gets the thermal properties for the given FamilySymbol. |
|  | HasThermalProperties | Identifies if this FamilySymbol can include thermal properties. |
|  | SetStructuralSection | Sets the structural section in element. |
|  | SetThermalProperties | Sets the thermal properties for the given FamilySymbol. |

Custom families within the Revit API represented by three objects - Family, FamilySymbol and FamilyInstance. Each object plays a significant part in the structure of families. The Family element represents the entire family that consists of a collection of types, such as an 'I Beam'. You can think of that object as representing the entire family file. The Family object contains a number of FamilySymbol elements. The FamilySymbol object represents a specific set of family settings within that Family and represents what is known in the Revit user interface as a Type, such as 'W14x32'. The FamilyInstance object represents an actual instance of that type placed the Autodesk Revit project. For example the FamilyInstance would be a single instance of a W14x32 column within the project.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBInsertableObject Autodesk.Revit.DBFamilySymbol Autodesk.Revit.DBAnnotationSymbolType Autodesk.Revit.DB.ArchitectureRoomTagType Autodesk.Revit.DBAreaTagType Autodesk.Revit.DB.MechanicalSpaceTagType Autodesk.Revit.DBMullionType Autodesk.Revit.DBPanelType Autodesk.Revit.DB.StructureTrussType