Revit 2026 API

# FilterIntegerRule Class

---

A filter rule that operates on integer values in a Revit project.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterIntegerRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterIntegerRule : FilterNumericValueRule
```
```vb
Public Class FilterIntegerRule
	Inherits FilterNumericValueRule
```
```cpp
public ref class FilterIntegerRule : public FilterNumericValueRule
```
```fsharp
type FilterIntegerRule =
    class
        inherit FilterNumericValueRule
    end
```

The FilterIntegerRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterIntegerRule | Constructs an instance of FilterIntegerRule. |

|  | Name | Description |
| --- | --- | --- |
|  | RuleValue | The user-supplied value against which values from a Revit document will be tested. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace