Revit 2026 API

# HVACLoadSpaceType Properties

---

The HVACLoadSpaceType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPlenum | True if the space type is plenum. |
|  | SpaceTypeName | The space type name. |

#### Reference

HVACLoadSpaceType Class

Autodesk.Revit.DB.Analysis Namespace