Revit 2026 API

# CorrectionFactor Methods

---

The CorrectionFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetTemperature | Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature. |

#### Reference

CorrectionFactor Class

Autodesk.Revit.DB.Electrical Namespace