Revit 2026 API

# RebarHandlePositionData Methods

---

The RebarHandlePositionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBarGeometry | Returns the geometry for a bar at the specified index currently in the Rebar. |
|  | GetDistributionPath | Gets the distribution path currently stored in the rebar. |
|  | GetNumberOfBars | Gets the number of bars currently in the rebar. |
|  | SetPosition | Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully. |

#### Reference

RebarHandlePositionData Class

Autodesk.Revit.DB.Structure Namespace