Revit 2026 API

# DocumentSet Properties

---

The DocumentSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

DocumentSet Class

Autodesk.Revit.DB Namespace