Revit 2026 API

# RenderingImageExposureSettings Methods

---

The RenderingImageExposureSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RenderingImageExposureSettings Class

Autodesk.Revit.DB Namespace