Revit 2026 API

# LayoutRuleFixedDistance Class

---

This class indicate the layout rule of a Beam System is Fixed-Distance.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleFixedDistance

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LayoutRuleFixedDistance : LayoutRule
```
```vb
Public Class LayoutRuleFixedDistance
	Inherits LayoutRule
```
```cpp
public ref class LayoutRuleFixedDistance : public LayoutRule
```
```fsharp
type LayoutRuleFixedDistance =
    class
        inherit LayoutRule
    end
```

The LayoutRuleFixedDistance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LayoutRuleFixedDistance | Constructor of LayoutRuleFixedDistance. Create LayoutRuleFixedDistance with the values passed in. |

|  | Name | Description |
| --- | --- | --- |
|  | JustifyType | Get or set the type of justification. |
|  | Spacing | Get or set spacing of the Beam System. |

|  | Name | Description |
| --- | --- | --- |

To use this type of LayoutRule, the distance between the beams and the justify-type must be set.

#### Reference

Autodesk.Revit.DB Namespace