Revit 2026 API

# PipeSegment Class

---

The PipeSegment class represents an instance of pipe segment which has the design data for routing preference.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSegment Autodesk.Revit.DB.PlumbingPipeSegment

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeSegment : Segment
```
```vb
Public Class PipeSegment
	Inherits Segment
```
```cpp
public ref class PipeSegment : public Segment
```
```fsharp
type PipeSegment =
    class
        inherit Segment
    end
```

The PipeSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleTypeId | The ElementId of the PipeScheduleType. |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace