Revit 2026 API

# ExtrusionRoof Methods

---

The ExtrusionRoof type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetProfile | Retrieve the Profile of ExtrusionRoof. |

#### Reference

ExtrusionRoof Class

Autodesk.Revit.DB Namespace