Revit 2026 API

# FilterNumericValueRule Class

---

Base for all classes that use a FilterNumericRuleEvaluator to perform their comparisons

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBFilterNumericValueRule Autodesk.Revit.DBFilterDoubleRule Autodesk.Revit.DBFilterElementIdRule Autodesk.Revit.DBFilterGlobalParameterAssociationRule Autodesk.Revit.DBFilterIntegerRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericValueRule : FilterValueRule
```
```vb
Public Class FilterNumericValueRule
	Inherits FilterValueRule
```
```cpp
public ref class FilterNumericValueRule : public FilterValueRule
```
```fsharp
type FilterNumericValueRule =
    class
        inherit FilterValueRule
    end
```

The FilterNumericValueRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetEvaluator | Gets the evaluator that implements the test for this rule. |
|  | SetEvaluator | Sets the evaluator that implements the test for this rule. |

#### Reference

Autodesk.Revit.DB Namespace