Revit 2026 API

# TextEditorOptions Class

---

Provides access to settings that control Revit's Text Editor appearance and functionality.

SystemObject Autodesk.Revit.UITextEditorOptions

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TextEditorOptions : IDisposable
```
```vb
Public Class TextEditorOptions
	Implements IDisposable
```
```cpp
public ref class TextEditorOptions : IDisposable
```
```fsharp
type TextEditorOptions =
    class
        interface IDisposable
    end
```

The TextEditorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowBorder | Show the border box around the text during editing. |
|  | ShowOpaqueBackground | Show opaque background behind the text during editing. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TextEditorOptions |
|  | GetTextEditorOptions | Returns the current Revit instance's TextEditorOptions. |

These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.

#### Reference

Autodesk.Revit.UI Namespace