Revit 2026 API

# Profile Methods

---

The Profile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this profile. |

#### Reference

Profile Class

Autodesk.Revit.DB Namespace