Revit 2026 API

# AssetPropertyDouble Properties

---

The AssetPropertyDouble type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

#### Reference

AssetPropertyDouble Class

Autodesk.Revit.DB.Visual Namespace