Revit 2026 API

# HostObjAttributes Class

---

An object that represents characteristics of several kinds of type.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HostObjAttributes : ElementType
```
```vb
Public Class HostObjAttributes
	Inherits ElementType
```
```cpp
public ref class HostObjAttributes : public ElementType
```
```fsharp
type HostObjAttributes =
    class
        inherit ElementType
    end
```

The HostObjAttributes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetCompoundStructure | Returns an object that represents the compound structure of the element. |
|  | SetCompoundStructure | Sets the compound structure of the element. |

This object provides access to structural layering components for any object derived from it, such as wall types and floor types.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBBuildingPadType Autodesk.Revit.DBCeilingType Autodesk.Revit.DBCurtainSystemType Autodesk.Revit.DBFloorType Autodesk.Revit.DBHostedSweepType Autodesk.Revit.DBMEPCurveType Autodesk.Revit.DBRoofType Autodesk.Revit.DBToposolidType Autodesk.Revit.DBWallFoundationType Autodesk.Revit.DBWallType