Revit 2026 API

# PickedBox Class

---

A class that contains two XYZ points representing the pick box on the screen.

SystemObject Autodesk.Revit.UI.SelectionPickedBox

**Namespace:** Autodesk.Revit.UI.Selection**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PickedBox
```
```vb
Public Class PickedBox
```
```cpp
public ref class PickedBox
```
```fsharp
type PickedBox = class end
```

The PickedBox type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Max | Maximum coordinates (upper-right-front corner of the pick box). |
|  | Min | Minimum coordinates (lower-left-rear corner of the pick box). |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI.Selection Namespace