Revit 2026 API

# CentralModelException Methods

---

The CentralModelException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CentralModelException Class

Autodesk.Revit.Exceptions Namespace