Revit 2026 API

# VertexPositionNormal Class

---

A geometry vertex specified as a position in space with a normal vector.

SystemObject Autodesk.Revit.DB.DirectContext3DVertex Autodesk.Revit.DB.DirectContext3DVertexPositionNormal

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexPositionNormal : Vertex
```
```vb
Public Class VertexPositionNormal
	Inherits Vertex
```
```cpp
public ref class VertexPositionNormal : public Vertex
```
```fsharp
type VertexPositionNormal =
    class
        inherit Vertex
    end
```

The VertexPositionNormal type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexPositionNormal | Constructs the vertex from a point and a normal vector. |

|  | Name | Description |
| --- | --- | --- |
|  | Normal | The vertex's normal vector. |
|  | Position | The vertex's position. |

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |

Since these vertices do not have a color their color is obtained from the EffectInstance

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace