Revit 2026 API

# Revision Methods

---

The Revision type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CombineWithNext | Combines the specified Revision with the next Revision. |
|  | CombineWithPrevious | Combines the specified Revision with the previous Revision. |
|  | Create | Creates a new Revision in the project. |
|  | GetAllRevisionIds | Returns the ids of all Revisions in the project ordered by sequence number. |
|  | ReorderRevisionSequence |  |

#### Reference

Revision Class

Autodesk.Revit.DB Namespace