Revit 2026 API

# ViewDisplayModel Methods

---

The ViewDisplayModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ViewDisplayModel Class

Autodesk.Revit.DB Namespace