Revit 2026 API

# KeynoteEntry Class

---

Represents an entry in the keynote table, containing the key value, keynote text, and parent key (if applicable).

SystemObject Autodesk.Revit.DBKeyBasedTreeEntry Autodesk.Revit.DBKeynoteEntry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeynoteEntry : KeyBasedTreeEntry
```
```vb
Public Class KeynoteEntry
	Inherits KeyBasedTreeEntry
```
```cpp
public ref class KeynoteEntry : public KeyBasedTreeEntry
```
```fsharp
type KeynoteEntry =
    class
        inherit KeyBasedTreeEntry
    end
```

The KeynoteEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | KeynoteEntry(String, String) | Constructs a new KeynoteEntry from the given key name and keynote text. KeynoteEntry objects created from this constructor will not have parents. |
|  | KeynoteEntry(String, String, String) | Constructs a new KeynoteEntry from the given key name, parent key name, and keynote text. |

|  | Name | Description |
| --- | --- | --- |
|  | KeynoteText | The text associated with this KeynoteEntry. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace