Revit 2026 API

# AddInCommandBinding Class

---

This object represents a binding between a Revit command and one or more handlers which override the behavior of the command in Revit.

SystemObject Autodesk.Revit.UIAddInCommandBinding

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AddInCommandBinding
```
```vb
Public Class AddInCommandBinding
```
```cpp
public ref class AddInCommandBinding
```
```fsharp
type AddInCommandBinding = class end
```

The AddInCommandBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RevitCommandId | The Revit command Id. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | BeforeExecuted | Occurs before the command associated with this AddInCommandBinding executes. |
|  | CanExecute | Occurs when the command associated with this AddInCommandBinding initiates a check to determine whether the command can be executed on the command target. |
|  | Executed | Occurs when the command associated with this AddInCommandBinding executes. |

#### Reference

Autodesk.Revit.UI Namespace