Revit 2026 API

# ContextMenu Class

---

A class that owns context menu items.

SystemObject Autodesk.Revit.UIContextMenu

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ContextMenu : IDisposable
```
```vb
Public Class ContextMenu
	Implements IDisposable
```
```cpp
public ref class ContextMenu : IDisposable
```
```fsharp
type ContextMenu =
    class
        interface IDisposable
    end
```

The ContextMenu type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ContextMenu | Default constructor |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Add an item to the Context Menu. |
|  | Dispose | Releases all resources used by the ContextMenu |

There are three types of menu items (CommandMenuItem, SubMenuItem, SeparatorItem) that can be added to a ContextMenu object.

#### Reference

Autodesk.Revit.UI Namespace