Revit 2026 API

# ProgressChangedEventArgs Methods

---

The ProgressChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Requests to cancel the progress bar's operation. |

#### Reference

ProgressChangedEventArgs Class

Autodesk.Revit.DB.Events Namespace