Revit 2026 API

# DefaultOpenFromCloudCallback Methods

---

The DefaultOpenFromCloudCallback type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | OnOpenConflict | A method called when the conflict is happen during the model opening. |

#### Reference

DefaultOpenFromCloudCallback Class

Autodesk.Revit.DB Namespace