Revit 2026 API

# BoundaryConditions Properties

---

The BoundaryConditions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssociatedLoadId | The Id of the internal load element associated with a boundary conditions. |
|  | HostElementId | The host element Id for the boundary conditions. |
|  | Point | Returns the position of point boundary conditions. |

#### Reference

BoundaryConditions Class

Autodesk.Revit.DB.Structure Namespace