Revit 2026 API

# BoundingBoxContainsPointFilter Class

---

A filter used to match elements with a bounding box that contains the given point.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBBoundingBoxContainsPointFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundingBoxContainsPointFilter : ElementQuickFilter
```
```vb
Public Class BoundingBoxContainsPointFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class BoundingBoxContainsPointFilter : public ElementQuickFilter
```
```fsharp
type BoundingBoxContainsPointFilter =
    class
        inherit ElementQuickFilter
    end
```

The BoundingBoxContainsPointFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BoundingBoxContainsPointFilter(XYZ) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point. |
|  | BoundingBoxContainsPointFilter(XYZ, Boolean) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point, with the option to invert the filter and match all elements with a bounding box that do not contain the given point. |
|  | BoundingBoxContainsPointFilter(XYZ, Double) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point, while specifying the tolerance to be used in deciding if the point matches the criteria. |
|  | BoundingBoxContainsPointFilter(XYZ, Double, Boolean) | Constructs a new instance of a filter to match elements with a bounding box that contains the given point, while specifying the tolerance to be used in deciding if the point matches the criteria. This constructor includes the option to invert the filter and match all elements with a bounding box that do not contain the given point. |

|  | Name | Description |
| --- | --- | --- |
|  | Point | The XYZ point to use when matching element bounding boxes. |
|  | Tolerance | Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements. |

|  | Name | Description |
| --- | --- | --- |

This filter excludes all objects derived from View and objects derived from ElementType. This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace