Revit 2026 API

# PhaseArray Class

---

An array that contains phase objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPhaseArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PhaseArray : APIObject, IEnumerable
```
```vb
Public Class PhaseArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class PhaseArray : public APIObject,
	IEnumerable
```
```fsharp
type PhaseArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The PhaseArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PhaseArray | Initializes a new instance of the PhaseArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a phase at a specified index within the array. |
|  | Size | Returns the number of phases that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the phase to the end of the array. |
|  | Clear | Removes every phase from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified phase into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace