Revit 2026 API

# IFCExtrusionCalculatorOptions Methods

---

The IFCExtrusionCalculatorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCExtrusionCalculatorOptions Class

Autodesk.Revit.DB.IFC Namespace