Revit 2026 API

# GenericZoneDomainData Methods

---

The GenericZoneDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

GenericZoneDomainData Class

Autodesk.Revit.DB.Analysis Namespace