Revit 2026 API

# CommandEventArgs Properties

---

The CommandEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ActiveDocument | The active document. |
|  | CommandId | The command id. |

#### Reference

CommandEventArgs Class

Autodesk.Revit.UI.Events Namespace