Revit 2026 API

# GroundConductorSizeSet Properties

---

The GroundConductorSizeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of GroundConductorSizes that are in the set. |

#### Reference

GroundConductorSizeSet Class

Autodesk.Revit.DB.Electrical Namespace