Revit 2026 API

# HermiteSurface Methods

---

The HermiteSurface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Int32, Int32, IListXYZ) |  |
|  | Create(Int32, Int32, IListXYZ, Boolean, Boolean) |  |
|  | IsValid | Checks whether this HermiteSurface object is valid. |

#### Reference

HermiteSurface Class

Autodesk.Revit.DB Namespace