Revit 2026 API

# AssetProperties Properties

---

The AssetProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Item |  |
|  | Size | The number of the AssetProperty(s) in the object. |

#### Reference

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace