Revit 2026 API

# Floor Methods

---

The Floor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop, ElementId, ElementId) |  |
|  | Create(Document, IListCurveLoop, ElementId, ElementId, Boolean, Line, Double) |  |
|  | GetDefaultFloorType | Returns id of default floor type. |
|  | GetNormalAtVerticalProjectionPoint | Return a surface normal on either the top or bottom face of a floor slab at a point corresponding to the vertical projection of an arbitrary point in project space. |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can be used to add or modify points of this Floor. |
|  | GetSpanDirectionSymbolIds | Retrieves span direction symbol ElementIds. |
|  | GetVerticalProjectionPoint | Return a surface point on either the top or bottom face of a floor slab corresponding to the vertical projection of an arbitrary point in project space. |

#### Reference

Floor Class

Autodesk.Revit.DB Namespace