Revit 2026 API

# PolymeshFacet Class

---

A class representing one triangular piece - a facet - in a polymesh topology.

SystemObject Autodesk.Revit.DBPolymeshFacet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PolymeshFacet
```
```vb
Public Class PolymeshFacet
```
```cpp
public ref class PolymeshFacet
```
```fsharp
type PolymeshFacet = class end
```

The PolymeshFacet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PolymeshFacet | Creates a PolymeshFacet with the supplied vertices. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | V1 | The first vertex of the facet |
|  | V2 | The second vertex of the facet |
|  | V3 | The third vertex of the facet |

|  | Name | Description |
| --- | --- | --- |
|  | GetVertices | Returns the three vertices that define this facet |
|  | ToString | Returns formatted string showing (V1, V2, V3) with values formatted as regular integers (Overrides ObjectToString) |

It can also be used to create TopographySurface. Each facet is defined by indices of three vertices of the polymesh.

#### Reference

Autodesk.Revit.DB Namespace