Revit 2026 API

# IFCConnectedWallData Class

---

A class that contains the IFC-specific information about how an element is joined to another element.

SystemObject Autodesk.Revit.DB.IFCIFCConnectedWallData

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCConnectedWallData : IDisposable
```
```vb
Public Class IFCConnectedWallData
	Implements IDisposable
```
```cpp
public ref class IFCConnectedWallData : IDisposable
```
```fsharp
type IFCConnectedWallData =
    class
        interface IDisposable
    end
```

The IFCConnectedWallData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementId | The element id to which this element is joined. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Location | The location for the join. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCConnectedWallData |

#### Reference

Autodesk.Revit.DB.IFC Namespace