Revit 2026 API

# VertexStream Class

---

The base class for DirectContext3D vertex streams, which are used to write vertex data into buffers.

SystemObject Autodesk.Revit.DB.DirectContext3DVertexStream Autodesk.Revit.DB.DirectContext3DVertexStreamPosition Autodesk.Revit.DB.DirectContext3DVertexStreamPositionColored Autodesk.Revit.DB.DirectContext3DVertexStreamPositionNormal Autodesk.Revit.DB.DirectContext3DVertexStreamPositionNormalColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexStream : IDisposable
```
```vb
Public Class VertexStream
	Implements IDisposable
```
```cpp
public ref class VertexStream : IDisposable
```
```fsharp
type VertexStream =
    class
        interface IDisposable
    end
```

The VertexStream type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the VertexStream |

This base class cannot be used directly. Instead, a steam that is specific for each type of vertex must be used.

  * Use VertexStreamPosition to insert VertexPosition instances.
  * Use VertexStreamPositionColored to insert VertexPositionColored instances.
  * Use VertexStreamPositionNormal to insert VertexPositionNormal instances.
  * Use VertexStreamPositionNormalColored to insert VertexPositionNormalColored instances.

The process of putting vertex data into a buffer involves using a stream-buffer pair as follows:
  1. Map the vertex buffer.
  2. Get a stream of the appropriate type from the buffer.
  3. Add vertices of the same type to the stream. They will be written into the buffer that was used to create the stream.
  4. Unmap the buffer.

As an alternative to using streams, it is possible to write data into a buffer using a handle to its mapped memory.

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace