Revit 2026 API

# ReloadSwapOutInfo Class

---

This object contains information about fabrication parts swapped out during reload.

SystemObject Autodesk.Revit.DBReloadSwapOutInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReloadSwapOutInfo : IDisposable
```
```vb
Public Class ReloadSwapOutInfo
	Implements IDisposable
```
```cpp
public ref class ReloadSwapOutInfo : IDisposable
```
```fsharp
type ReloadSwapOutInfo =
    class
        interface IDisposable
    end
```

The ReloadSwapOutInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentVersion | New version. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Part | The ElementId of part being swapped. |
|  | PreviousVersion | Previous version. |
|  | WasSwapped | Whether the swap out was successful. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ReloadSwapOutInfo |

#### Reference

Autodesk.Revit.DB Namespace