Revit 2026 API

# Sketch Class

---

Provides access to the Sketch in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSketchBase Autodesk.Revit.DBSketch

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Sketch : SketchBase
```
```vb
Public Class Sketch
	Inherits SketchBase
```
```cpp
public ref class Sketch : public SketchBase
```
```fsharp
type Sketch =
    class
        inherit SketchBase
    end
```

The Sketch type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OwnerId | Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry. |
|  | Profile | Returns the Profile of the Sketch. |
|  | SketchPlane | Returns the Sketch Plane of the Sketch. |

|  | Name | Description |
| --- | --- | --- |
|  | GetAllElements | Returns all elements which belong to the sketch. |

#### Reference

Autodesk.Revit.DB Namespace