Revit 2026 API

# ElementNode Properties

---

The ElementNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | Gets the document associated with the element. |
|  | ElementId | The Id of the element. |
|  | LinkInstanceId | The Id of the link instance for the element. |

#### Reference

ElementNode Class

Autodesk.Revit.DB Namespace