Revit 2026 API

# CurveOverlapPoint Class

---

A point of overlap of two curves and its type of overlap.

SystemObject Autodesk.Revit.DBCurveOverlapPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveOverlapPoint : IDisposable
```
```vb
Public Class CurveOverlapPoint
	Implements IDisposable
```
```cpp
public ref class CurveOverlapPoint : IDisposable
```
```fsharp
type CurveOverlapPoint =
    class
        interface IDisposable
    end
```

The CurveOverlapPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FirstParameter | The point's unnormalized parameter on the first curve. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Point | The 3D coordinate of the point. |
|  | SecondParameter | The point's unnormalized parameter on the second curve. |
|  | Type | The type of overlap at the point. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CurveOverlapPoint |

#### Reference

Autodesk.Revit.DB Namespace