Revit 2026 API

# ElectricalLoadClassification Methods

---

The ElectricalLoadClassification type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of load classification and adds it to the document. |

#### Reference

ElectricalLoadClassification Class

Autodesk.Revit.DB.Electrical Namespace