Revit 2026 API

# GraphicsStyle Properties

---

The GraphicsStyle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GraphicsStyleCategory | The graphics style category. |
|  | GraphicsStyleType | The graphics style type. |

#### Reference

GraphicsStyle Class

Autodesk.Revit.DB Namespace