Revit 2026 API

# FilterRule Class

---

Defines a boolean operation that can be used to cull elements from a document.

SystemObject Autodesk.Revit.DBFilterRule More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterRule : IDisposable
```
```vb
Public Class FilterRule
	Implements IDisposable
```
```cpp
public ref class FilterRule : IDisposable
```
```fsharp
type FilterRule =
    class
        interface IDisposable
    end
```

The FilterRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilterRule |
|  | ElementPasses | Derived classes override this method to implement the test that determines whether the given element passes this rule or not. |
|  | GetRuleParameter | Returns the ElementId of the parameter associated to this FilterRule if there is one, or invalidElementId if there is no associated parameter. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterCategoryRule Autodesk.Revit.DBFilterInverseRule Autodesk.Revit.DBFilterValueRule Autodesk.Revit.DBParameterValuePresenceRule Autodesk.Revit.DBSharedParameterApplicableRule