Revit 2026 API

# TriangulationInterface Methods

---

The TriangulationInterface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

TriangulationInterface Class

Autodesk.Revit.DB Namespace