Revit 2026 API

# VertexFormat Class

---

A specification of the format of vertex data contained in a piece of geometry.

SystemObject Autodesk.Revit.DB.DirectContext3DVertexFormat

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexFormat : IDisposable
```
```vb
Public Class VertexFormat
	Implements IDisposable
```
```cpp
public ref class VertexFormat : IDisposable
```
```fsharp
type VertexFormat =
    class
        interface IDisposable
    end
```

The VertexFormat type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexFormat | Constructs the specification of vertex format from a numerical representation. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the VertexFormat |
|  | IsValid | Tests whether the vertex format specification is valid for rendering. |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace