Revit 2026 API

# ComboBoxMember Properties

---

The ComboBoxMember type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroupName | The group to which the ComboBoxMember is assigned. |
|  | Image | The image shown on the ComboBoxMember. |

#### Reference

ComboBoxMember Class

Autodesk.Revit.UI Namespace