Revit 2026 API

# ConnectorSet Class

---

A set that can contain any type of object.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBConnectorSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConnectorSet : APIObject,
	IEnumerable
```
```vb
Public Class ConnectorSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ConnectorSet : public APIObject,
	IEnumerable
```
```fsharp
type ConnectorSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ConnectorSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorSet | Initializes a new instance of the ConnectorSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item from the set, rendering it empty. |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace