Revit 2026 API

# ExportLinetypeInfo Methods

---

The ExportLinetypeInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportLinetypeInfo Class

Autodesk.Revit.DB Namespace