Revit 2026 API

# FieldDomainPointsByUV Class

---

Represents a set of two-dimensional point coordinates (defined usually on surface)

SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByUV

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FieldDomainPointsByUV : FieldDomainPoints
```
```vb
Public Class FieldDomainPointsByUV
	Inherits FieldDomainPoints
```
```cpp
public ref class FieldDomainPointsByUV : public FieldDomainPoints
```
```fsharp
type FieldDomainPointsByUV =
    class
        inherit FieldDomainPoints
    end
```

The FieldDomainPointsByUV type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FieldDomainPointsByUV(IListUV) | Initializes a new instance of the FieldDomainPointsByUV class |
|  | FieldDomainPointsByUV(IListUV, ICollectionDouble, ICollectionDouble) | Initializes a new instance of the FieldDomainPointsByUV class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | SetGridCoordinates |  |

#### Reference

Autodesk.Revit.DB.Analysis Namespace