Revit 2026 API

# MemberForces Methods

---

The MemberForces type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

MemberForces Class

Autodesk.Revit.DB.Structure Namespace