Revit 2026 API

# Options Class

---

User preferences for parsing of geometry.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Options : APIObject
```
```vb
Public Class Options
	Inherits APIObject
```
```cpp
public ref class Options : public APIObject
```
```fsharp
type Options =
    class
        inherit APIObject
    end
```

The Options type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Options | Creates a default Options object. |
|  | Options(Options) | Copy constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | ComputeReferences | Determines whether or not references to geometric objects are computed. |
|  | DetailLevel | The detail level for the geometry extracted with these options. |
|  | IncludeNonVisibleObjects | Whether to extract element geometry objects not set as Visible. The default is false. |
|  | View | The view used for geometry extraction. |

|  | Name | Description |
| --- | --- | --- |

This class determines the output of the Element.Geometry property.

#### Reference

Autodesk.Revit.DB Namespace