Revit 2026 API

# WallType Class

---

Represents a specific type of wall, such as 'Generic - 8"'.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBWallType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WallType : HostObjAttributes
```
```vb
Public Class WallType
	Inherits HostObjAttributes
```
```cpp
public ref class WallType : public HostObjAttributes
```
```fsharp
type WallType =
    class
        inherit HostObjAttributes
    end
```

The WallType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Function | The wall function. |
|  | Kind | The nature of the wall. |
|  | ThermalProperties | The calculated and settable thermal properties of the WallType |
|  | Width | The overall thickness of this type of wall. |

|  | Name | Description |
| --- | --- | --- |

All wall type objects available in the project can be retrieved from the Document object via the WallTypes property. Every Wall object has a WallType property that returns the a WallType object representing the type. This same WallType property can also be used to change the type of the wall by setting it to a different type.

#### Reference

Autodesk.Revit.DB Namespace