Revit 2026 API

# ExtensibleStorageFilter Properties

---

The ExtensibleStorageFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SchemaGuid | Schema id used to filter elements with extensible storage data |

#### Reference

ExtensibleStorageFilter Class

Autodesk.Revit.DB.ExtensibleStorage Namespace