Revit 2026 API

# IExporterIFC Methods

---

The IExporterIFC type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportIFC | The method that Revit will invoke to perform an export to IFC. |

#### Reference

IExporterIFC Interface

Autodesk.Revit.DB.IFC Namespace