Revit 2026 API

# KeyBasedTreeEntryError Methods

---

The KeyBasedTreeEntryError type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetEntry | Gets the entry for which an error occurred while building the KeyBasedTreeEntries object. |

#### Reference

KeyBasedTreeEntryError Class

Autodesk.Revit.DB Namespace