Revit 2026 API

# ToggleButton Class

---

The ToggleButton object represents a button that has been added to a RadioButtonGroup.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRibbonButton Autodesk.Revit.UIPushButton Autodesk.Revit.UIToggleButton

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ToggleButton : PushButton
```
```vb
Public Class ToggleButton
	Inherits PushButton
```
```cpp
public ref class ToggleButton : public PushButton
```
```fsharp
type ToggleButton =
    class
        inherit PushButton
    end
```

The ToggleButton type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace