Revit 2026 API

# Phase Class

---

Represents a phase in the life of a building.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBPhase

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Phase : Element
```
```vb
Public Class Phase
	Inherits Element
```
```cpp
public ref class Phase : public Element
```
```fsharp
type Phase =
    class
        inherit Element
    end
```

The Phase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The lifetime of an element within a building can be controlled by using phases. Each element will have a construction phase but only those elements that have a finite lifetime will have a destruction phase. All the phases within a project can be retrieved from the Document object.

#### Reference

Autodesk.Revit.DB Namespace