Revit 2026 API

# LinearDimension Class

---

LinearDimString

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDimension Autodesk.Revit.DBLinearDimension

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LinearDimension : Dimension
```
```vb
Public Class LinearDimension
	Inherits Dimension
```
```cpp
public ref class LinearDimension : public Dimension
```
```fsharp
type LinearDimension =
    class
        inherit Dimension
    end
```

The LinearDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |

#### Reference

Autodesk.Revit.DB Namespace