Revit 2026 API

# RadioButtonGroup Class

---

Represents a group of related buttons in the Ribbon.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRadioButtonGroup

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RadioButtonGroup : RibbonItem
```
```vb
Public Class RadioButtonGroup
	Inherits RibbonItem
```
```cpp
public ref class RadioButtonGroup : public RibbonItem
```
```fsharp
type RadioButtonGroup =
    class
        inherit RibbonItem
    end
```

The RadioButtonGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup. |

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Adds a new ToggleButton to the RadioButtonGroup. |
|  | AddItems |  |
|  | GetItems | Gets the collection of ToggleButtons assigned to the RadioButtonGroup. |

This class contains a collection of ToggleButtons. Only one of the ToggleButtons will appear active at a given time. When a different button is clicked in the UI the current ToggleButton will be changed, and the ToggleButton's external command will be invoked. Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace