Revit 2026 API

# ProjectLocationSetIterator Class

---

An iterator to a project location set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBProjectLocationSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ProjectLocationSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ProjectLocationSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ProjectLocationSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ProjectLocationSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ProjectLocationSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ProjectLocationSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace