Revit 2026 API

# ComboBoxMemberData Class

---

This class contains information necessary to construct a ComboBoxMember.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIComboBoxMemberData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ComboBoxMemberData : RibbonItemData
```
```vb
Public Class ComboBoxMemberData
	Inherits RibbonItemData
```
```cpp
public ref class ComboBoxMemberData : public RibbonItemData
```
```fsharp
type ComboBoxMemberData =
    class
        inherit RibbonItemData
    end
```

The ComboBoxMemberData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComboBoxMemberData | Constructs a new instance of ComboBoxMemberData. |

|  | Name | Description |
| --- | --- | --- |
|  | GroupName | Gets or sets a group name for the ComboBoxMember. |
|  | Image | The image shown on the ComboBoxMember. |
|  | Text | The user-visible text of the ComboBoxMember. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace