Revit 2026 API

# GBXMLExportOptions Class

---

Green Building XML Export options.

SystemObject Autodesk.Revit.DBGBXMLExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GBXMLExportOptions : IDisposable
```
```vb
Public Class GBXMLExportOptions
	Implements IDisposable
```
```cpp
public ref class GBXMLExportOptions : IDisposable
```
```fsharp
type GBXMLExportOptions =
    class
        interface IDisposable
    end
```

The GBXMLExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GBXMLExportOptions | Constructs a new instance of the options used to export a model in gbXML (Green Building XML) format. |

|  | Name | Description |
| --- | --- | --- |
|  | Encoding | **Obsolete.** The encoding options to go into the processing instruction for the exported gbXML file. |
|  | ExportAnalyticalSystems | **Obsolete.** Indicates if the gbXML should contain analytical system elements (e.g., Water Loop, Air System, and Zone Equipment). |
|  | ExportEnergyModelType | **Obsolete.** The energy model type from which gbXML will be exported. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the GBXMLExportOptions |

#### Reference

Autodesk.Revit.DB Namespace