Revit 2026 API

# StructuralSectionAnalysisParams Methods

---

The StructuralSectionAnalysisParams type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

StructuralSectionAnalysisParams Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace