Revit 2026 API

# FabricAreaType Class

---

A FabricAreaType object is used in FabricArea object generation.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureFabricAreaType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricAreaType : ElementType
```
```vb
Public Class FabricAreaType
	Inherits ElementType
```
```cpp
public ref class FabricAreaType : public ElementType
```
```fsharp
type FabricAreaType =
    class
        inherit ElementType
    end
```

The FabricAreaType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultFabricAreaType | Creates a new FabricAreaType object with a default name. |

#### Reference

Autodesk.Revit.DB.Structure Namespace