Revit 2026 API

# ReferencePlane Methods

---

The ReferencePlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Flip | Flips the orientation of the reference plane. |
|  | GetPlane | Returns the geometry plane to which the reference plane is assigned. |
|  | GetReference | Returns the geometry reference of the reference plane. |

#### Reference

ReferencePlane Class

Autodesk.Revit.DB Namespace