Revit 2026 API

# MechanicalEquipment Class

---

Provides access to the Mechanical Equipment in Autodesk Revit MEP.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel Autodesk.Revit.DB.MechanicalMechanicalEquipment

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MechanicalEquipment : MEPModel
```
```vb
Public Class MechanicalEquipment
	Inherits MEPModel
```
```cpp
public ref class MechanicalEquipment : public MEPModel
```
```fsharp
type MechanicalEquipment =
    class
        inherit MEPModel
    end
```

The MechanicalEquipment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The Mechanical Equipment object can only be queried in Autodesk Revit MEP.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace