Revit 2026 API

# SlabShapeCrease Methods

---

The SlabShapeCrease type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SlabShapeCrease Class

Autodesk.Revit.DB Namespace