Revit 2026 API

# DialogBoxShowingEventArgs Properties

---

The DialogBoxShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DialogId | A unique string identifier for DialogBox and TaskDialog type dialogs in Revit. |

#### Reference

DialogBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace