Revit 2026 API

# HasNoValueFilterRule Class

---

Tests whether an element's parameter doesn't have a value.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBParameterValuePresenceRule Autodesk.Revit.DBHasNoValueFilterRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HasNoValueFilterRule : ParameterValuePresenceRule
```
```vb
Public Class HasNoValueFilterRule
	Inherits ParameterValuePresenceRule
```
```cpp
public ref class HasNoValueFilterRule : public ParameterValuePresenceRule
```
```fsharp
type HasNoValueFilterRule =
    class
        inherit ParameterValuePresenceRule
    end
```

The HasNoValueFilterRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HasNoValueFilterRule | constructs an instance of HasNoValueFilterRule. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace