Revit 2026 API

# Panel Class

---

This object represents a curtain panel.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInstance Autodesk.Revit.DBFamilyInstance Autodesk.Revit.DBPanel

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Panel : FamilyInstance
```
```vb
Public Class Panel
	Inherits FamilyInstance
```
```cpp
public ref class Panel : public FamilyInstance
```
```fsharp
type Panel =
    class
        inherit FamilyInstance
    end
```

The Panel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Lockable | This property is used to know whether a panel can be locked. |
|  | PanelType | The Panel style of this Panel. |
|  | Transform | This property is used to find the transform of a curtain panel within project. |

|  | Name | Description |
| --- | --- | --- |
|  | FindHostPanel | Finds the id of the host panel (i.e., wall) associated with this panel. If a host panel is present, then it is displayed instead of the curtain panel. |
|  | GetRefGridLines | This method is used to get the reference gridlines. |

#### Reference

Autodesk.Revit.DB Namespace