Revit 2026 API

# FileSaveDialog Properties

---

The FileSaveDialog type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | InitialFileName | The initial file name to be shown for this save operation. |

#### Reference

FileSaveDialog Class

Autodesk.Revit.UI Namespace