Revit 2026 API

# DetailArc Class

---

Represents a DetailArc within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBDetailCurve Autodesk.Revit.DBDetailArc

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DetailArc : DetailCurve
```
```vb
Public Class DetailArc
	Inherits DetailCurve
```
```cpp
public ref class DetailArc : public DetailCurve
```
```fsharp
type DetailArc =
    class
        inherit DetailCurve
    end
```

The DetailArc type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Currently it's just a place holder for specific type. All the geometry-related functionality is provided by geometry curve object from DetailCurve::geometryCurve property.

#### Reference

Autodesk.Revit.DB Namespace