Revit 2026 API

# AssetPropertyBoolean Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyBoolean

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyBoolean : AssetProperty
```
```vb
Public Class AssetPropertyBoolean
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyBoolean : public AssetProperty
```
```fsharp
type AssetPropertyBoolean =
    class
        inherit AssetProperty
    end
```

The AssetPropertyBoolean type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Visual Namespace