Revit 2026 API

# BuildingOperatingYearSchedule Properties

---

The BuildingOperatingYearSchedule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleName | The name of the schedule. |

#### Reference

BuildingOperatingYearSchedule Class

Autodesk.Revit.DB.Analysis Namespace