Revit 2026 API

# HermiteSplineTangents Methods

---

The HermiteSplineTangents type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

HermiteSplineTangents Class

Autodesk.Revit.DB Namespace