Revit 2026 API

# PresetInitialColor Properties

---

The PresetInitialColor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Preset | The preset value |

#### Reference

PresetInitialColor Class

Autodesk.Revit.DB.Lighting Namespace