Revit 2026 API

# BIMExportOptions Methods

---

The BIMExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

BIMExportOptions Class

Autodesk.Revit.DB Namespace