Revit 2026 API

# SATImportOptions Class

---

The import options used to import SAT format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBSATImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SATImportOptions : BaseImportOptions
```
```vb
Public Class SATImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class SATImportOptions : public BaseImportOptions
```
```fsharp
type SATImportOptions =
    class
        inherit BaseImportOptions
    end
```

The SATImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SATImportOptions | Constructs a new instance of SATImportOptions with default values of all properties. |
|  | SATImportOptions(SATImportOptions) | Constructs a new instance of SATImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace