Revit 2026 API

# LoadNature Methods

---

The LoadNature type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new LoadNature. |

#### Reference

LoadNature Class

Autodesk.Revit.DB.Structure Namespace