Revit 2026 API

# RibbonButtonOptions Class

---

A utility class containing the Revit.ini options settings related to ribbon buttons

SystemObject Autodesk.Revit.UIRibbonButtonOptions

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RibbonButtonOptions : IDisposable
```
```vb
Public Class RibbonButtonOptions
	Implements IDisposable
```
```cpp
public ref class RibbonButtonOptions : IDisposable
```
```fsharp
type RibbonButtonOptions =
    class
        interface IDisposable
    end
```

The RibbonButtonOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RibbonButtonOptions |

#### Reference

Autodesk.Revit.UI Namespace