Revit 2026 API

# RevisionNumberingSequence Properties

---

The RevisionNumberingSequence type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumberType | Indicates the revision number type of the revision numbering sequence. |
|  | SequenceName | The name of this revision numbering sequence. |

#### Reference

RevisionNumberingSequence Class

Autodesk.Revit.DB Namespace