Revit 2026 API

# OutdatedDirectlyOpenedCentralException Methods

---

The OutdatedDirectlyOpenedCentralException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

OutdatedDirectlyOpenedCentralException Class

Autodesk.Revit.Exceptions Namespace