Revit 2026 API

# ViewSheet Class

---

Class for ViewSheet

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBView Autodesk.Revit.DBViewSheet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewSheet : View
```
```vb
Public Class ViewSheet
	Inherits View
```
```cpp
public ref class ViewSheet : public View
```
```fsharp
type ViewSheet =
    class
        inherit View
    end
```

The ViewSheet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPlaceholder | Identifies whether or not the view sheet represents a placeholder sheet. |
|  | SheetCollectionId | The ID of the sheet collection this sheet is associated with. |
|  | SheetNumber | The sheet number of the document. |
|  | SheetTitleBlockId | The Id of the title block this sheet is associated with. |

|  | Name | Description |
| --- | --- | --- |
|  | CanBeDuplicated | Identifies if this sheet can be duplicated. |
|  | ConvertToRealSheet | Converts a placeholder sheet to a real one with an optional titleblock. |
|  | Create | Creates a new ViewSheet. |
|  | CreatePlaceholder | Creates a placeholder sheet in a document. |
|  | DeleteViewport | Removes a viewport from the sheet by deleting it from the document. |
|  | Duplicate(SheetDuplicateOption) | Duplicates this sheet to generate a new one. |
|  | GetAdditionalRevisionIds | Gets the Revisions that are additionally included in the sheet's revision schedules. |
|  | GetAllPlacedViews | Returns the ElementIds of Views placed on this sheet. |
|  | GetAllRevisionCloudIds | Gets the ids of the revision clouds which appear on the sheet's revision schedules. |
|  | GetAllRevisionIds | Gets the ordered array of Revisions which participate in the sheet's revision schedules. |
|  | GetAllViewports | Returns the ElementIds of Viewports on this sheet. |
|  | GetCurrentRevision | Returns the most recent numbered Revision shown on this ViewSheet. |
|  | GetRevisionCloudNumberOnSheet | Gets the Revision Number for a RevisionCloud on this sheet. |
|  | GetRevisionNumberOnSheet | Gets the Revision Number for a particular Revision as it will appear on this sheet. |
|  | SetAdditionalRevisionIds |  |

#### Reference

Autodesk.Revit.DB Namespace