Revit 2026 API

# SelectionUIOptions Methods

---

The SelectionUIOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | ElementSelectsAsPinned | Checks whether the specified element will be treated as pinned for the purposes of selection. |
|  | GetSelectionUIOptions | Returns the current user's SelectionOptions. |

#### Reference

SelectionUIOptions Class

Autodesk.Revit.UI Namespace