Revit 2026 API

# FaceArrayIterator Methods

---

The FaceArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

FaceArrayIterator Class

Autodesk.Revit.DB Namespace