Revit 2026 API

# DoubleArray Class

---

An array that contains doubles.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDoubleArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DoubleArray : APIObject,
	IEnumerable
```
```vb
Public Class DoubleArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class DoubleArray : public APIObject,
	IEnumerable
```
```fsharp
type DoubleArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The DoubleArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DoubleArray | Initializes a new instance of the DoubleArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a double at a specified index within the array. |
|  | Size | Returns the number of doubles that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every double from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace