Revit 2026 API

# AssetSet Properties

---

The AssetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty |  |
|  | Size |  |

#### Reference

AssetSet Class

Autodesk.Revit.DB.Visual Namespace