Revit 2026 API

# ModelCurveArrayIterator Properties

---

The ModelCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ModelCurveArrayIterator Class

Autodesk.Revit.DB Namespace