Revit 2026 API

# RepeaterCoordinates Methods

---

The RepeaterCoordinates type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCoordinate | Returns the coordinate in the given dimension. |

#### Reference

RepeaterCoordinates Class

Autodesk.Revit.DB Namespace