Revit 2026 API

# BuildingOperatingDaySchedule Properties

---

The BuildingOperatingDaySchedule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleName | The name of the schedule. |

#### Reference

BuildingOperatingDaySchedule Class

Autodesk.Revit.DB.Analysis Namespace