Revit 2026 API

# FabricationAncillaryUsage Methods

---

The FabricationAncillaryUsage type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FabricationAncillaryUsage Class

Autodesk.Revit.DB Namespace