Revit 2026 API

# VertexFormat Methods

---

The VertexFormat type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsValid | Tests whether the vertex format specification is valid for rendering. |

#### Reference

VertexFormat Class

Autodesk.Revit.DB.DirectContext3D Namespace