Revit 2026 API

# AnalysisDisplayDeformedShapeSettings Methods

---

The AnalysisDisplayDeformedShapeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two deformed shape settings objects. |

#### Reference

AnalysisDisplayDeformedShapeSettings Class

Autodesk.Revit.DB.Analysis Namespace