Revit 2026 API

# PathReinSpanSymbol Class

---

Represents a Path Reinforcement Span Symbol element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBIndependentTag Autodesk.Revit.DB.StructurePathReinSpanSymbol

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PathReinSpanSymbol : IndependentTag
```
```vb
Public Class PathReinSpanSymbol
	Inherits IndependentTag
```
```cpp
public ref class PathReinSpanSymbol : public IndependentTag
```
```fsharp
type PathReinSpanSymbol =
    class
        inherit IndependentTag
    end
```

The PathReinSpanSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of PathReinSpanSymbol in the project. |

#### Reference

Autodesk.Revit.DB.Structure Namespace