Revit 2026 API

# SelectionFilterElement Class

---

A filter element that stores an explicit list of ElementIds. Only elements whose ElementIds are in this list will pass the filter.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBFilterElement Autodesk.Revit.DBSelectionFilterElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SelectionFilterElement : FilterElement
```
```vb
Public Class SelectionFilterElement
	Inherits FilterElement
```
```cpp
public ref class SelectionFilterElement : public FilterElement
```
```fsharp
type SelectionFilterElement =
    class
        inherit FilterElement
    end
```

The SelectionFilterElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddSet |  |
|  | AddSingle | Adds a single ElementId to the filter's set. |
|  | Clear | Removes all ElementIds from the filter. |
|  | Contains | Returns true if the given ElementId is a member of this filter's set. |
|  | Create | Creates a new SelectionFilterElement in the given document. |
|  | GetElementIds | Returns the set of ElementIds contained by this filter. |
|  | IsEmpty | Determines whether this filter's set is empty or not. |
|  | RemoveSet |  |
|  | RemoveSingle | Removes a single ElementId from the filter's set. |
|  | SetElementIds |  |

#### Reference

Autodesk.Revit.DB Namespace