Revit 2026 API

# ElementParameterFilter Class

---

A filter used to match elements by one or more parameter filter rules.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBElementParameterFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementParameterFilter : ElementSlowFilter
```
```vb
Public Class ElementParameterFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class ElementParameterFilter : public ElementSlowFilter
```
```fsharp
type ElementParameterFilter =
    class
        inherit ElementSlowFilter
    end
```

The ElementParameterFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementParameterFilter(FilterRule) | Constructs a new instance of an ElementParameterFilter from a single rule. |
|  | ElementParameterFilter(IListFilterRule) | Initializes a new instance of the ElementParameterFilter class |
|  | ElementParameterFilter(FilterRule, Boolean) | Constructs a new instance of an ElementParameterFilter, with the option to match all elements not passing a given filter rule. |
|  | ElementParameterFilter(IListFilterRule, Boolean) | Initializes a new instance of the ElementParameterFilter class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetRules | Returns the set of rules contained in this filter. |

This filter is a slow filter. Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple this filter with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace