Revit 2026 API

# RibbonItemData Methods

---

The RibbonItemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetContextualHelp | Gets the contextual help bound with this control. |
|  | SetContextualHelp | Sets the contextual help bound with this button data. |

#### Reference

RibbonItemData Class

Autodesk.Revit.UI Namespace