Revit 2026 API

# ImageView Methods

---

The ImageView type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create an ImageView containing an image imported from disk. |

#### Reference

ImageView Class

Autodesk.Revit.DB Namespace