Revit 2026 API

# DWGExportOptions Properties

---

The DWGExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MergedViews | Whether to merge all views in one file (via XRefs). Default value is false for mergedViews. |

#### Reference

DWGExportOptions Class

Autodesk.Revit.DB Namespace