Revit 2026 API

# TextNoteOptions Class

---

Options to use when creating a new text note element.

SystemObject Autodesk.Revit.DBTextNoteOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TextNoteOptions : IDisposable
```
```vb
Public Class TextNoteOptions
	Implements IDisposable
```
```cpp
public ref class TextNoteOptions : IDisposable
```
```fsharp
type TextNoteOptions =
    class
        interface IDisposable
    end
```

The TextNoteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TextNoteOptions | Default constructor; populates the options with their respective default values. |
|  | TextNoteOptions(ElementId) | Constructs text options to create text of the given type. |

|  | Name | Description |
| --- | --- | --- |
|  | HorizontalAlignment | Horizontal alignment of the text. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | KeepRotatedTextReadable | Flag controling whether a rotate text is to stay oriented to be always readable. |
|  | Rotation | Base line angle of a text note, in radians. |
|  | TypeId | Id of a text type that defines the style of a text note. |
|  | VerticalAlignment | Vertical alignment of the text. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TextNoteOptions |

Use an instance of this class as an argument in the TextNote.Create methods.

#### Reference

Autodesk.Revit.DB Namespace