Revit 2026 API

# RadioButtonGroup Properties

---

The RadioButtonGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Gets or sets the current checked ToggleButton of the RadioButtonGroup. |

#### Reference

RadioButtonGroup Class

Autodesk.Revit.UI Namespace