Revit 2026 API

# ElementIdSetFilter Class

---

A filter wrapping a set of elements.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementIdSetFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementIdSetFilter : ElementQuickFilter
```
```vb
Public Class ElementIdSetFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementIdSetFilter : public ElementQuickFilter
```
```fsharp
type ElementIdSetFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementIdSetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementIdSetFilter | Initializes a new instance of the ElementIdSetFilter class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetIdsToInclude | Returns the ids of this filter. |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace