Revit 2026 API

# ParameterValueProvider Properties

---

The ParameterValueProvider type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Parameter | The parameter used to provide a string, integer, double-precision, or ElementId value on request for a given element. |

#### Reference

ParameterValueProvider Class

Autodesk.Revit.DB Namespace