Revit 2026 API

# PipeInsulation Class

---

Represents insulation applied to the outside of a given pipe, fitting or content.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DBInsulationLiningBase Autodesk.Revit.DB.PlumbingPipeInsulation

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeInsulation : InsulationLiningBase
```
```vb
Public Class PipeInsulation
	Inherits InsulationLiningBase
```
```cpp
public ref class PipeInsulation : public InsulationLiningBase
```
```fsharp
type PipeInsulation =
    class
        inherit InsulationLiningBase
    end
```

The PipeInsulation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of pipe insulation. |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace