Revit 2026 API

# ElementIdParameterValue Properties

---

The ElementIdParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

#### Reference

ElementIdParameterValue Class

Autodesk.Revit.DB Namespace