Revit 2026 API

# IFCCategoryTemplate Properties

---

The IFCCategoryTemplate type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidCategoryMappingFile | Whether or not the category mapping file is valid. |

#### Reference

IFCCategoryTemplate Class

Autodesk.Revit.DB Namespace