Revit 2026 API

# IndexStreamPoint Class

---

A stream that can be used to write IndexPoint primitives into an IndexBuffer

SystemObject Autodesk.Revit.DB.DirectContext3DIndexStream Autodesk.Revit.DB.DirectContext3DIndexStreamPoint

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexStreamPoint : IndexStream
```
```vb
Public Class IndexStreamPoint
	Inherits IndexStream
```
```cpp
public ref class IndexStreamPoint : public IndexStream
```
```fsharp
type IndexStreamPoint =
    class
        inherit IndexStream
    end
```

The IndexStreamPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddPoint | Inserts a IndexPoint into the stream and associated buffer. |
|  | AddPoints |  |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace