Revit 2026 API

# FilterNumericGreater Class

---

Tests whether numeric values from the document are greater than a certain value

SystemObject Autodesk.Revit.DBFilterNumericRuleEvaluator Autodesk.Revit.DBFilterNumericGreater

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericGreater : FilterNumericRuleEvaluator
```
```vb
Public Class FilterNumericGreater
	Inherits FilterNumericRuleEvaluator
```
```cpp
public ref class FilterNumericGreater : public FilterNumericRuleEvaluator
```
```fsharp
type FilterNumericGreater =
    class
        inherit FilterNumericRuleEvaluator
    end
```

The FilterNumericGreater type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericGreater | Constructs an instance of FilterNumericGreater. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace