Revit 2026 API

# AnalysisDisplayColoredSurfaceSettings Methods

---

The AnalysisDisplayColoredSurfaceSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two colored surface settings objects. |

#### Reference

AnalysisDisplayColoredSurfaceSettings Class

Autodesk.Revit.DB.Analysis Namespace