Revit 2026 API

# DefinitionGroup Properties

---

The DefinitionGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Definitions | The Definitions property returns an object that contains all the shared parameter definitions within the group. |
|  | Name | Returns the name of the parameter group. |

#### Reference

DefinitionGroup Class

Autodesk.Revit.DB Namespace