Revit 2026 API

# ExternalResourceSubFolder Methods

---

The ExternalResourceSubFolder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExternalResourceSubFolder Class

Autodesk.Revit.DB Namespace