Revit 2026 API

# BasePoint Methods

---

The BasePoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetProjectBasePoint | Gets the project base point for the document. |
|  | GetSurveyPoint | Gets the survey point for the document. |

#### Reference

BasePoint Class

Autodesk.Revit.DB Namespace