Revit 2026 API

# Construction Class

---

Construction definition for Project Information.

SystemObject Autodesk.Revit.DBConstruction

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Construction
```
```vb
Public Class Construction
```
```cpp
public ref class Construction
```
```fsharp
type Construction = class end
```

The Construction type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | Get the id of the Construction. |
|  | Name | Get the name of the Construction. |

|  | Name | Description |
| --- | --- | --- |

This is used to define the information in Constructions.xml.

#### Reference

Autodesk.Revit.DB Namespace