Revit 2026 API

# DeleteElements Methods

---

The DeleteElements type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId) | Creates an instance of the DeleteElements resolution. |
|  | Create(Document, IListElementId) |  |
|  | Create(Document, ISetElementId) |  |

#### Reference

DeleteElements Class

Autodesk.Revit.DB Namespace