Revit 2026 API

# VertexIndexPairArrayIterator Properties

---

The VertexIndexPairArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

VertexIndexPairArrayIterator Class

Autodesk.Revit.DB Namespace