Revit 2026 API

# Zone Class

---

A zone is a collection of one or more spaces.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.MechanicalZone

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Zone : Element
```
```vb
Public Class Zone
	Inherits Element
```
```cpp
public ref class Zone : public Element
```
```fsharp
type Zone =
    class
        inherit Element
    end
```

The Zone type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Area | Get the Area of the Zone. |
|  | Boundary | Returns the boundary of the Zone. |
|  | CalculatedCoolingLoad | **Obsolete.** Get the Calculated Cooling Load of the Zone. |
|  | CalculatedHeatingLoad | **Obsolete.** Get the Calculated Heating Load of the Zone. |
|  | CalculatedSupplyAirflow | **Obsolete.** Get the Calculated Supply Airflow of the Zone. |
|  | CoolingAirTemperature | **Obsolete.** Get or set the Cooling Air Temperature of the Zone. |
|  | CoolingSetPoint | **Obsolete.** Get or set the Cooling Set Point of the Zone. |
|  | DehumidificationSetPoint | **Obsolete.** Get or set the DeHumidification Set Point of the Zone. |
|  | GrossArea | **Obsolete.** Get the Gross Area of the Zone. |
|  | GrossVolume | **Obsolete.** Get the Gross Volume of the Zone. |
|  | HeatingAirTemperature | **Obsolete.** Get or set the Heating Air Temperature of the Zone. |
|  | HeatingSetPoint | **Obsolete.** Get or set the Heating Set Point of the Zone. |
|  | HumidificationSetPoint | **Obsolete.** Get or set the Humidification Set Point of the Zone. |
|  | IsDefaultZone | **Obsolete.** Reports whether this zone is default or not. |
|  | Name | Get or Set the Name of the Zone.(Overrides ElementName) |
|  | Perimeter | **Obsolete.** Get the Perimeter of the Zone. |
|  | Phase | Get the Phase of the Zone. |
|  | ServiceType | **Obsolete.** Get or set the Service Type of the Zone. |
|  | Spaces | Get the Spaces of the Zone. |
|  | Volume | **Obsolete.** Get the Volume of the Zone. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSpaces | **Obsolete.** Add a set of existing spaces to Zone element. |
|  | CreateAreaBasedLoad | Creates a new instance of an area based load and adds it to the document. |
|  | GetDomainData | Gets the domain data for the zone. |
|  | RemoveSpaces | **Obsolete.** Remove a set of existing spaces to the current Zone element. |

The concept of zones is central to the way in which engineers design HVAC systems. When you are designing HVAC systems, you relate to zones as spaces that are under the same thermostatic control. Conceptually, zones are an arbitrary set of areas or volumes within a building that is controlled by one thermostat. An area based load is a collection of one or more electrical load areas. When it has the AreaBasedLoadData, it is an area based load, otherwise, it is a zone.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace