Revit 2026 API

# ElementCategoryFilter Class

---

A filter used to match elements by their category.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementCategoryFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementCategoryFilter : ElementQuickFilter
```
```vb
Public Class ElementCategoryFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementCategoryFilter : public ElementQuickFilter
```
```fsharp
type ElementCategoryFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementCategoryFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementCategoryFilter(BuiltInCategory) | Constructs a new instance of a filter to match elements by category. |
|  | ElementCategoryFilter(ElementId) | Constructs a new instance of a filter to match elements by category. |
|  | ElementCategoryFilter(BuiltInCategory, Boolean) | Constructs a new instance of a filter to match elements by category, with the option to match all elements which are not of the given category. |
|  | ElementCategoryFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements by category, with the option to match all elements which are of the given category. |

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId | The category id. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace