Revit 2026 API

# ReferenceArrayArray Class

---

An array that contains ReferenceArray objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReferenceArrayArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReferenceArrayArray : APIObject,
	IEnumerable
```
```vb
Public Class ReferenceArrayArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ReferenceArrayArray : public APIObject,
	IEnumerable
```
```fsharp
type ReferenceArrayArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ReferenceArrayArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferenceArrayArray | Initializes a new instance of the ReferenceArrayArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a ReferenceArray at a specified index within the array. |
|  | Size | Returns the number of ReferenceArrays that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every ReferenceArray from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace