Revit 2026 API

# CannotOpenBothCentralAndLocalException Methods

---

The CannotOpenBothCentralAndLocalException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CannotOpenBothCentralAndLocalException Class

Autodesk.Revit.Exceptions Namespace