Revit 2026 API

# ElementFilter Methods

---

The ElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | PassesFilter(Element) | Applies the filter to a given element. |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. |

#### Reference

ElementFilter Class

Autodesk.Revit.DB Namespace