Revit 2026 API

# AnalyticalLink Class

---

An analytical link element that is used to create connections between other Analytical Elements.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureAnalyticalLink

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalyticalLink : Element
```
```vb
Public Class AnalyticalLink
	Inherits Element
```
```cpp
public ref class AnalyticalLink : public Element
```
```fsharp
type AnalyticalLink =
    class
        inherit Element
    end
```

The AnalyticalLink type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | End | The point at the end of the AnalyticalLink. |
|  | EndHubId | Hub ID at end of AnalyticalLink. |
|  | OwnerId | ElementId of Analytical Element which created the AnalyticalLink (if any) invalidElementId if this Analytical Link was created by the User or API |
|  | Start | The point at the start of the AnalyticalLink. |
|  | StartHubId | Hub ID at start of AnalyticalLink. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a AnalyticalLink element between two Hubs. |
|  | IsAutoGenerated | Specifies whether or not an AnalyticalLink was created by an Analytical Element. |
|  | IsValidHub | Checks whether input hub is valid for an AnalyticalLink. |

#### Reference

Autodesk.Revit.DB.Structure Namespace