Revit 2026 API

# SpaceTagFilter Class

---

A filter used to match space tags.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DB.MechanicalSpaceTagFilter

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpaceTagFilter : ElementSlowFilter
```
```vb
Public Class SpaceTagFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class SpaceTagFilter : public ElementSlowFilter
```
```fsharp
type SpaceTagFilter =
    class
        inherit ElementSlowFilter
    end
```

The SpaceTagFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SpaceTagFilter | Constructs a filter which matches only spaces. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace