Revit 2026 API

# FamilyParameterSetIterator Properties

---

The FamilyParameterSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

FamilyParameterSetIterator Class

Autodesk.Revit.DB Namespace