Revit 2026 API

# ElementLevelFilter Properties

---

The ElementLevelFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LevelId | The id of the level that will be matched to elements' associated level. |

#### Reference

ElementLevelFilter Class

Autodesk.Revit.DB Namespace