Revit 2026 API

# Wall Class

---

Represents a wall in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBWall

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Wall : HostObject
```
```vb
Public Class Wall
	Inherits HostObject
```
```cpp
public ref class Wall : public HostObject
```
```fsharp
type Wall =
    class
        inherit HostObject
    end
```

The Wall type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CrossSection | Gets or sets the Cross-section for this wall. |
|  | CurtainGrid | Get the grid object of a curtain wall |
|  | Flipped | Property to test whether the wall orientation is flipped. |
|  | IsStackedWall | Identifies if the wall is a stacked wall. |
|  | IsStackedWallMember | Identifies if the wall is a member of a stacked wall. |
|  | Orientation | The outward-facing normal vector of the exterior side face at the starting point of the wall. |
|  | SketchId | Returns id of the profile sketch, or invalidElementId if sketch does not exist. |
|  | StackedWallOwnerId | Gets the stacked wall which contains this stacked wall member. |
|  | StructuralUsage | Retrieves or changes the wall's designated structural usage. |
|  | WallType | Retrieves or changes the type of the wall. |
|  | Width | Get the overall thickness of the wall. |

|  | Name | Description |
| --- | --- | --- |
|  | AddAttachment | Attaches the wall to the target. If an attachment already exists with the same "attachmentLocation" value, an exception is thrown. The target should be a roof, floor, ceiling, toposolid, or other wall. |
|  | AllowWrappingAtLocation | Allow end wrapping at the location. |
|  | CanHaveProfileSketch | Checks whether this wall has or can have a profile sketch. |
|  | Create(Document, IListCurve, Boolean) |  |
|  | Create(Document, Curve, ElementId, Boolean) | Creates a new rectangular profile wall within the project using the default wall style. |
|  | Create(Document, IListCurve, ElementId, ElementId, Boolean) |  |
|  | Create(Document, IListCurve, ElementId, ElementId, Boolean, XYZ) |  |
|  | Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean) | Creates a new rectangular profile wall within the project using the specified wall type, height, and offset. |
|  | CreateProfileSketch | Creates a new Wall profile Sketch. |
|  | DisallowWrappingAtLocation | Disallow end wrapping at the location. |
|  | Flip | The wall orientation will be flipped. |
|  | GetAttachmentIds | Gets the ids of the target elements that are attached to the Wall. |
|  | GetStackedWallMemberIds | Get the sub walls which belongs to the wall. |
|  | GetValidWrappingLocationIndices | Gets all valid locations for end wrapping. |
|  | GetWrappingLocationAsCurveParameter | Gets the non-normalized (actual) curve parameter of the location. |
|  | GetWrappingLocationAsReferences | Gets an array of references to faces at the location. |
|  | IsValidTargetAttachment | Says whether the element id can be used as a target for a new attachment. |
|  | IsWallCrossSectionValid | Checks whether the desired cross section is valid for the current wall. |
|  | IsWrappingAtLocationAllowed | If end wrapping is allowed at the location. |
|  | RemoveAttachment(ElementId) | Removes any attachment of the wall to the specified target. |
|  | RemoveAttachment(ElementId, AttachmentLocation) | Removes an attachment at the top or base of a wall, if there is one. |
|  | RemoveProfileSketch | Reverts an edited wall to its original shape. |

The wall object represents all the different kinds of walls in Revit.

#### Reference

Autodesk.Revit.DB Namespace