Revit 2026 API

# ICodeCheckingParameterServer Methods

---

The ICodeCheckingParameterServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PerformCodeChecking | The server's method that will be called when Revit User clicks the Code Checking parameter's button from the properties palette. |

#### Reference

ICodeCheckingParameterServer Interface

Autodesk.Revit.DB.Structure Namespace