Revit 2026 API

# AnalysisDisplayMarkersAndTextSettings Methods

---

The AnalysisDisplayMarkersAndTextSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two colored surface settings objects. |

#### Reference

AnalysisDisplayMarkersAndTextSettings Class

Autodesk.Revit.DB.Analysis Namespace