Revit 2026 API

# VertexStreamPosition Class

---

A stream that can be used to write vertices of type VertexPosition into a buffer (see VertexBuffer).

SystemObject Autodesk.Revit.DB.DirectContext3DVertexStream Autodesk.Revit.DB.DirectContext3DVertexStreamPosition

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexStreamPosition : VertexStream
```
```vb
Public Class VertexStreamPosition
	Inherits VertexStream
```
```cpp
public ref class VertexStreamPosition : public VertexStream
```
```fsharp
type VertexStreamPosition =
    class
        inherit VertexStream
    end
```

The VertexStreamPosition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPosition into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace