Revit 2026 API

# WireMaterialTypeSet Class

---

A set that contains wire material types.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireMaterialTypeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WireMaterialTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class WireMaterialTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class WireMaterialTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type WireMaterialTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The WireMaterialTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireMaterialTypeSet | Initializes a new instance of the WireMaterialTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of wire material types that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every wire material type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a wire material type within the set. |
|  | Erase | Removes a specified wire material type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified wire material type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace