Revit 2026 API

# ColorWithTransparency Class

---

Color with transparency

SystemObject Autodesk.Revit.DBColorWithTransparency

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ColorWithTransparency : IDisposable
```
```vb
Public Class ColorWithTransparency
	Implements IDisposable
```
```cpp
public ref class ColorWithTransparency : IDisposable
```
```fsharp
type ColorWithTransparency =
    class
        interface IDisposable
    end
```

The ColorWithTransparency type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ColorWithTransparency | color |
|  | ColorWithTransparency(UInt32, UInt32, UInt32, UInt32) | color |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ColorWithTransparency |
|  | GetBlue | get blue |
|  | GetColor | get color |
|  | GetGreen | get green |
|  | GetRed | get red |
|  | GetTransparency | get transparency |
|  | SetBlue | set blue |
|  | SetColor | set color |
|  | SetGreen | set green |
|  | SetRed | set red |
|  | SetTransparency | set transparency |

#### Reference

Autodesk.Revit.DB Namespace