Revit 2026 API

# FailureDefinitionId Class

---

The unique identifier of a FailureDefinition.

SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DBFailureDefinitionId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailureDefinitionId : GuidEnum
```
```vb
Public Class FailureDefinitionId
	Inherits GuidEnum
```
```cpp
public ref class FailureDefinitionId : public GuidEnum
```
```fsharp
type FailureDefinitionId =
    class
        inherit GuidEnum
    end
```

The FailureDefinitionId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FailureDefinitionId | Creates a new FailureDefinitionId instance. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(FailureDefinitionId, FailureDefinitionId) | Compares two FailureDefinitionId instances. |
|  | Inequality(FailureDefinitionId, FailureDefinitionId) | Compares two FailureDefinitionId instances. |

Each possible failure in Revit must be defined and registered during Revit application startup by creating a FailureDefinition object. Unique FailureDefinitionId must be used as a key to register FailureDefinition. Those unique FailureDefinitionId should be created using GUID generation tool. Later FailureDefinitionId can be used to lookup FailureDefinition in FailureDefinitionRegistry, and create and post FailureMessages.

#### Reference

Autodesk.Revit.DB Namespace