Revit 2026 API

# AssetPropertyEnum Properties

---

The AssetPropertyEnum type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

#### Reference

AssetPropertyEnum Class

Autodesk.Revit.DB.Visual Namespace