Revit 2026 API

# FloorType Class

---

An object that specifies the type of a floor in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBFloorType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FloorType : HostObjAttributes
```
```vb
Public Class FloorType
	Inherits HostObjAttributes
```
```cpp
public ref class FloorType : public HostObjAttributes
```
```fsharp
type FloorType =
    class
        inherit HostObjAttributes
    end
```

The FloorType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsFoundationSlab | Returns whether the element FloorAttributes type is FoundationSlab. |
|  | StructuralMaterialId | Returns the identifier of the material that defines the element's structural analysis properties. |
|  | ThermalProperties | The calculated and settable thermal properties of the FloorType |

|  | Name | Description |
| --- | --- | --- |

The structural layers of the floor can be accessed via this object.

#### Reference

Autodesk.Revit.DB Namespace