Revit 2026 API

# FootPrintRoof Methods

---

The FootPrintRoof type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetProfiles | Retrieve all the curveLoops of FootPrintRoof. |

#### Reference

FootPrintRoof Class

Autodesk.Revit.DB Namespace