Revit 2026 API

# LoadBase Methods

---

The LoadBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsOrientToPermitted | Indicates if the provided orientation is permitted for this load. |
|  | RemoveHostConstraint | Removes constraint from host for this load. |

#### Reference

LoadBase Class

Autodesk.Revit.DB.Structure Namespace