Revit 2026 API

# AssetSet Class

---

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.VisualAssetSet

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetSet : APIObject, IEnumerable
```
```vb
Public Class AssetSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class AssetSet : public APIObject,
	IEnumerable
```
```fsharp
type AssetSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The AssetSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssetSet | Initializes a new instance of the AssetSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty |  |
|  | Size |  |

|  | Name | Description |
| --- | --- | --- |
|  | Clear |  |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator |  |
|  | GetEnumerator |  |
|  | Insert |  |
|  | ReverseIterator |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace