Revit 2026 API

# WorksetKindFilter Properties

---

The WorksetKindFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WorksetKind | The WorksetKind. |

#### Reference

WorksetKindFilter Class

Autodesk.Revit.DB Namespace