Revit 2026 API

# CentralModelContentionException Properties

---

The CentralModelContentionException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentUser | Retrieves current user name. |

#### Reference

CentralModelContentionException Class

Autodesk.Revit.Exceptions Namespace