Revit 2026 API

# ToposolidType Class

---

An object that specifies the type of a Toposolid in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBToposolidType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ToposolidType : HostObjAttributes
```
```vb
Public Class ToposolidType
	Inherits HostObjAttributes
```
```cpp
public ref class ToposolidType : public HostObjAttributes
```
```fsharp
type ToposolidType =
    class
        inherit HostObjAttributes
    end
```

The ToposolidType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetContourSetting | Get the contour setting object from the current toposolid type. |
|  | SetContourSettting | Set the contour setting for the current toposolid type by copying from an existing contour setting object. |

#### Reference

Autodesk.Revit.DB Namespace