Revit 2026 API

# FabricReinSpanSymbol Methods

---

The FabricReinSpanSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View. |

#### Reference

FabricReinSpanSymbol Class

Autodesk.Revit.DB.Structure Namespace