Revit 2026 API

# IndexStreamLine Methods

---

The IndexStreamLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddLine | Inserts a IndexLine segment into the stream and associated buffer. |
|  | AddLines |  |

#### Reference

IndexStreamLine Class

Autodesk.Revit.DB.DirectContext3D Namespace