Revit 2026 API

# CurtainGridSetIterator Class

---

An iterator to a set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurtainGridSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CurtainGridSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CurtainGridSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CurtainGridSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CurtainGridSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CurtainGridSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGridSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace