Revit 2026 API

# ElementFilter Class

---

A base class for a type of filter that accepts or rejects elements based upon criteria.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementLogicalFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementSlowFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementFilter : IDisposable
```
```vb
Public Class ElementFilter
	Implements IDisposable
```
```cpp
public ref class ElementFilter : IDisposable
```
```fsharp
type ElementFilter =
    class
        interface IDisposable
    end
```

The ElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Inverted | True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ElementFilter |
|  | PassesFilter(Element) | Applies the filter to a given element. |
|  | PassesFilter(Document, ElementId) | Applies the filter to a given element. |

#### Reference

Autodesk.Revit.DB Namespace