Revit 2026 API

# AnnotationSymbol Class

---

This object represents a symbol of the Generic Annotation.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBInstance Autodesk.Revit.DBFamilyInstance Autodesk.Revit.DBAnnotationSymbol

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnnotationSymbol : FamilyInstance
```
```vb
Public Class AnnotationSymbol
	Inherits FamilyInstance
```
```cpp
public ref class AnnotationSymbol : public FamilyInstance
```
```fsharp
type AnnotationSymbol =
    class
        inherit FamilyInstance
    end
```

The AnnotationSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnnotationSymbolType | The AnnotationSymbol style of this AnnotationSymbol. |

|  | Name | Description |
| --- | --- | --- |
|  | addLeader | add a leader to this annotation symbol. |
|  | duplicate | Duplicate this annotation symbol. |
|  | GetLeaders | Returns a collection of leaders currently attached to the annotation. |
|  | removeLeader | remove a leader of this annotation symbol. |

#### Reference

Autodesk.Revit.DB Namespace