Revit 2026 API

# RebarCoverType Class

---

A named value for a clear cover distance.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureRebarCoverType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarCoverType : ElementType
```
```vb
Public Class RebarCoverType
	Inherits ElementType
```
```cpp
public ref class RebarCoverType : public ElementType
```
```fsharp
type RebarCoverType =
    class
        inherit ElementType
    end
```

The RebarCoverType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CoverDistance | A distance that can be used as a concrete cover value in a document. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new CoverType in the document. |

In Revit Structure, CoverTypes are the rows in the Rebar Cover Settings dialog.

#### Reference

Autodesk.Revit.DB.Structure Namespace