Revit 2026 API

# SaveOptions Class

---

This class contains options available for saving a document to disk.

SystemObject Autodesk.Revit.DBSaveOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SaveOptions : IDisposable
```
```vb
Public Class SaveOptions
	Implements IDisposable
```
```cpp
public ref class SaveOptions : IDisposable
```
```fsharp
type SaveOptions =
    class
        interface IDisposable
    end
```

The SaveOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SaveOptions | Default constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | Compact | Default is false: let the OS eliminate as much or as little dead data as it wants to. True: force the OS to eliminate all dead data from the file on disk. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | PreviewViewId | The view id that will be used to generate the preview; this id is not saved to the document's permanent settings. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SaveOptions |

#### Reference

Autodesk.Revit.DB Namespace