Revit 2026 API

# ImportIFCOptions Methods

---

The ImportIFCOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetImportIFCOptions | Returns the current Revit instance's ImportIFCOptions. |

#### Reference

ImportIFCOptions Class

Autodesk.Revit.DB Namespace