Revit 2026 API

# Ellipse Class

---

A whole or partial ellipse.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBEllipse

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Ellipse : Curve
```
```vb
Public Class Ellipse
	Inherits Curve
```
```cpp
public ref class Ellipse : public Curve
```
```fsharp
type Ellipse =
    class
        inherit Curve
    end
```

The Ellipse type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Center | Returns the center of the ellipse. |
|  | Normal | Returns the normal to the plane in which the ellipse is defined. |
|  | RadiusX | Returns the X vector radius of the ellipse. |
|  | RadiusY | Returns the Y vector radius of the ellipse. |
|  | XDirection | The X direction. |
|  | YDirection | The Y direction. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateCurve | Creates a new geometric ellipse or elliptical arc object. |

#### Reference

Autodesk.Revit.DB Namespace