Revit 2026 API

# IndexPrimitive Class

---

The base class for index buffer primitives.

SystemObject Autodesk.Revit.DB.DirectContext3DIndexPrimitive Autodesk.Revit.DB.DirectContext3DIndexLine Autodesk.Revit.DB.DirectContext3DIndexPoint Autodesk.Revit.DB.DirectContext3DIndexTriangle

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexPrimitive : IDisposable
```
```vb
Public Class IndexPrimitive
	Implements IDisposable
```
```cpp
public ref class IndexPrimitive : IDisposable
```
```fsharp
type IndexPrimitive =
    class
        interface IDisposable
    end
```

The IndexPrimitive type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IndexPrimitive |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace