Revit 2026 API

# GroupSetIterator Properties

---

The GroupSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

GroupSetIterator Class

Autodesk.Revit.DB Namespace