Revit 2026 API

# RebarSpliceOptions Class

---

This class encapsulates the options for the rebar splice operation.

SystemObject Autodesk.Revit.DB.StructureRebarSpliceOptions

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarSpliceOptions : IDisposable
```
```vb
Public Class RebarSpliceOptions
	Implements IDisposable
```
```cpp
public ref class RebarSpliceOptions : IDisposable
```
```fsharp
type RebarSpliceOptions =
    class
        interface IDisposable
    end
```

The RebarSpliceOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RebarSpliceOptions | Constructs a RebarSpliceOptions |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SplicePosition | Identifies the splice line position. |
|  | SpliceTypeId | Identifies the id of the Rebar Splice Type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarSpliceOptions |

#### Reference

Autodesk.Revit.DB.Structure Namespace