Revit 2026 API

# BuildingOperatingDaySchedule Class

---

Represents the operating schedule of a 24 hour day.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisBuildingOperatingDaySchedule

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BuildingOperatingDaySchedule : Element
```
```vb
Public Class BuildingOperatingDaySchedule
	Inherits Element
```
```cpp
public ref class BuildingOperatingDaySchedule : public Element
```
```fsharp
type BuildingOperatingDaySchedule =
    class
        inherit Element
    end
```

The BuildingOperatingDaySchedule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleName | The name of the schedule. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a BuildingOperatingDaySchedule. |
|  | GetValueForHour | Gets the usage value for an hour. |
|  | SetValueForHour | Sets the usage value for an hour. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace