Revit 2026 API

# ExternalResourceSubFolder Class

---

Data that describes a remote folder to be shown in the file browser dialog

SystemObject Autodesk.Revit.DBExternalResourceSubFolder

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceSubFolder : IDisposable
```
```vb
Public Class ExternalResourceSubFolder
	Implements IDisposable
```
```cpp
public ref class ExternalResourceSubFolder : IDisposable
```
```fsharp
type ExternalResourceSubFolder =
    class
        interface IDisposable
    end
```

The ExternalResourceSubFolder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalResourceSubFolder | Constructs a new ExternalResourceSubFolder with default values for folder name and icon path. |
|  | ExternalResourceSubFolder(String, String) | Constructs a new ExternalResourceSubFolder with custom values for folder name and icon path. |

|  | Name | Description |
| --- | --- | --- |
|  | FolderName | Folder displayed name. |
|  | IconPath | The path of the resource icon. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalResourceSubFolder |

#### Reference

Autodesk.Revit.DB Namespace