Revit 2026 API

# Sketch Properties

---

The Sketch type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OwnerId | Returns id of the sketch owner element or invalidElementId if sketch does not build a geometry. |
|  | Profile | Returns the Profile of the Sketch. |
|  | SketchPlane | Returns the Sketch Plane of the Sketch. |

#### Reference

Sketch Class

Autodesk.Revit.DB Namespace