Revit 2026 API

# CurveByPointsArrayIterator Class

---

An iterator to a CurveByPoints array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurveByPointsArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CurveByPointsArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CurveByPointsArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CurveByPointsArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CurveByPointsArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CurveByPointsArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveByPointsArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace