Revit 2026 API

# ElementIntersectsFilter Class

---

A base class for filters used to match elements which intersect with geometry.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBElementIntersectsFilter Autodesk.Revit.DBElementIntersectsElementFilter Autodesk.Revit.DBElementIntersectsSolidFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementIntersectsFilter : ElementSlowFilter
```
```vb
Public Class ElementIntersectsFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class ElementIntersectsFilter : public ElementSlowFilter
```
```fsharp
type ElementIntersectsFilter =
    class
        inherit ElementSlowFilter
    end
```

The ElementIntersectsFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | IsCategorySupported | Identifies if the input element is of a category supported by element intersection filters. |
|  | IsElementSupported | Identifies if the input element is supported by element intersection filters. |

#### Reference

Autodesk.Revit.DB Namespace