Revit 2026 API

# SketchPlane Class

---

Represents a sketch plane or work plane.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSketchPlane

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SketchPlane : Element
```
```vb
Public Class SketchPlane
	Inherits Element
```
```cpp
public ref class SketchPlane : public Element
```
```fsharp
type SketchPlane =
    class
        inherit Element
    end
```

The SketchPlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsSuitableForModelElements | Identifies if the sketch plane can be assigned to model elements. |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId) | Creates a sketch plane from a grid, reference plane, or level. |
|  | Create(Document, Plane) | Creates a new sketch plane from a geometric plane. |
|  | Create(Document, Reference) | Creates a new sketch plane from a reference to a planar face. |
|  | GetPlane | Returns the corresponding Plane. |
|  | GetPlaneReference | Returns a reference to this element as a plane. |

A SketchPlane object is used as an input to creation of sketch-referencing elements such as Model Curves or sketch-owning elements such as Generic Forms. The SketchPlane can be obtained from an existing element or created from a geometric plane or planar face. Note that the sketch plane element passed as input to create an element may not be the actual sketch plane assigned to that element; Revit may look for a geometrically equivalent plane to use, or may create a new one if the input plane is already used for other purposes. Some sketch planes (such as those obtained from detail curves) are suitable only for use in creating detail elements; they will be rejected when used for other element types.

#### Reference

Autodesk.Revit.DB Namespace