Revit 2026 API

# InsulationLiningBase Properties

---

The InsulationLiningBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HostElementId | The id of the host element for the insulation or lining element. |
|  | Thickness | Thickness of the insulation or lining element. |

#### Reference

InsulationLiningBase Class

Autodesk.Revit.DB Namespace