Revit 2026 API

# ValueParsingOptions Methods

---

The ValueParsingOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetFormatOptions | Gets the FormatOptions to optionally override the default settings in the Units class. |
|  | SetFormatOptions | Sets the FormatOptions to optionally override the default settings in the Units class. |

#### Reference

ValueParsingOptions Class

Autodesk.Revit.DB Namespace