Revit 2026 API

# FaceSplitter Class

---

Represents an element that splits a face.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBFaceSplitter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceSplitter : Element
```
```vb
Public Class FaceSplitter
	Inherits Element
```
```cpp
public ref class FaceSplitter : public Element
```
```fsharp
type FaceSplitter =
    class
        inherit Element
    end
```

The FaceSplitter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SplitElementId | The id of the element whose face is split by this element. |

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundaries | Gets the boundaries. |

#### Reference

Autodesk.Revit.DB Namespace