Revit 2026 API

# FilterStringRuleEvaluator Class

---

Base for all classes that compare string values from Revit to a user-supplied filter value

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringRuleEvaluator : IDisposable
```
```vb
Public Class FilterStringRuleEvaluator
	Implements IDisposable
```
```cpp
public ref class FilterStringRuleEvaluator : IDisposable
```
```fsharp
type FilterStringRuleEvaluator =
    class
        interface IDisposable
    end
```

The FilterStringRuleEvaluator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FilterStringRuleEvaluator |
|  | Evaluate | Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringBeginsWith Autodesk.Revit.DBFilterStringContains Autodesk.Revit.DBFilterStringEndsWith Autodesk.Revit.DBFilterStringEquals Autodesk.Revit.DBFilterStringGreater Autodesk.Revit.DBFilterStringGreaterOrEqual Autodesk.Revit.DBFilterStringLess Autodesk.Revit.DBFilterStringLessOrEqual