Revit 2026 API

# GroundConductorSizeSetIterator Methods

---

The GroundConductorSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

GroundConductorSizeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace