Revit 2026 API

# EditScope Class

---

The base class for a scope object that provides special access and limitations related to editing certain elements.

SystemObject Autodesk.Revit.DBEditScope Autodesk.Revit.DB.ArchitectureTopographyEditScope Autodesk.Revit.DBSketchEditScope Autodesk.Revit.DBStairsEditScope

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class EditScope : IDisposable
```
```vb
Public Class EditScope
	Implements IDisposable
```
```cpp
public ref class EditScope : IDisposable
```
```fsharp
type EditScope =
    class
        interface IDisposable
    end
```

The EditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet. |
|  | IsPermitted | Tells if the edit scope is permitted to start. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | Cancels the edit scope. |
|  | Commit | Finishes the edit scope. |
|  | Dispose | Releases all resources used by the EditScope |

Derivations of this class provide specific functionality to manage edit modes for specific purposes.

#### Reference

Autodesk.Revit.DB Namespace