Revit 2026 API

# FillPattern Methods

---

The FillPattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | ExpandDots | Corrects pattern dots to make them be drawn properly for Revit. |
|  | ExportToPAT |  |
|  | GetFillGrid | Gets the specified fill grid. |
|  | GetFillGrids | Gets all fill grids in this fill pattern |
|  | IsEqual | Check if the contents and the name of the fill pattern is the same as the name and contents of this fill pattern. |
|  | SetFillGrid | Sets the fill grid. |
|  | SetFillGrids |  |

#### Reference

FillPattern Class

Autodesk.Revit.DB Namespace