Revit 2026 API

# DistributionSysTypeSet Properties

---

The DistributionSysTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of DistributionSys types that are in the set. |

#### Reference

DistributionSysTypeSet Class

Autodesk.Revit.DB.Electrical Namespace