Revit 2026 API

# CeilingType Class

---

Represents a ceiling type in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBCeilingType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CeilingType : HostObjAttributes
```
```vb
Public Class CeilingType
	Inherits HostObjAttributes
```
```cpp
public ref class CeilingType : public HostObjAttributes
```
```fsharp
type CeilingType =
    class
        inherit HostObjAttributes
    end
```

The CeilingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the CeilingType |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace