Revit 2026 API

# AssetPropertyTime Class

---

Represents a connected property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyTime

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyTime : AssetProperty
```
```vb
Public Class AssetPropertyTime
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyTime : public AssetProperty
```
```fsharp
type AssetPropertyTime =
    class
        inherit AssetProperty
    end
```

The AssetPropertyTime type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | Get the value of the property |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Visual Namespace