Revit 2026 API

# ImportInstance Properties

---

The ImportInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsLinked | Identifies whether this instance is a linked object rather than imported one. |

#### Reference

ImportInstance Class

Autodesk.Revit.DB Namespace