Revit 2026 API

# Surface Class

---

A mathematical representation of a surface.

SystemObject Autodesk.Revit.DBSurface More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Surface : IDisposable
```
```vb
Public Class Surface
	Implements IDisposable
```
```cpp
public ref class Surface : IDisposable
```
```fsharp
type Surface =
    class
        interface IDisposable
    end
```

The Surface type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OrientationMatchesParametricOrientation | Indicates whether this Surface's orientation is the same as or opposite to its parametric orientation. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the Surface |
|  | GetBoundingBoxUV | Gets the UV bounding box of the surface. |
|  | Project | Project a 3D point orthogonally onto a surface (to find the nearest point). Throws InvalidOperationException if the projection fails. |
|  | ProjectWithGuessPoint | Project a 3D point orthogonally onto a surface (to find the nearest point). This method is meant to be used when a good approximate solution for the projection is available. Throws InvalidOperationException if the projection fails. |

This geometric object is not bounded by edges or edge loops. A bounded surface obtained from a Revit element will be represented by a Face instead.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBSurface Autodesk.Revit.DBConicalSurface Autodesk.Revit.DBCylindricalSurface Autodesk.Revit.DBHermiteSurface Autodesk.Revit.DBOffsetSurface Autodesk.Revit.DBPlane Autodesk.Revit.DBRevolvedSurface Autodesk.Revit.DBRuledSurface