Revit 2026 API

# AnalysisDisplayMarkersAndTextSettings Class

---

Contains markers and text settings for analysis display style element.

SystemObject Autodesk.Revit.DB.AnalysisAnalysisDisplayMarkersAndTextSettings

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayMarkersAndTextSettings : IDisposable
```
```vb
Public Class AnalysisDisplayMarkersAndTextSettings
	Implements IDisposable
```
```cpp
public ref class AnalysisDisplayMarkersAndTextSettings : IDisposable
```
```fsharp
type AnalysisDisplayMarkersAndTextSettings =
    class
        interface IDisposable
    end
```

The AnalysisDisplayMarkersAndTextSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalysisDisplayMarkersAndTextSettings | Constructs a default instance of markers and text settings. |
|  | AnalysisDisplayMarkersAndTextSettings(AnalysisDisplayMarkersAndTextSettings) | Constructs a new copy of the input AnalysisDisplayMarkersAndTextSettings object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | MarkerSize | Size of marker. |
|  | MarkerType | Type of marker. |
|  | Rounding | Increment to which numeric values of analysis results are rounded in markers. |
|  | TextLabelType | Type of diagram text label visualization. |
|  | TextTypeId | Element id of text associated with the settings. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalysisDisplayMarkersAndTextSettings |
|  | IsEqual | Compares two colored surface settings objects. |

#### Reference

Autodesk.Revit.DB.Analysis Namespace