Revit 2026 API

# PipeSegment Methods

---

The PipeSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |

#### Reference

PipeSegment Class

Autodesk.Revit.DB.Plumbing Namespace