Revit 2026 API

# IndexStreamTriangle Methods

---

The IndexStreamTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddTriangle | Inserts a IndexTriangle into the stream and associated buffer. |
|  | AddTriangles |  |

#### Reference

IndexStreamTriangle Class

Autodesk.Revit.DB.DirectContext3D Namespace