Revit 2026 API

# RoutingCondition Methods

---

The RoutingCondition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RoutingCondition Class

Autodesk.Revit.DB Namespace