Revit 2026 API

# AnalyticalOpening Properties

---

The AnalyticalOpening type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PanelId | ElementId of the AnalyticalPanel parent. |

#### Reference

AnalyticalOpening Class

Autodesk.Revit.DB.Structure Namespace