Revit 2026 API

# ParameterDownloadOptions Methods

---

The ParameterDownloadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCategories | Get categories for binding. |
|  | GetGroupTypeId | Get properties palette group identifier. |
|  | SetCategories |  |
|  | SetGroupTypeId | Set properties palette group identifier. |

#### Reference

ParameterDownloadOptions Class

Autodesk.Revit.DB Namespace