Revit 2026 API

# IFCPropertyMappingInfo Methods

---

The IFCPropertyMappingInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsValidMappingInfo | Defines whether the mapping info contains meaningful data. |

#### Reference

IFCPropertyMappingInfo Class

Autodesk.Revit.DB Namespace