Revit 2026 API

# PlanTopologySetIterator Properties

---

The PlanTopologySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

PlanTopologySetIterator Class

Autodesk.Revit.DB Namespace