Revit 2026 API

# IndexStreamLine Class

---

A stream that can be used to write IndexLine primitives into an IndexBuffer

SystemObject Autodesk.Revit.DB.DirectContext3DIndexStream Autodesk.Revit.DB.DirectContext3DIndexStreamLine

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexStreamLine : IndexStream
```
```vb
Public Class IndexStreamLine
	Inherits IndexStream
```
```cpp
public ref class IndexStreamLine : public IndexStream
```
```fsharp
type IndexStreamLine =
    class
        inherit IndexStream
    end
```

The IndexStreamLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddLine | Inserts a IndexLine segment into the stream and associated buffer. |
|  | AddLines |  |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace