Revit 2026 API

# ReferenceArray Class

---

An array that contains reference objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReferenceArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReferenceArray : APIObject,
	IEnumerable
```
```vb
Public Class ReferenceArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ReferenceArray : public APIObject,
	IEnumerable
```
```fsharp
type ReferenceArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ReferenceArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferenceArray | Initializes a new instance of the ReferenceArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a reference at a specified index within the array. |
|  | Size | Returns the number of references that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append | Add the reference to the end of the array. |
|  | Clear | Removes every reference from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert | Insert the specified reference into the array. |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace