Revit 2026 API

# RoofBase Methods

---

The RoofBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can used to add or modify points of this RoofBase. |

#### Reference

RoofBase Class

Autodesk.Revit.DB Namespace