Revit 2026 API

# RevitServerModelNameBreaksConventionException Methods

---

The RevitServerModelNameBreaksConventionException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerModelNameBreaksConventionException Class

Autodesk.Revit.Exceptions Namespace