Revit 2026 API

# WireSizeSetIterator Methods

---

The WireSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

WireSizeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace