Revit 2026 API

# FilterInverseRule Class

---

A filter rule that inverts the boolean values returned by the rule it contains.

SystemObject Autodesk.Revit.DBFilterRule Autodesk.Revit.DBFilterInverseRule

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterInverseRule : FilterRule
```
```vb
Public Class FilterInverseRule
	Inherits FilterRule
```
```cpp
public ref class FilterInverseRule : public FilterRule
```
```fsharp
type FilterInverseRule =
    class
        inherit FilterRule
    end
```

The FilterInverseRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterInverseRule | Constructs a new instance of FilterInverseRule. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetInnerRule | Gets the rule being inverted. |
|  | SetInnerRule | Gets the rule being inverted. |

FilterInverse rule performs a logical "not" operation on its inner rule's "elementPasses()" method.

#### Reference

Autodesk.Revit.DB Namespace