Revit 2026 API

# ExportFontKey Class

---

A key used to represent an item stored in an ExportFontTable.

SystemObject Autodesk.Revit.DBExportFontKey

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportFontKey : IDisposable
```
```vb
Public Class ExportFontKey
	Implements IDisposable
```
```cpp
public ref class ExportFontKey : IDisposable
```
```fsharp
type ExportFontKey =
    class
        interface IDisposable
    end
```

The ExportFontKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportFontKey | Constructs a new default ExportFontKey. |
|  | ExportFontKey(ExportFontKey) | Constructs a new copy of the input ExportFontKey object. |
|  | ExportFontKey(String) | Constructs a new ExportFontKey using an input font name. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | OriginalFontName | The original font name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportFontKey |

#### Reference

Autodesk.Revit.DB Namespace