Revit 2026 API

# FilledRegion Properties

---

The FilledRegion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsMasking | Indicates whether this element is a 'Filled Region or a 'Masking Region'. |

#### Reference

FilledRegion Class

Autodesk.Revit.DB Namespace