Revit 2026 API

# ImportIFCOptions Class

---

Provides access to settings that control linking and opening IFC files.

SystemObject Autodesk.Revit.DBImportIFCOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ImportIFCOptions : IDisposable
```
```vb
Public Class ImportIFCOptions
	Implements IDisposable
```
```cpp
public ref class ImportIFCOptions : IDisposable
```
```fsharp
type ImportIFCOptions =
    class
        interface IDisposable
    end
```

The ImportIFCOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LinkProcessor | Specifies the engine to use while doing a Link IFC operation. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ImportIFCOptions |
|  | GetImportIFCOptions | Returns the current Revit instance's ImportIFCOptions. |

These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.

#### Reference

Autodesk.Revit.DB Namespace