Revit 2026 API

# IntersectionResultArrayIterator Methods

---

The IntersectionResultArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

IntersectionResultArrayIterator Class

Autodesk.Revit.DB Namespace