Revit 2026 API

# ElementDesignOptionFilter Class

---

A filter used to find elements contained within a particular design option.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementDesignOptionFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementDesignOptionFilter : ElementQuickFilter
```
```vb
Public Class ElementDesignOptionFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementDesignOptionFilter : public ElementQuickFilter
```
```fsharp
type ElementDesignOptionFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementDesignOptionFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementDesignOptionFilter(ElementId) | Constructs a new instance of a filter to match elements contained within a particular design option. |
|  | ElementDesignOptionFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements contained within a particular design option, with the option to invert the filter and find elements not contained within a particular design option. |

|  | Name | Description |
| --- | --- | --- |
|  | DesignOptionId | The design option id. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace