Revit 2026 API

# FamilySymbolFilter Properties

---

The FamilySymbolFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyId | The family id. |

#### Reference

FamilySymbolFilter Class

Autodesk.Revit.DB Namespace