Revit 2026 API

# ComponentRepeater Methods

---

The ComponentRepeater type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanElementBeRepeated | Determines whether an element can be repeated using the **RepeatElements** method. |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Returns an enumerator that iterates through a collection. |
|  | IsTypeValidForRepeater | Determines whether given family type can be used as the default type for the repeater. |
|  | RemoveRepeaters |  |
|  | RepeatElements |  |

#### Reference

ComponentRepeater Class

Autodesk.Revit.DB Namespace