Revit 2026 API

# ParameterMapIterator Properties

---

The ParameterMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |
|  | Key | Retrieves the key that is the current focus of the iterator. |

#### Reference

ParameterMapIterator Class

Autodesk.Revit.DB Namespace