Revit 2026 API

# GroundConductorSize Properties

---

The GroundConductorSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Ampacity | Get ampacity which is used for specifying size, the unit is ampere. |
|  | ConductorSize | Get conductor size corresponding to specific ampacity. |
|  | MaterialBelongTo | Get the material type which include this ground conductor size information. |

#### Reference

GroundConductorSize Class

Autodesk.Revit.DB.Electrical Namespace