Revit 2026 API

# PlanCircuitSetIterator Class

---

An iterator to a set of plan circuit objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPlanCircuitSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PlanCircuitSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class PlanCircuitSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class PlanCircuitSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type PlanCircuitSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The PlanCircuitSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PlanCircuitSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace