Revit 2026 API

# ThermalProperties Class

---

Class specific to thermal properties for assembly types, such as Wall, Floor, Ceiling, Roof and Building Pad.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBThermalProperties

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ThermalProperties : APIObject
```
```vb
Public Class ThermalProperties
	Inherits APIObject
```
```cpp
public ref class ThermalProperties : public APIObject
```
```fsharp
type ThermalProperties =
    class
        inherit APIObject
    end
```

The ThermalProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Absorptance | Value of absorptance. |
|  | HeatTransferCoefficient | The heat transfer coefficient value (U-Value). The unit is watts per meter-squared kelvin (W/(m^2*K)). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Roughness | Value of roughness. |
|  | ThermalMass | The calculated thermal mass value. The unit is kilogram feet-squared per second squared kelvin (kg ft^2/(s^2 K)). |
|  | ThermalResistance | The calculated thermal resistance value (R-Value). The unit is meter-squared kelvin per watt ((m^2*K)/Watt). |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace