Revit 2026 API

# BaseArray Properties

---

The BaseArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Label | The family parameter label of the BaseArray. |
|  | Name | Get and Set the Name property(Overrides ElementName) |
|  | NumMembers | Retrieves or changes the number of the arrayed members. |

#### Reference

BaseArray Class

Autodesk.Revit.DB Namespace