Revit 2026 API

# PointOnEdge Class

---

Define a ReferencePoint relative to a referenceable edge or curve on another element.

SystemObject Autodesk.Revit.DBPointElementReference Autodesk.Revit.DBPointOnEdge

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointOnEdge : PointElementReference
```
```vb
Public Class PointOnEdge
	Inherits PointElementReference
```
```cpp
public ref class PointOnEdge : public PointElementReference
```
```fsharp
type PointOnEdge =
    class
        inherit PointElementReference
    end
```

The PointOnEdge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LocationOnCurve | The point location on curve. |

|  | Name | Description |
| --- | --- | --- |
|  | GetEdgeReference | Get a copy of the edge or curve reference. |
|  | SetEdgeReference | Change the edge or curve reference. |

The ReferencePoint's X basis vector is constrained to the tangent vector to the curve. The Y and Z vectors are free to rotate around the curve.

#### Reference

Autodesk.Revit.DB Namespace