Revit 2026 API

# FamilyParameterSetIterator Methods

---

The FamilyParameterSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

FamilyParameterSetIterator Class

Autodesk.Revit.DB Namespace