Revit 2026 API

# ElectricalPerPhaseData Methods

---

The ElectricalPerPhaseData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ElectricalPerPhaseData Class

Autodesk.Revit.DB.Electrical Namespace