Revit 2026 API

# SpatialElementGeometryCalculator Class

---

Use this class to calculate the geometry of a spatial element and obtain the relationships between the geometry and the element's boundary elements.

SystemObject Autodesk.Revit.DBSpatialElementGeometryCalculator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementGeometryCalculator : IDisposable
```
```vb
Public Class SpatialElementGeometryCalculator
	Implements IDisposable
```
```cpp
public ref class SpatialElementGeometryCalculator : IDisposable
```
```fsharp
type SpatialElementGeometryCalculator =
    class
        interface IDisposable
    end
```

The SpatialElementGeometryCalculator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SpatialElementGeometryCalculator(Document) | Constructs a new calculator with default options for the geometry of spatial elements. |
|  | SpatialElementGeometryCalculator(Document, SpatialElementBoundaryOptions) | Constructs a new calculator for the geometry of spatial elements. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | CalculateSpatialElementGeometry | Compute the spatial element geometry and returns the boundary face information. |
|  | CanCalculateGeometry | This indicates whether the input spatial element is a valid one. |
|  | Dispose | Releases all resources used by the SpatialElementGeometryCalculator |
|  | GetOptions | The options that control the calculation. |
|  | IsRoomOrSpace | This indicates whether the input spatial element is a room or a space. |

This class maintains an internal cache for geometry it has already processed. If you intend to calculate geometry for several elements in the same project you should use a single instance of this class. Note that the cache will be cleared when any change is made to the document.

#### Reference

Autodesk.Revit.DB Namespace