Revit 2026 API

# VertexPair Methods

---

The VertexPair type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

VertexPair Class

Autodesk.Revit.DB Namespace