Revit 2026 API

# DefinitionFile Class

---

The DefinitionFile object represents a shared parameters file on disk.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBDefinitionFile

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DefinitionFile : APIObject
```
```vb
Public Class DefinitionFile
	Inherits APIObject
```
```cpp
public ref class DefinitionFile : public APIObject
```
```fsharp
type DefinitionFile =
    class
        inherit APIObject
    end
```

The DefinitionFile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Filename | This property returns the physical filename of the shared parameters file on disk. |
|  | Groups | Return a map of shared parameter definition groups contained within the file. |

|  | Name | Description |
| --- | --- | --- |

Shared Parameters are parameter definitions that are stored in a text file external to the Autodesk Revit project. These definitions can be used in multiple projects and are identifiable by a unique identifier generated when they are created. API access to shared parameters consist of a number of objects, the first of which is an object that represents the shared parameters file on disk. That object then contains a number of Group objects. Shared parameters are grouped for easier management. These groups then contain the shared parameter definitions. The groups support the ability to create new shared parameter definitions. The DefinitionFile object can be retrieved by the Application.OpenSharedParameterFile method.

#### Reference

Autodesk.Revit.DB Namespace