Revit 2026 API

# FamilyParameterSetIterator Class

---

An iterator to a FamilyParameter set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyParameterSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class FamilyParameterSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class FamilyParameterSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class FamilyParameterSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type FamilyParameterSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The FamilyParameterSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyParameterSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace