Revit 2026 API

# SATExportOptions Class

---

The export options used by exporting SAT format file. So far, there is no option in it.

SystemObject Autodesk.Revit.DBSATExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SATExportOptions : IDisposable
```
```vb
Public Class SATExportOptions
	Implements IDisposable
```
```cpp
public ref class SATExportOptions : IDisposable
```
```fsharp
type SATExportOptions =
    class
        interface IDisposable
    end
```

The SATExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SATExportOptions | Constructs a new instance of SATImportOptions with default values of all properties. |
|  | SATExportOptions(SATExportOptions) | Constructs a new instance of SATImportOptions as a copy of the export options. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SATExportOptions |

#### Reference

Autodesk.Revit.DB Namespace