Revit 2026 API

# SplitButtonData Class

---

This class contains information necessary to construct a split button in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIPulldownButtonData Autodesk.Revit.UISplitButtonData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SplitButtonData : PulldownButtonData
```
```vb
Public Class SplitButtonData
	Inherits PulldownButtonData
```
```cpp
public ref class SplitButtonData : public PulldownButtonData
```
```fsharp
type SplitButtonData =
    class
        inherit PulldownButtonData
    end
```

The SplitButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SplitButtonData | Constructs a new instance of SplitButtonData. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace