Revit 2026 API

# GroundConductorSizeSet Class

---

A set that contains GroundConductorSizes.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalGroundConductorSizeSet

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GroundConductorSizeSet : APIObject,
	IEnumerable
```
```vb
Public Class GroundConductorSizeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class GroundConductorSizeSet : public APIObject,
	IEnumerable
```
```fsharp
type GroundConductorSizeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The GroundConductorSizeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroundConductorSizeSet | Initializes a new instance of the GroundConductorSizeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of GroundConductorSizes that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every GroundConductorSize from the set, rendering it empty. |
|  | Contains | Tests for the existence of a GroundConductorSize within the set. |
|  | Erase | Removes a specified GroundConductorSize from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified GroundConductorSize into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace