Revit 2026 API

# FilterInverseRule Methods

---

The FilterInverseRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetInnerRule | Gets the rule being inverted. |
|  | SetInnerRule | Gets the rule being inverted. |

#### Reference

FilterInverseRule Class

Autodesk.Revit.DB Namespace