Revit 2026 API

# DuctInsulation Methods

---

The DuctInsulation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of duct insulation. |

#### Reference

DuctInsulation Class

Autodesk.Revit.DB.Mechanical Namespace