Revit 2026 API

# LinkNode Methods

---

The LinkNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDocument | Returns the document associated with the link. |

#### Reference

LinkNode Class

Autodesk.Revit.DB Namespace