Revit 2026 API

# LayoutRule Class

---

The LayoutRule object is a base object for all type of layout rules for Beam System within the Autodesk Revit API.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleClearSpacing Autodesk.Revit.DBLayoutRuleFixedDistance Autodesk.Revit.DBLayoutRuleFixedNumber Autodesk.Revit.DBLayoutRuleMaximumSpacing

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class LayoutRule : APIObject
```
```vb
Public MustInherit Class LayoutRule
	Inherits APIObject
```
```cpp
public ref class LayoutRule abstract : public APIObject
```
```fsharp
[<AbstractClassAttribute>]
type LayoutRule =
    class
        inherit APIObject
    end
```

The LayoutRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This class just used as the base class of those concrete LayoutRule classes.

#### Reference

Autodesk.Revit.DB Namespace