Revit 2026 API

# Sketch Methods

---

The Sketch type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetAllElements | Returns all elements which belong to the sketch. |

#### Reference

Sketch Class

Autodesk.Revit.DB Namespace