Revit 2026 API

# TableCellCombinedParameterData Methods

---

The TableCellCombinedParameterData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | construct a TableCellCombinedParameterData |
|  | Dispose |  |

#### Reference

TableCellCombinedParameterData Class

Autodesk.Revit.DB Namespace