Revit 2026 API

# BRepBuilderSurfaceGeometry Class

---

An abstract class used by BRepBuilder to represent the geometry of a surface. Specific surface-geometry representations are represented by subclasses.

SystemObject Autodesk.Revit.DBBRepBuilderSurfaceGeometry

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BRepBuilderSurfaceGeometry : IDisposable
```
```vb
Public Class BRepBuilderSurfaceGeometry
	Implements IDisposable
```
```cpp
public ref class BRepBuilderSurfaceGeometry : IDisposable
```
```fsharp
type BRepBuilderSurfaceGeometry =
    class
        interface IDisposable
    end
```

The BRepBuilderSurfaceGeometry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Construct BRepBuilderSurfaceGeometry based on a permitted Revit Surface. |
|  | CreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, Boolean, BoundingBoxUV) |  |
|  | CreateNURBSSurface(Int32, Int32, IListDouble, IListDouble, IListXYZ, IListDouble, Boolean, BoundingBoxUV) |  |
|  | Dispose | Releases all resources used by the BRepBuilderSurfaceGeometry |

#### Reference

Autodesk.Revit.DB Namespace