Revit 2026 API

# ModuleSettings Methods

---

The ModuleSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ModuleSettings Class

Autodesk.Revit.DB.Macros Namespace