Revit 2026 API

# MultiReferenceAnnotation Properties

---

The MultiReferenceAnnotation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DimensionId | The child dimension owned by this multi-reference annotation. |
|  | TagId | The child IndependentTag owned by this multi-reference annotation. |

#### Reference

MultiReferenceAnnotation Class

Autodesk.Revit.DB Namespace