Revit 2026 API

# TemperatureRatingType Methods

---

The TemperatureRatingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCorrectionFactor | Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature. |
|  | AddInsulationType | Add a new kind of insulation type into this temperature rating type. |
|  | AddWireSize | Add a new kind of wire size type into this temperature rating type. |
|  | RemoveCorrectionFactor | Remove an existing correction factor from this temperature rating type in Revit MEP project. |
|  | RemoveInsulationType | Remove an existing insulation type from this temperature rating type. |
|  | RemoveWireSize | Remove an existing wire size type from this temperature rating type. |

#### Reference

TemperatureRatingType Class

Autodesk.Revit.DB.Electrical Namespace