Revit 2026 API

# FamilyInstanceFilter Properties

---

The FamilyInstanceFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilySymbolId | The family symbol id. |

#### Reference

FamilyInstanceFilter Class

Autodesk.Revit.DB Namespace