Revit 2026 API

# HomeCamera Methods

---

The HomeCamera type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

HomeCamera Class

Autodesk.Revit.DB Namespace