Revit 2026 API

# FamilyTypeSet Class

---

A set that contains FamilyType objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyTypeSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyTypeSet : APIObject,
	IEnumerable
```
```vb
Public Class FamilyTypeSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class FamilyTypeSet : public APIObject,
	IEnumerable
```
```fsharp
type FamilyTypeSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The FamilyTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyTypeSet | Initializes a new instance of the FamilyTypeSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item from the set, rendering it empty. |
|  | Contains |  |
|  | Erase |  |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace