Revit 2026 API

# PlanTopologySetIterator Class

---

An iterator to a set of plan topology objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPlanTopologySetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PlanTopologySetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class PlanTopologySetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class PlanTopologySetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type PlanTopologySetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The PlanTopologySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PlanTopologySetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace