Revit 2026 API

# ExportFontInfo Class

---

A value used to represent the info stored in an ExportFontTable.

SystemObject Autodesk.Revit.DBExportFontInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExportFontInfo : IDisposable
```
```vb
Public Class ExportFontInfo
	Implements IDisposable
```
```cpp
public ref class ExportFontInfo : IDisposable
```
```fsharp
type ExportFontInfo =
    class
        interface IDisposable
    end
```

The ExportFontInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExportFontInfo | Constructs a new default ExportFontInfo. |
|  | ExportFontInfo(ExportFontInfo) | Constructs a new copy of the input ExportFontInfo object. |
|  | ExportFontInfo(String) | Constructs a new ExportFontInfo using the destination font name as input. |

|  | Name | Description |
| --- | --- | --- |
|  | DestinationFontName | The destination font name (the name of the font in the exported format). |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExportFontInfo |

#### Reference

Autodesk.Revit.DB Namespace