Revit 2026 API

# SpaceSet Properties

---

The SpaceSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

SpaceSet Class

Autodesk.Revit.DB.Mechanical Namespace