Revit 2026 API

# PushButton Class

---

The PushButton object represents an button on a RibbonPanel.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRibbonButton Autodesk.Revit.UIPushButton Autodesk.Revit.UIToggleButton

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PushButton : RibbonButton
```
```vb
Public Class PushButton
	Inherits RibbonButton
```
```cpp
public ref class PushButton : public RibbonButton
```
```fsharp
type PushButton =
    class
        inherit RibbonButton
    end
```

The PushButton type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyName | The assembly path of the button. |
|  | AvailabilityClassName | The full class name for the class providing the entry point to decide availability of this push button. |
|  | ClassName | The name of the class containing the implementation for the command. |

|  | Name | Description |
| --- | --- | --- |

Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace