Revit 2026 API

# STEPImportOptions Class

---

The import options used to import STEP format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBSTEPImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class STEPImportOptions : BaseImportOptions
```
```vb
Public Class STEPImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class STEPImportOptions : public BaseImportOptions
```
```fsharp
type STEPImportOptions =
    class
        inherit BaseImportOptions
    end
```

The STEPImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | STEPImportOptions | Constructs a new instance of STEPImportOptions with default values of all properties. |
|  | STEPImportOptions(STEPImportOptions) | Constructs a new instance of STEPImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace