Revit 2026 API

# CategorySet Properties

---

The CategorySet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of categories that are in the set. |

#### Reference

CategorySet Class

Autodesk.Revit.DB Namespace