Revit 2026 API

# ExternallyTaggedNonBRep Class

---

This class is used to create an externally tagged geometry object.

SystemObject Autodesk.Revit.DBExternallyTaggedGeometryObject Autodesk.Revit.DBExternallyTaggedNonBRep

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternallyTaggedNonBRep : ExternallyTaggedGeometryObject
```
```vb
Public Class ExternallyTaggedNonBRep
	Inherits ExternallyTaggedGeometryObject
```
```cpp
public ref class ExternallyTaggedNonBRep : public ExternallyTaggedGeometryObject
```
```fsharp
type ExternallyTaggedNonBRep =
    class
        inherit ExternallyTaggedGeometryObject
    end
```

The ExternallyTaggedNonBRep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternallyTaggedNonBRep | Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | SetUsage | Controls the usage of this ExternallyTaggedNonBRep. |

#### Reference

Autodesk.Revit.DB Namespace