Revit 2026 API

# CompoundStructureLayer Methods

---

The CompoundStructureLayer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

CompoundStructureLayer Class

Autodesk.Revit.DB Namespace