Revit 2026 API

# FabricationItemFolder Class

---

A fabrication item folder that can contain sub folders and access to the FabricationItemFiles contained within.

SystemObject Autodesk.Revit.DBFabricationItemFolder

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationItemFolder : IDisposable
```
```vb
Public Class FabricationItemFolder
	Implements IDisposable
```
```cpp
public ref class FabricationItemFolder : IDisposable
```
```fsharp
type FabricationItemFolder =
    class
        interface IDisposable
    end
```

The FabricationItemFolder type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The item folder's name. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationItemFolder |
|  | GetItemFiles | Gets the item files in this item folder. |
|  | GetSubFolders | Gets the item folder's sub folders. |

#### Reference

Autodesk.Revit.DB Namespace