Revit 2026 API

# AssemblyDifferenceMemberCount Properties

---

The AssemblyDifferenceMemberCount type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Count1 | Number of members in the first assembly |
|  | Count2 | Number of members in the second assembly |

#### Reference

AssemblyDifferenceMemberCount Class

Autodesk.Revit.DB Namespace