Revit 2026 API

# AnalysisDisplayDiagramSettings Methods

---

The AnalysisDisplayDiagramSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two diagram settings objects. |

#### Reference

AnalysisDisplayDiagramSettings Class

Autodesk.Revit.DB.Analysis Namespace