Revit 2026 API

# KeyBasedTreeEntry Methods

---

The KeyBasedTreeEntry type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetChildrenKeys | Gets a collection containing the keys of all children entry objects from this entry. |

#### Reference

KeyBasedTreeEntry Class

Autodesk.Revit.DB Namespace