Revit 2026 API

# KeyBasedTreeEntryTable Class

---

KeyBasedTreeEntryTable represents the collection of key-based tree entries for a document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBKeyBasedTreeEntryTable Autodesk.Revit.DBAssemblyCodeTable Autodesk.Revit.DBKeynoteTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeyBasedTreeEntryTable : Element
```
```vb
Public Class KeyBasedTreeEntryTable
	Inherits Element
```
```cpp
public ref class KeyBasedTreeEntryTable : public Element
```
```fsharp
type KeyBasedTreeEntryTable =
    class
        inherit Element
    end
```

The KeyBasedTreeEntryTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetKeyBasedTreeEntries | Gets the KeyBasedTreeEntries for this table. |
|  | LoadFrom | Loads KeyBasedTreeEntries from the specified external resource into this KeyBasedTreeEntryTable. |
|  | Reload | Reloads KeyBasedTreeEntries from their currently-stored location into this KeyBasedTreeEntryTable. |
|  | ServerSupports | Checks if the server referenced by the given ExternalResourceReference supports the ExternalResourceReferenceType of this KeyBasedTreeEntryTable. |

#### Reference

Autodesk.Revit.DB Namespace