Revit 2026 API

# ComponentRepeater Properties

---

The ComponentRepeater type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefaultFamilyType | The default family type for the component repeater. |
|  | DimensionCount | The dimension count of the component repeater. |

#### Reference

ComponentRepeater Class

Autodesk.Revit.DB Namespace