Revit 2026 API

# ReloadLatestOptions Methods

---

The ReloadLatestOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ReloadLatestOptions Class

Autodesk.Revit.DB Namespace