Revit 2026 API

# DocumentWorksharingEnabledEventArgs Methods

---

The DocumentWorksharingEnabledEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDocument | Returns document associated with this event |

#### Reference

DocumentWorksharingEnabledEventArgs Class

Autodesk.Revit.DB.Events Namespace