Revit 2026 API

# PhaseArrayIterator Class

---

An iterator to a phase array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPhaseArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PhaseArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class PhaseArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class PhaseArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type PhaseArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The PhaseArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PhaseArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace