Revit 2026 API

# SymbolicCurve Class

---

A curve that provides information but is not intended to represent actual geometry in an element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBSymbolicCurve

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SymbolicCurve : CurveElement
```
```vb
Public Class SymbolicCurve
	Inherits CurveElement
```
```cpp
public ref class SymbolicCurve : public CurveElement
```
```fsharp
type SymbolicCurve =
    class
        inherit CurveElement
    end
```

The SymbolicCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsDrawnInForeground | Indicates if this curve will be drawn in the foreground of the family instance. |
|  | ReferenceType | Indicates the type of reference. |
|  | Subcategory | The subcategory. |

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the symbolic curve. |
|  | SetVisibility | Sets the visibility for the symbolic curve. |

For example, when creating a door family, you might sketch symbolic lines in an elevation view to represent a door swing. Symbolic curves are visible parallel to the view in which you sketch them.

#### Reference

Autodesk.Revit.DB Namespace