Revit 2026 API

# MultiReferenceAnnotationOptions Methods

---

The MultiReferenceAnnotationOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | ElementsMatchReferenceCategory |  |
|  | GetAdditionalReferencesToDimension | Gets the additional references which the dimension will witness. |
|  | GetElementsToDimension | Gets the elements which the dimension will witness. |
|  | IsAllowedDimensionStyleType | Only Linear and LinearFixed dimension style types are allowed for new MultiReferenceAnnotations. |
|  | ReferencesDontMatchReferenceCategory |  |
|  | SetAdditionalReferencesToDimension |  |
|  | SetElementsToDimension |  |

#### Reference

MultiReferenceAnnotationOptions Class

Autodesk.Revit.DB Namespace