Revit 2026 API

# VoltageTypeSetIterator Methods

---

The VoltageTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

VoltageTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace