Revit 2026 API

# SolidCurveIntersectionOptions Methods

---

The SolidCurveIntersectionOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SolidCurveIntersectionOptions Class

Autodesk.Revit.DB Namespace