Revit 2026 API

# ExtrusionRoof Class

---

Represents some kinds of Extrusion Roofs.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBRoofBase Autodesk.Revit.DBExtrusionRoof

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExtrusionRoof : RoofBase
```
```vb
Public Class ExtrusionRoof
	Inherits RoofBase
```
```cpp
public ref class ExtrusionRoof : public RoofBase
```
```fsharp
type ExtrusionRoof =
    class
        inherit RoofBase
    end
```

The ExtrusionRoof type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurtainGrids | Retrieve all the CurtainGrid objects of a curtain Roof. |

|  | Name | Description |
| --- | --- | --- |
|  | GetProfile | Retrieve the Profile of ExtrusionRoof. |

The ExtrusionRoof object represents some kinds of extruded roofs in Revit.

#### Reference

Autodesk.Revit.DB Namespace