Revit 2026 API

# LightDistribution Methods

---

The LightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Creates a copy of the LightDistribution derived object. |
|  | Dispose |  |

#### Reference

LightDistribution Class

Autodesk.Revit.DB.Lighting Namespace