Revit 2026 API

# FilterNumericGreaterOrEqual Class

---

Tests whether numeric values from the document are greater than or equal to a certain value

SystemObject Autodesk.Revit.DBFilterNumericRuleEvaluator Autodesk.Revit.DBFilterNumericGreaterOrEqual

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericGreaterOrEqual : FilterNumericRuleEvaluator
```
```vb
Public Class FilterNumericGreaterOrEqual
	Inherits FilterNumericRuleEvaluator
```
```cpp
public ref class FilterNumericGreaterOrEqual : public FilterNumericRuleEvaluator
```
```fsharp
type FilterNumericGreaterOrEqual =
    class
        inherit FilterNumericRuleEvaluator
    end
```

The FilterNumericGreaterOrEqual type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericGreaterOrEqual | Constructs an instance of FilterNumericGreaterOrEqual. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace