Revit 2026 API

# CloudPoint Structure

---

Represents a point obtained from a Point cloud.

SystemObject SystemValueType Autodesk.Revit.DB.PointCloudsCloudPoint

**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public struct CloudPoint
```
```vb
Public Structure CloudPoint
```
```cpp
public value class CloudPoint
```
```fsharp
[<SealedAttribute>]
type CloudPoint =
    struct
        inherit ValueType
    end
```

The CloudPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CloudPoint | Creates a new cloud point. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | (CloudPoint to XYZ) | Creates an XYZ object from this point cloud. |

|  | Name | Description |
| --- | --- | --- |
|  | Color | The color |
|  | X | The X coordinate |
|  | Y | The Y coordinate |
|  | Z | The Z coordinate |

#### Reference

Autodesk.Revit.DB.PointClouds Namespace