Revit 2026 API

# BalusterPlacement Methods

---

The BalusterPlacement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

BalusterPlacement Class

Autodesk.Revit.DB.Architecture Namespace