Revit 2026 API

# RadialArray Properties

---

The RadialArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumMembers | Retrieves or changes the number of arrayed members. Array placeholder members in the family environment are not counted.(Overrides BaseArrayNumMembers) |

#### Reference

RadialArray Class

Autodesk.Revit.DB Namespace