Revit 2026 API

# SpatialElementCalculationLocation Properties

---

The SpatialElementCalculationLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MarkerPosition | The position of the spatial element calculation location marker. |

#### Reference

SpatialElementCalculationLocation Class

Autodesk.Revit.DB Namespace