Revit 2026 API

# Revolution Class

---

A revolution solid or void form.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBRevolution

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Revolution : GenericForm
```
```vb
Public Class Revolution
	Inherits GenericForm
```
```cpp
public ref class Revolution : public GenericForm
```
```fsharp
type Revolution =
    class
        inherit GenericForm
    end
```

The Revolution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Returns the Axis of the Revolution. |
|  | EndAngle | The end angle of the revolution relative to the sketch plane. |
|  | Sketch | Returns the Sketch of the Revolution. |
|  | StartAngle | The start angle of the revolution relative to the sketch plane. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace