Revit 2026 API

# ElementPhaseStatusFilter Properties

---

The ElementPhaseStatusFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PhaseId | The phase id. |

#### Reference

ElementPhaseStatusFilter Class

Autodesk.Revit.DB Namespace