Revit 2026 API

# RebarFreeFormCreationResult Methods

---

The RebarFreeFormCreationResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RebarFreeFormCreationResult Class

Autodesk.Revit.DB.Structure Namespace