Revit 2026 API

# StructuralSectionGeneralR Properties

---

The StructuralSectionGeneralR type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WallDesignThickness | Represents wall design thickness of rectangle. |
|  | WallNominalThickness | Represents wall nominal thickness of rectangle. |

#### Reference

StructuralSectionGeneralR Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace