Revit 2026 API

# ConduitSettings Class

---

The conduit settings.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.ElectricalConduitSettings

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConduitSettings : Element
```
```vb
Public Class ConduitSettings
	Inherits Element
```
```cpp
public ref class ConduitSettings : public Element
```
```fsharp
type ConduitSettings =
    class
        inherit Element
    end
```

The ConduitSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorSeparator | The conduit connector separator string. |
|  | FittingAnnotationSize | The value of fitting annotation size. |
|  | RiseDropAnnotationSize | The rise drop annotation size. |
|  | SizePrefix | The conduit size prefix string. |
|  | SizeSuffix | The conduit size suffix string. |
|  | UseAnnotationScaleForSingleLineFittings | Indicates whether use annotation scale for single line fittings or not. |

|  | Name | Description |
| --- | --- | --- |
|  | GetConduitSettings | Gets the conduit settings of the project. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace