Revit 2026 API

# BuildingPad Properties

---

The BuildingPad type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssociatedTopographySurfaceId | The element id of a topography surface created by the introduction of this building pad. |
|  | HostId | The element id of the topography surface hosting this BuidlingPad. |

#### Reference

BuildingPad Class

Autodesk.Revit.DB.Architecture Namespace