Revit 2026 API

# DockableFrameVisibilityChangedEventArgs Properties

---

The DockableFrameVisibilityChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DockableFrameShown | True if the pane is being shown, false if it is being hidden. |
|  | PaneId | The identifier for dockable pane. |

#### Reference

DockableFrameVisibilityChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace