Revit 2026 API

# CombinableElement Class

---

An element that can be added to a geometry combination.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBGeomCombination

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CombinableElement : Element
```
```vb
Public Class CombinableElement
	Inherits Element
```
```cpp
public ref class CombinableElement : public Element
```
```fsharp
type CombinableElement =
    class
        inherit Element
    end
```

The CombinableElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Combinations | The geometry combinations that this element belongs to. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace