Revit 2026 API

# FilterElementIdRule Methods

---

The FilterElementIdRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UsesLevelFiltering | This function checks if a parameter uses level filtering. |

#### Reference

FilterElementIdRule Class

Autodesk.Revit.DB Namespace