Revit 2026 API

# FamilyPointLocation Class

---

Data corresponding to the point locations in certain types of Family Symbols.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyPointLocation

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyPointLocation : APIObject
```
```vb
Public Class FamilyPointLocation
	Inherits APIObject
```
```cpp
public ref class FamilyPointLocation : public APIObject
```
```fsharp
type FamilyPointLocation =
    class
        inherit APIObject
    end
```

The FamilyPointLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the corresponding reference point in the Family document. |

|  | Name | Description |
| --- | --- | --- |
|  | GetLocation | Gets the location of the point. |

Examples of FamilySymbol objects that contain placement references are Panels and Flexible Components.

#### Reference

Autodesk.Revit.DB Namespace