Revit 2026 API

# SiteSubRegion Methods

---

The SiteSubRegion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, IListCurveLoop) | **Obsolete.** |
|  | Create(Document, IListCurveLoop, ElementId) | **Obsolete.** |
|  | Dispose |  |
|  | GetBoundary | Gets the boundary of current subregion. |
|  | IsValidBoundary |  |
|  | SetBoundary | **Obsolete.** |

#### Reference

SiteSubRegion Class

Autodesk.Revit.DB.Architecture Namespace