Revit 2026 API

# StructuralSection Methods

---

The StructuralSection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBoundarySize | Returns size of the section boundary. |
|  | GetEnumerator |  |

#### Reference

StructuralSection Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace