Revit 2026 API

# RebarShapeConstraintSegmentLength Methods

---

The RebarShapeConstraintSegmentLength type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSegmentEndReferenceType | Choice of two possibilities for the start and end references of the length constraint. |

#### Reference

RebarShapeConstraintSegmentLength Class

Autodesk.Revit.DB.Structure Namespace