Revit 2026 API

# AnalysisDisplayLegend Class

---

The legend that describes an Analysis Visualization.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisAnalysisDisplayLegend

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalysisDisplayLegend : Element
```
```vb
Public Class AnalysisDisplayLegend
	Inherits Element
```
```cpp
public ref class AnalysisDisplayLegend : public Element
```
```fsharp
type AnalysisDisplayLegend =
    class
        inherit Element
    end
```

The AnalysisDisplayLegend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Height | The height, in sheet size, of the legend's rectangle |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Analysis Namespace