Revit 2026 API

# AnalyticalTransferSwitchData Properties

---

The AnalyticalTransferSwitchData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentRating | The current rating value of the electrical analytical transfer switch. |
|  | TotalConnectedCurrent | The total connected current of the electrical analytical transfer switch. |

#### Reference

AnalyticalTransferSwitchData Class

Autodesk.Revit.DB.Electrical Namespace