Revit 2026 API

# MechanicalEquipmentSet Methods

---

The MechanicalEquipmentSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Add |  |
|  | AreElementsNotConnectedInSeries |  |
|  | AreValidMembers |  |
|  | Create |  |
|  | GetMembers | Gets member element ids for the mechanical equipment set. |
|  | Remove |  |

#### Reference

MechanicalEquipmentSet Class

Autodesk.Revit.DB.Mechanical Namespace