Revit 2026 API

# Gutter Class

---

An object that represents a gutter within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBHostedSweep Autodesk.Revit.DB.ArchitectureGutter

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Gutter : HostedSweep
```
```vb
Public Class Gutter
	Inherits HostedSweep
```
```cpp
public ref class Gutter : public HostedSweep
```
```fsharp
type Gutter =
    class
        inherit HostedSweep
    end
```

The Gutter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GutterType | Retrieves/set an object that represents the type of the Gutter. |

|  | Name | Description |
| --- | --- | --- |
|  | AddSegment | Add segments to the gutter.(Overrides HostedSweepAddSegment(Reference)) |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

#### Reference

Autodesk.Revit.DB.Architecture Namespace