Revit 2026 API

# ItemData Methods

---

The ItemData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ItemData Class

Autodesk.Revit.UI Namespace