Revit 2026 API

# Group Class

---

An element representing a single instance of a group of elements that may be placed many times in a project or family.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBGroup

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Group : Element
```
```vb
Public Class Group
	Inherits Element
```
```cpp
public ref class Group : public Element
```
```fsharp
type Group =
    class
        inherit Element
    end
```

The Group type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AttachedParentId | Indicates the Id of the parent group this group is attached to. |
|  | GroupType | Get or set the type of the group. |
|  | IsAttached | Indicates wether or not this group is attached to a parent group. |
|  | Location | This property is used to find the physical location of a group within project.(Overrides ElementLocation) |

|  | Name | Description |
| --- | --- | --- |
|  | GetAvailableAttachedDetailGroupTypeIds | Returns the attached detail groups available for this group type. |
|  | GetMemberIds | Retrieves all the member ElementIds of the group. |
|  | GetShownAttachedDetailGroupTypeIds | Returns the attached detail groups which have displayed instances for this group type in the input view. |
|  | HideAllAttachedDetailGroups | Hides all the available attached detail groups for this element group type that are compatible with the input view type. |
|  | HideAttachedDetailGroups | Hides the element group's attached detail groups of the input group type that are compatible with the input view. |
|  | IsCompatibleAttachedDetailGroupType | Checks if the orientation of the input attached detail group matches the input view's orientation. |
|  | ShowAllAttachedDetailGroups | Shows all the available attached detail groups for this element group type that are compatible with the input view type. |
|  | ShowAttachedDetailGroups | Shows the element group's attached detail groups of the input group type that are compatible with the input view. |
|  | UngroupMembers | Ungroups the group. |

Grouping elements is useful when you need to create entities that represent repeating layouts or are common to many building projects, such as hotel rooms, apartments, or repeating floors.

#### Reference

Autodesk.Revit.DB Namespace