Revit 2026 API

# CancellationListener Class

---

Allows clients to poll the cancellation status of a background operation. Revit instantiates CancellationListener objects for internal background operation implementations only. As such, third-party developers are not expected to instantiate or handle CancellationListener objects.

SystemObject Autodesk.Revit.DBCancellationListener

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CancellationListener : IDisposable
```
```vb
Public Class CancellationListener
	Implements IDisposable
```
```cpp
public ref class CancellationListener : IDisposable
```
```fsharp
type CancellationListener =
    class
        interface IDisposable
    end
```

The CancellationListener type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CancellationListener |
|  | IsCancelled | Returns true if the operation associated with this instance has been cancelled. |

#### Reference

Autodesk.Revit.DB Namespace