Revit 2026 API

# ToggleButtonData Class

---

This class contains information necessary to construct a toggle button in a RadioButtonGroup.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIButtonData Autodesk.Revit.UIPushButtonData Autodesk.Revit.UIToggleButtonData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ToggleButtonData : PushButtonData
```
```vb
Public Class ToggleButtonData
	Inherits PushButtonData
```
```cpp
public ref class ToggleButtonData : public PushButtonData
```
```fsharp
type ToggleButtonData =
    class
        inherit PushButtonData
    end
```

The ToggleButtonData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ToggleButtonData(String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will not be associated to an ExternalCommand. |
|  | ToggleButtonData(String, String, String, String) | Constructs a new instance of ToggleButtonData, where the ToggleButton will execute an ExternalCommand when clicked. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace