Revit 2026 API

# IMemberForcesServer Methods

---

The IMemberForcesServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MemberForcesUpdate | The server's method that will be called when Revit User clicks Member Forces button in the MPP. |

#### Reference

IMemberForcesServer Interface

Autodesk.Revit.DB.Structure Namespace