Revit 2026 API

# AssemblyDifferenceNamingCategory Class

---

The two assemblies being compared have different naming categories

SystemObject Autodesk.Revit.DBAssemblyDifference Autodesk.Revit.DBAssemblyDifferenceNamingCategory

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyDifferenceNamingCategory : AssemblyDifference
```
```vb
Public Class AssemblyDifferenceNamingCategory
	Inherits AssemblyDifference
```
```cpp
public ref class AssemblyDifferenceNamingCategory : public AssemblyDifference
```
```fsharp
type AssemblyDifferenceNamingCategory =
    class
        inherit AssemblyDifference
    end
```

The AssemblyDifferenceNamingCategory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NamingCategoryId1 | Naming category id of the first assembly |
|  | NamingCategoryId2 | Naming category id of the second assembly |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace