Revit 2026 API

# GroupSet Class

---

An set that contains groups.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGroupSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GroupSet : APIObject, IEnumerable
```
```vb
Public Class GroupSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class GroupSet : public APIObject,
	IEnumerable
```
```fsharp
type GroupSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The GroupSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroupSet | Initializes a new instance of the GroupSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of groups that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every group from the set, rendering it empty. |
|  | Contains | Tests for the existence of a group within the set. |
|  | Erase | Removes a specified group from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified group into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace