Revit 2026 API

# SolidGeometryOptions Methods

---

The SolidGeometryOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SolidGeometryOptions Class

Autodesk.Revit.DB Namespace