Revit 2026 API

# TemperatureRatingTypeSetIterator Methods

---

The TemperatureRatingTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

TemperatureRatingTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace