Revit 2026 API

# HostObjAttributes Methods

---

The HostObjAttributes type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetCompoundStructure | Returns an object that represents the compound structure of the element. |
|  | SetCompoundStructure | Sets the compound structure of the element. |

#### Reference

HostObjAttributes Class

Autodesk.Revit.DB Namespace