Revit 2026 API

# KeynoteTable Methods

---

The KeynoteTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetKeynoteTable | Gets the KeynoteTable from a Revit document. |

#### Reference

KeynoteTable Class

Autodesk.Revit.DB Namespace