Revit 2026 API

# RoofBase Class

---

Represents all kinds of Roofs.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBRoofBase Autodesk.Revit.DBExtrusionRoof Autodesk.Revit.DBFootPrintRoof

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RoofBase : HostObject
```
```vb
Public Class RoofBase
	Inherits HostObject
```
```cpp
public ref class RoofBase : public HostObject
```
```fsharp
type RoofBase =
    class
        inherit HostObject
    end
```

The RoofBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EaveCuts | Retrieve or set the EaveCutterType. |
|  | FasciaDepth | Retrieve or set the FasciaDepth. |
|  | RoofType | Retrieve or set the Type. |

|  | Name | Description |
| --- | --- | --- |
|  | GetSlabShapeEditor | Gets a SlabShapeEditor that can used to add or modify points of this RoofBase. |

The RoofBase object represents all kinds of roof in Revit.

#### Reference

Autodesk.Revit.DB Namespace