Revit 2026 API

# BasicLossFactor Properties

---

The BasicLossFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LossFactor | The loss factor. |

#### Reference

BasicLossFactor Class

Autodesk.Revit.DB.Lighting Namespace