Revit 2026 API

# ConceptualConstructionType Properties

---

The ConceptualConstructionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MassSurfaceSubCategoryId | The surface type subcategory element id associated with the ConceptualConstructionType. |
|  | MaterialId | Material used for visualization of this construction. |

#### Reference

ConceptualConstructionType Class

Autodesk.Revit.DB.Analysis Namespace