Revit 2026 API

# AreaScheme Properties

---

The AreaScheme type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsGrossBuildingArea | Indicates if the area scheme is a Gross Building Area scheme. |

#### Reference

AreaScheme Class

Autodesk.Revit.DB Namespace