Revit 2026 API

# HermiteFace Class

---

A cubic hermite spline face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBHermiteFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HermiteFace : Face
```
```vb
Public Class HermiteFace
	Inherits Face
```
```cpp
public ref class HermiteFace : public Face
```
```fsharp
type HermiteFace =
    class
        inherit Face
    end
```

The HermiteFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MixedDerivs | Mixed derivatives of the surface. |
|  | Params | Parameters of the surface. |
|  | Points | Interpolation points of the surface. |
|  | Tangents | Tangents of the surface. |

|  | Name | Description |
| --- | --- | --- |

Hermite faces are defined by cubic hermite spline surfaces bounded by edge loops. The surfaces provide natural UV parameterization to the faces.

#### Reference

Autodesk.Revit.DB Namespace