Revit 2026 API

# TransferringProjectStandardsEventArgs Methods

---

The TransferringProjectStandardsEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetExternalItems | Gets the collection of externally added items which should be shown in the Transfer Project Standards dialog as options. |
|  | SetExternalItems |  |

#### Reference

TransferringProjectStandardsEventArgs Class

Autodesk.Revit.UI.Events Namespace