Revit 2026 API

# ElementArrayIterator Properties

---

The ElementArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ElementArrayIterator Class

Autodesk.Revit.DB Namespace