Revit 2026 API

# ReferenceArrayArrayIterator Class

---

An iterator to a ReferenceArray array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBReferenceArrayArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ReferenceArrayArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ReferenceArrayArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ReferenceArrayArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ReferenceArrayArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ReferenceArrayArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ReferenceArrayArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace