Revit 2026 API

# EdgeArrayIterator Properties

---

The EdgeArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

EdgeArrayIterator Class

Autodesk.Revit.DB Namespace