Revit 2026 API

# MullionTypeSetIterator Properties

---

The MullionTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

MullionTypeSetIterator Class

Autodesk.Revit.DB Namespace