Revit 2026 API

# IndexPoint Class

---

A point primitive consisting of one index.

SystemObject Autodesk.Revit.DB.DirectContext3DIndexPrimitive Autodesk.Revit.DB.DirectContext3DIndexPoint

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexPoint : IndexPrimitive
```
```vb
Public Class IndexPoint
	Inherits IndexPrimitive
```
```cpp
public ref class IndexPoint : public IndexPrimitive
```
```fsharp
type IndexPoint =
    class
        inherit IndexPrimitive
    end
```

The IndexPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IndexPoint | Constructs the point primitive. |

|  | Name | Description |
| --- | --- | --- |
|  | Index | The index of the point's vertex. |

|  | Name | Description |
| --- | --- | --- |
|  | GetSizeInShortInts | Gets the amount of storage that the primitive takes up in a buffer, measured in short integers. |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace