Revit 2026 API

# FaceWall Class

---

A wall attached to a non-vertical massing face.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBFaceWall

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceWall : HostObject
```
```vb
Public Class FaceWall
	Inherits HostObject
```
```cpp
public ref class FaceWall : public HostObject
```
```fsharp
type FaceWall =
    class
        inherit HostObject
    end
```

The FaceWall type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a wall attached to a non-vertical massing face. |
|  | IsValidFaceReferenceForFaceWall | Identifies if a reference may be used as the parent of a face wall. |
|  | IsWallTypeValidForFaceWall | Identifies if a wall type may be applied to a face wall. |

#### Reference

Autodesk.Revit.DB Namespace