Revit 2026 API

# FlexDuctType Class

---

A flex duct type in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBMEPCurveType Autodesk.Revit.DB.MechanicalFlexDuctType

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FlexDuctType : MEPCurveType
```
```vb
Public Class FlexDuctType
	Inherits MEPCurveType
```
```cpp
public ref class FlexDuctType : public MEPCurveType
```
```fsharp
type FlexDuctType =
    class
        inherit MEPCurveType
    end
```

The FlexDuctType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The flex duct type is only available in the Autodesk Revit MEP product.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace