Revit 2026 API

# FileArgumentAlreadyExistsException Methods

---

The FileArgumentAlreadyExistsException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ArgumentExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

FileArgumentAlreadyExistsException Class

Autodesk.Revit.Exceptions Namespace