Revit 2026 API

# StairsLandingType Properties

---

The StairsLandingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsMonolithic | True if the stairs landing is monolithic, false otherwise. |
|  | Thickness | Thickness of the stairs landing. |

#### Reference

StairsLandingType Class

Autodesk.Revit.DB.Architecture Namespace