Revit 2026 API

# RevitAPIPostDocEventArgs Properties

---

The RevitAPIPostDocEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Document | The document associated with the event. |

#### Reference

RevitAPIPostDocEventArgs Class

Autodesk.Revit.DB.Events Namespace