Revit 2026 API

# MechanicalEquipmentSet Class

---

A set of interrelated mechanical equipment in a MEP system that works together.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.MechanicalMechanicalEquipmentSet

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MechanicalEquipmentSet : Element
```
```vb
Public Class MechanicalEquipmentSet
	Inherits Element
```
```cpp
public ref class MechanicalEquipmentSet : public Element
```
```fsharp
type MechanicalEquipmentSet =
    class
        inherit Element
    end
```

The MechanicalEquipmentSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Classification | The classification for the mechanical equipment set. |
|  | OnDuty | The number of pieces of mechanical equipment operating in parallel at any given time. |
|  | OnStandby | The number of pieces of mechanical equipment that are not operational at any given time. |

|  | Name | Description |
| --- | --- | --- |
|  | Add |  |
|  | AreElementsNotConnectedInSeries |  |
|  | AreValidMembers |  |
|  | Create |  |
|  | GetMembers | Gets member element ids for the mechanical equipment set. |
|  | Remove |  |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace