Revit 2026 API

# LinkElementId Methods

---

The LinkElementId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |

#### Reference

LinkElementId Class

Autodesk.Revit.DB Namespace