Revit 2026 API

# CitySet Properties

---

The CitySet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of cities that are in the set. |

#### Reference

CitySet Class

Autodesk.Revit.DB Namespace