Revit 2026 API

# ElementSetIterator Class

---

An iterator to an element set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBElementSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ElementSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ElementSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ElementSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ElementSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ElementSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace