Revit 2026 API

# AssetPropertyString Properties

---

The AssetPropertyString type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | value of the property |

#### Reference

AssetPropertyString Class

Autodesk.Revit.DB.Visual Namespace