Revit 2026 API

# SystemZoneElementType Class

---

Represents an element type for a system-zone element.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.MechanicalSystemZoneElementType

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SystemZoneElementType : ElementType
```
```vb
Public Class SystemZoneElementType
	Inherits ElementType
```
```cpp
public ref class SystemZoneElementType : public ElementType
```
```fsharp
type SystemZoneElementType =
    class
        inherit ElementType
    end
```

The SystemZoneElementType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AirChangesPerHour | The air changes per hour. |
|  | CoolingSetPoint | The cooling temperature set point in unit Kelvin (K). |
|  | DehumidificationSetPoint | The humidification set point as a number between 0 and 1. |
|  | GeometricDefinition | The geometric definition for this element type. |
|  | HeatingSetPoint | The heating temperature set point in unit Kelvin (K). |
|  | HumidificationSetPoint | The humidification set point as a number between 0 and 1. |
|  | OutdoorAirPerArea | The outdoor air per area in unit feet per second. |
|  | OutdoorAirPerPerson | The outdoor air in unit cubic feet per second per person. |
|  | UseDehumidificationSetPoint | Use the dehumidification set point. |
|  | UseHumidificationSetPoint | Use the humidification set point. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateSketchBased | Creates a new element type for sketch-based system-zone elements and adds it to the document. |
|  | CreateSpaceBased | Creates a new element type for space-based system-zone elements and adds it to the document. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace