Revit 2026 API

# WaterLoopData Methods

---

The WaterLoopData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

WaterLoopData Class

Autodesk.Revit.DB.Mechanical Namespace