Revit 2026 API

# FabricationDimensionDefinition Class

---

Represents the definition of a single fabrication pattern dimension. Together all dimensions represent the parametric definition of the fabrication part.

SystemObject Autodesk.Revit.DBFabricationDimensionDefinition

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationDimensionDefinition : IDisposable
```
```vb
Public Class FabricationDimensionDefinition
	Implements IDisposable
```
```cpp
public ref class FabricationDimensionDefinition : IDisposable
```
```fsharp
type FabricationDimensionDefinition =
    class
        interface IDisposable
    end
```

The FabricationDimensionDefinition type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsModifiable | If the fabrication dimension is modifiable by user. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | Fabrication dimension name. |
|  | Type | Fabrication dimension type. |
|  | UnitType | Fabrication dimension unit type. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FabricationDimensionDefinition |

#### Reference

Autodesk.Revit.DB Namespace