Revit 2026 API

# ElementOwnerViewFilter Class

---

A filter used to match elements which are owned by a particular view.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementOwnerViewFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementOwnerViewFilter : ElementQuickFilter
```
```vb
Public Class ElementOwnerViewFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementOwnerViewFilter : public ElementQuickFilter
```
```fsharp
type ElementOwnerViewFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementOwnerViewFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementOwnerViewFilter(ElementId) | Constructs a new instance of a filter to match elements which are owned by a particular view. |
|  | ElementOwnerViewFilter(ElementId, Boolean) | Constructs a new instance of a filter to match elements which are owned by a particular view, with the option to invert the filter and find elements not owned by the given view. |

|  | Name | Description |
| --- | --- | --- |
|  | ViewId | The view id. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace