Revit 2026 API

# NurbSpline Methods

---

The NurbSpline type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new geometric NurbSpline object from a HermiteSpline. |
|  | CreateCurve(HermiteSpline) | Creates a new geometric Curve object by converting the given HermiteSpline. The created curve may be a NURBSpline or a simpler curve such as line or arc. |
|  | CreateCurve(IListXYZ, IListDouble) |  |
|  | CreateCurve(Int32, IListDouble, IListXYZ) |  |
|  | CreateCurve(Int32, IListDouble, IListXYZ, IListDouble) |  |
|  | SetControlPointsAndWeights |  |

#### Reference

NurbSpline Class

Autodesk.Revit.DB Namespace