Revit 2026 API

# ExportFontInfo Methods

---

The ExportFontInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportFontInfo Class

Autodesk.Revit.DB Namespace