Revit 2026 API

# NumberingSchema Methods

---

The NumberingSchema type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AppendSequence | Appends all elements of one numbering sequence to the end of another sequence. |
|  | AssignElementsToSequence |  |
|  | ChangeNumber | Replaces an existing number with a new one (that does not exist yet). |
|  | GetMinimumNumberOfDigits | Returns the minimum number of digits to be used for formating the Number parameter of all enumerable elements of the given document. |
|  | GetNumberingSchema | Returns an instance of the specified Numbering Schema in the given document. |
|  | GetNumberingSequences | Returns all numbering sequences within this numbering schema. |
|  | GetNumbers | Returns all numbers currently used in the given numbering sequence |
|  | GetSchemasInDocument | Returns a set of Ids of all Numbering Schema elements for a given document. |
|  | IsValidPartitionName | Tests if the given string can be used as a name for a numbering partition. |
|  | MergeSequences |  |
|  | MoveSequence | Moves all elements of a numbering sequence from one partition to another. |
|  | RemoveGaps | Removes gaps, if any, in a numbering sequence |
|  | SetMinimumNumberOfDigits | Sets a new value for the minimum number of digits to be used for formating the Number parameter of all numbered elements of the given document. |
|  | ShiftNumbers | Shifts all numbers in the sequence so the starting number has the given value. |

#### Reference

NumberingSchema Class

Autodesk.Revit.DB Namespace