Revit 2026 API

# TransformWithBoundary Methods

---

The TransformWithBoundary type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetBoundary | Returns the boundary for the model space to view projection space transform. |
|  | GetModelToProjectionTransform | Gets the model space to view projection space transform. |

#### Reference

TransformWithBoundary Class

Autodesk.Revit.DB Namespace