Revit 2026 API

# ConnectionValidationInfo Methods

---

The ConnectionValidationInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetWarning | Access specific warning number of warnings generated by reload. |
|  | IsValidWarningIndex | Validate warning index. |
|  | ManyWarnings | Returns number of warnings generated by reload. |

#### Reference

ConnectionValidationInfo Class

Autodesk.Revit.DB Namespace