Revit 2026 API

# Control Class

---

A control in Autodesk Revit family document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBControl

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Control : Element
```
```vb
Public Class Control
	Inherits Element
```
```cpp
public ref class Control : public Element
```
```fsharp
type Control =
    class
        inherit Element
    end
```

The Control type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Origin | The control origin. |
|  | Shape | The control shape. |
|  | View | The view. |

|  | Name | Description |
| --- | --- | --- |

The object represents a variety of different shapes of controls in family document. The different shapes of controls can handle the family instance in different ways.

  * A vertical/horizontal arrow control rotates the instance by 180 degrees.
  * A double vertical arrow control mirrors the instance geometry vertically.
  * A double horizontal arrow control mirrors the instance geometry horizontally.

#### Reference

Autodesk.Revit.DB Namespace