Revit 2026 API

# FormulaManager Class

---

A class to access and query information about formula engine in Revit models.

SystemObject Autodesk.Revit.DBFormulaManager

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FormulaManager : IDisposable
```
```vb
Public Class FormulaManager
	Implements IDisposable
```
```cpp
public ref class FormulaManager : IDisposable
```
```fsharp
type FormulaManager =
    class
        interface IDisposable
    end
```

The FormulaManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FormulaManager |
|  | Evaluate | Evaluates value of the formula |
|  | GetFunctions | Gets list of function names supported by formula engine |
|  | GetOperators | Gets list of operator names supported by formula engine |
|  | Validate | Validates the formuls |

Formula manager

#### Reference

Autodesk.Revit.DB Namespace