Revit 2026 API

# FailureMessage Class

---

Represents a message describing a failure of an operation in Revit.

SystemObject Autodesk.Revit.DBFailureMessage

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FailureMessage : IDisposable
```
```vb
Public Class FailureMessage
	Implements IDisposable
```
```cpp
public ref class FailureMessage : IDisposable
```
```fsharp
type FailureMessage =
    class
        interface IDisposable
    end
```

The FailureMessage type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FailureMessage | Creates a new FailureMessage related to a given FailureDefinition. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | AddResolution | Adds a resolution for the failure. |
|  | Dispose | Releases all resources used by the FailureMessage |
|  | GetAdditionalElements | Retrieves list of the additional reference elements for the failure. |
|  | GetDefaultResolutionCaption | Retrieves the caption of the default resolution of the failure. |
|  | GetDescriptionText | Retrieves the description text of the failure. |
|  | GetFailingElements | Retrieves list of the elements that have caused the failure. |
|  | GetFailureDefinitionId | Retrieves the id of the failure definition for the failure. |
|  | GetSeverity | Retrieves the severity of the failure. |
|  | HasResolutionOfType | Checks if failure has a resolution of a given type. |
|  | HasResolutions | Checks if the failure has any resolutions. |
|  | SetAdditionalElement | Sets the additional reference element for the failure. |
|  | SetAdditionalElements |  |
|  | SetFailingElement | Sets the element that has caused the failure. |
|  | SetFailingElements |  |

Failure messages are typically shown to the user in the Revit error dialog. This class contains the following information about the failures:

  1. The basic description of the failure (retrieved from the FailureDefinition)
  2. The available resolutions for the failure.
  3. The elements related to the failure.

#### Reference

Autodesk.Revit.DB Namespace