Revit 2026 API

# ViewDrafting Class

---

ViewDrafting represents a drafting view within the model.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBView Autodesk.Revit.DBViewDrafting Autodesk.Revit.DBImageView

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewDrafting : View
```
```vb
Public Class ViewDrafting
	Inherits View
```
```cpp
public ref class ViewDrafting : public View
```
```fsharp
type ViewDrafting =
    class
        inherit View
    end
```

The ViewDrafting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new ViewDrafting in the model. |

#### Reference

Autodesk.Revit.DB Namespace