Revit 2026 API

# CurveElementFilter Properties

---

The CurveElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveElementType | The curve element type. |

#### Reference

CurveElementFilter Class

Autodesk.Revit.DB Namespace