Revit 2026 API

# PolylineNode Class

---

An output node that represents a 3D polyline.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBModelCurveNode Autodesk.Revit.DBPolylineNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PolylineNode : ModelCurveNode
```
```vb
Public Class PolylineNode
	Inherits ModelCurveNode
```
```cpp
public ref class PolylineNode : public ModelCurveNode
```
```fsharp
type PolylineNode =
    class
        inherit ModelCurveNode
    end
```

The PolylineNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetPolyline | Returns the polyline object corresponding to the node. |

See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPolyline].

#### Reference

Autodesk.Revit.DB Namespace