Revit 2026 API

# ExternalResourceServerExtensions Methods

---

The ExternalResourceServerExtensions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCADLinkOperations | Gets the specific methods supported by external resource CAD Links. |
|  | GetRevitLinkOperations | Gets the specific methods supported by the external resource of Revit Links. |

#### Reference

ExternalResourceServerExtensions Class

Autodesk.Revit.DB Namespace