Revit 2026 API

# ExternalResourceMatchOptions Class

---

Represents match options used to filter external resources when listing them from external resource server.

SystemObject Autodesk.Revit.DBExternalResourceMatchOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalResourceMatchOptions : IDisposable
```
```vb
Public Class ExternalResourceMatchOptions
	Implements IDisposable
```
```cpp
public ref class ExternalResourceMatchOptions : IDisposable
```
```fsharp
type ExternalResourceMatchOptions =
    class
        interface IDisposable
    end
```

The ExternalResourceMatchOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalResourceMatchOptions | Constructs new instance with specified resource type. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ResourceType | The desired resource type which external resources should match. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternalResourceMatchOptions |

#### Reference

Autodesk.Revit.DB Namespace