Revit 2026 API

# MessageBoxShowingEventArgs Properties

---

The MessageBoxShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DialogType | An integer that describes the standard Windows type of the dialog box. |
|  | Message | The message that has been displayed in the dialog box. |

#### Reference

MessageBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace