Revit 2026 API

# SynchronizeWithCentralOptions Methods

---

The SynchronizeWithCentralOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetRelinquishOptions | Gets the options which govern whether or not to relinquish elements and workset types. |
|  | SetRelinquishOptions | Sets the options which govern whether or not to relinquish elements and workset types. |

#### Reference

SynchronizeWithCentralOptions Class

Autodesk.Revit.DB Namespace