Revit 2026 API

# PhaseArrayIterator Methods

---

The PhaseArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

PhaseArrayIterator Class

Autodesk.Revit.DB Namespace