Revit 2026 API

# FormulaEditingEventArgs Properties

---

The FormulaEditingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentDocument | Returns the current document |
|  | Formula | Returns text of the formula that will be modified |
|  | ParameterId | Returns the Id of the modified parameter |

#### Reference

FormulaEditingEventArgs Class

Autodesk.Revit.UI.Events Namespace