Revit 2026 API

# PolylineSegments Class

---

An output node that represents a tessellated polyline segments.

SystemObject Autodesk.Revit.DBPolylineSegments

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PolylineSegments : IDisposable
```
```vb
Public Class PolylineSegments
	Implements IDisposable
```
```cpp
public ref class PolylineSegments : IDisposable
```
```fsharp
type PolylineSegments =
    class
        interface IDisposable
    end
```

The PolylineSegments type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndLocalParameter | Local parameter associated with the end point. |
|  | EndParameter | Parameter associated with the end point. |
|  | IsFilled | Indicates whether the area enclosed by the polyline is to be filled or not. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LineProperties | Access to the line (pen) properties of the polyline |
|  | StartLocalParameter | Local parameter associated with the start point. |
|  | StartParameter | Parameter associated with the start point. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the PolylineSegments |
|  | GetVertices | Returns an array of vertices of the polyline segments. |

See also: [!:Autodesk::Revit::DB::IModelExportContext::OnPolylineSegments].

#### Reference

Autodesk.Revit.DB Namespace