Revit 2026 API

# AnalyticalModelSelector Class

---

Defines a portion of an Analytical Model for an Element.

SystemObject Autodesk.Revit.DB.StructureAnalyticalModelSelector

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AnalyticalModelSelector : IDisposable
```
```vb
Public Class AnalyticalModelSelector
	Implements IDisposable
```
```cpp
public ref class AnalyticalModelSelector : IDisposable
```
```fsharp
type AnalyticalModelSelector =
    class
        interface IDisposable
    end
```

The AnalyticalModelSelector type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AnalyticalModelSelector | Creates a selector for the analytical model geometry. |
|  | AnalyticalModelSelector(AnalyticalCurveSelector) | Creates a selector for the analytical model geometry. |
|  | AnalyticalModelSelector(Curve) | Creates a selector based on a specific analytical curve. |
|  | AnalyticalModelSelector(Curve, AnalyticalCurveSelector) | Creates a selector based on one portion of a specific analytical curve. |

|  | Name | Description |
| --- | --- | --- |
|  | CurveSelector | The portion of the curve to be selected. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AnalyticalModelSelector |

This is used to identify the portion of an analytical model of interest to a client. To identify the portion of the analytical model, the client must identify the curve in question, by using one of the following:

  * The specific curve within the analytical model.
  * The index of the curve within the analytical model.

If a specific part of that curve is of interest, the client needs to identify that by specifying one of the following:
  * The start of the curve.
  * The end of the curve.
  * The entire curve. This is the default behavior, so this does not need specifying.

#### Reference

Autodesk.Revit.DB.Structure Namespace