Revit 2026 API

# MEPConnectorInfo Methods

---

The MEPConnectorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

MEPConnectorInfo Class

Autodesk.Revit.DB Namespace