Revit 2026 API

# CurveElementFilter Class

---

A filter used to pass curve elements which are of a specific type.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBCurveElementFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveElementFilter : ElementSlowFilter
```
```vb
Public Class CurveElementFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class CurveElementFilter : public ElementSlowFilter
```
```fsharp
type CurveElementFilter =
    class
        inherit ElementSlowFilter
    end
```

The CurveElementFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveElementFilter(CurveElementType) | Constructs a new instance of a filter to match specific types of curve elements. |
|  | CurveElementFilter(CurveElementType, Boolean) | Constructs a new instance of a filter to match specific types of curve elements, with the option to match all curves which are not of the given curve type. |

|  | Name | Description |
| --- | --- | --- |
|  | CurveElementType | The curve element type. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace