Revit 2026 API

# AreaVolumeSettings Properties

---

The AreaVolumeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ComputeVolumes | True to enable volume computation. False to disable it. |

#### Reference

AreaVolumeSettings Class

Autodesk.Revit.DB Namespace