Revit 2026 API

# RebarConstraint Methods

---

The RebarConstraint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConstrainsRebarEnds | Returns true if this constraint constrains two rebar ends. |
|  | Create |  |
|  | CreateConstraintToSurface | This method creates a constraint of 'To Surface' type for a given RebarConstrainedHandle.The RebarConstrainedHandle should belong to a shape driven rebar, otherwise it will throw exception. |
|  | Dispose |  |
|  | FlipHandleOverTarget | Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value. |
|  | FlipSideForClearBarSpacingZeroDistanceConstraint | Flips the side on which a RebarConstrainedHandle constrained using clear bar distance with zero offset connects to another Rebar target handle. |
|  | GetConstraintType | Returns the RebarConstraintType of a RebarConstraint. |
|  | GetCustomHandleTag | Returns the handle tag of the RebarConstrainedHandle. This is valid only for Free Form Rebar. |
|  | GetDistanceToTargetCover | Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover'. |
|  | GetDistanceToTargetHostFace | Returns the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'. |
|  | GetDistanceToTargetRebar | Gets the distance from the RebarConstrainedHandle to the target Rebar handle surface. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'. |
|  | GetPositiveOffsetDirectionForToOtherRebarConstraint | Returns the positive offset direction vector. |
|  | GetRebarConstrainedHandle | Gets the RebarConstrainedHandle for which this constraint is. |
|  | GetRebarConstraintTargetHostFaceType | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint. |
|  | GetRebarConstraintTargetHostFaceType(Int32) | Returns the RebarConstraintTargetHostFaceType of the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. |
|  | GetSurfaceForConstraintToSurface | This method retrieves the surface for a constraint of 'To Surface' type. |
|  | GetTargetCoverType | Returns the RebarCoverType for the face specified by targetIndex. Returns null if no RebarHostData is present for target element. |
|  | GetTargetElement | Gets the Element object (either Host or Rebar) which provides the constraint. Will throw exception if it's a multi target constraint. |
|  | GetTargetElement(Int32) | Gets the Element object (either Host or Rebar) which provides the constraint. Will return the Element which contains the face at targetIndex. |
|  | GetTargetHostFaceAndTransform | Returns the face to which the RebarConstraint is attached associated to the given target index. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. |
|  | GetTargetHostFaceReference | Returns a reference to the host Element face to which the RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. Will throw exception if it's a multi target constraint. |
|  | GetTargetHostFaceReference(Int32) | Returns a reference that corresponds to the face to which the RebarConstraint is attached specified by the targetIndex. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace' or 'ToCover'. |
|  | GetTargetRebarAngleOnBarOrHookBend | Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached. |
|  | GetTargetRebarBendNumber | Returns the number of the bend on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'BarBend'. Rebar must be Shape Driven Rebar element. |
|  | GetTargetRebarConstraintType | Returns the TargetRebarConstraintType of the handle on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'. Rebar must be Shape Driven Rebar element. |
|  | GetTargetRebarEdgeNumber | Returns the number of the edge on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'Edge'. Rebar must be Shape Driven Rebar element. |
|  | GetTargetRebarHandleBehavior | Gets the RebarHandleBehavior of the handle of the other Rebar Element to which this RebarConstraint is attached. The RebarConstraintType of the RebarConstraint must be 'ToOtherRebar'. |
|  | GetTargetRebarHookBarEnd | Returns 0 or 1 to indicate which end hook on the other Rebar Element to which this RebarConstraint is attached. The RebarConstraint must be of RebarConstraintType 'ToOtherRebar,' and the TargetRebarConstraintType must be 'HookBend'. Rebar must be Shape Driven Rebar element. |
|  | HasAnEdgeNumber | Checks if the getTargetRebarEdgeNumber method can be called for the RebarConstraint. |
|  | IsBindingHandleWithTarget | Gets the relationship between two RebarConstrainedHandles. |
|  | IsEqual | Checks if the specified RebarConstraint is the same as 'this'. The method can be used to determine which of the RebarConstraint candidates offered by the RebarConstraintsManager is currently active. |
|  | IsFixedDistanceToHostFace | Checks if the RebarConstraintType of the RebarConstraint is 'FixedDistanceToHostFace'. |
|  | IsReferenceValidForConstraint | Checks if the reference provided can be used in creating Rebar constraints |
|  | IsToCover | Checks if the RebarConstraintType of the RebarConstraint is 'ToCover'. Returns true if the RebarConstraintType of the RebarConstraint is 'ToCover', false otherwise. |
|  | IsToHostFaceOrCover | Returns true if the RebarConstraintType of the RebarConstraint is either 'FixedDistanceToHostFace' or 'ToCover'. |
|  | IsToOtherRebar | Checks if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar'. |
|  | IsToSurface | Checks if the RebarConstraintType of the RebarConstraint is 'ToSurface'. |
|  | IsUsingClearBarSpacing | Returns true if the RebarConstrainedHandle to target offset is the clear bar distance, false if the offset is measured between bar centers. |
|  | IsValid | Checks that the RebarConstraint still has access to valid Rebar constraint data and that its RebarConstraintsManager is still valid. |
|  | IsValidSurfaceToConstraintHandleTo | Checks if the surface can be used to create a constraint to it for the input handle. |
|  | ReplaceReferenceTargets |  |
|  | SetDistanceToTargetCover | Sets the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover'. |
|  | SetDistanceToTargetHostFace | Sets the distance from the RebarConstrainedHandle to the target Host Element surface. The RebarConstraintType of the RebarConstraint must be 'FixedDistanceToHostFace'. |
|  | SetDistanceToTargetRebar | Sets the offset distance between the constrained RebarConstrainedHandle and its target Rebar handle surface. |
|  | SetToBindHandleWithTarget | Sets the relationship between two RebarConstrainedHandles. |
|  | SetToUseClearBarSpacing | Sets whether the RebarConstrainedHandle to target offset is the clear bar distance, or is measured between bar centers. |
|  | TargetIsBarBend | Returns true if the RebarTargetConstraintType of the RebarConstraint is 'BarBend'. |
|  | TargetIsHookBend | Returns true if the RebarTargetConstraintType of the RebarConstraint is 'HookBend'. |
|  | TargetRebarConstraintTypeIsEdge | Returns true if the RebarConstraintType of the RebarConstraint is 'ToOtherRebar,' and the RebarConstraint is attached to an edge of the other Rebar Element. |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace