Revit 2026 API

# ProjectLocationSetIterator Methods

---

The ProjectLocationSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

ProjectLocationSetIterator Class

Autodesk.Revit.DB Namespace