Revit 2026 API

# ThemeChangedEventArgs Properties

---

The ThemeChangedEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThemeChangedType | Get the application frame theme Type. |

#### Reference

ThemeChangedEventArgs Class

Autodesk.Revit.UI.Events Namespace