Revit 2026 API

# RevitLinkOptions Methods

---

The RevitLinkOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetWorksetConfiguration | Gets the set of worksets to open when creating the link. |
|  | SetWorksetConfiguration | Sets the set of worksets to open when creating the link. |

#### Reference

RevitLinkOptions Class

Autodesk.Revit.DB Namespace