Revit 2026 API

# MechanicalEquipmentSetType Class

---

Represents a type for a set of interrelated mechanical equipment in a MEP system that works together.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.MechanicalMechanicalEquipmentSetType

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MechanicalEquipmentSetType : ElementType
```
```vb
Public Class MechanicalEquipmentSetType
	Inherits ElementType
```
```cpp
public ref class MechanicalEquipmentSetType : public ElementType
```
```fsharp
type MechanicalEquipmentSetType =
    class
        inherit ElementType
    end
```

The MechanicalEquipmentSetType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new type of a mechanical equipment set and adds it to the document. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace