Revit 2026 API

# RadialDimension Class

---

An object that represents an Radial Dimension within the Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDimension Autodesk.Revit.DBRadialDimension

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RadialDimension : Dimension
```
```vb
Public Class RadialDimension
	Inherits Dimension
```
```cpp
public ref class RadialDimension : public Dimension
```
```fsharp
type RadialDimension =
    class
        inherit Dimension
    end
```

The RadialDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of an Radial Dimension element within the project. |

#### Reference

Autodesk.Revit.DB Namespace