Revit 2026 API

# ModelCurveArrArrayIterator Class

---

An iterator to a array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBModelCurveArrArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ModelCurveArrArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ModelCurveArrArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ModelCurveArrArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ModelCurveArrArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ModelCurveArrArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ModelCurveArrArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace