Revit 2026 API

# ReferenceArrayIterator Methods

---

The ReferenceArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ReferenceArrayIterator Class

Autodesk.Revit.DB Namespace