Revit 2026 API

# ServerModelCorruptedException Methods

---

The ServerModelCorruptedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides CentralModelExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ServerModelCorruptedException Class

Autodesk.Revit.Exceptions Namespace