Revit 2026 API

# RebarShapeConstraintFixedSegmentDir Properties

---

The RebarShapeConstraintFixedSegmentDir type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Direction | The direction of the RebarShapeSegment in UV-space. |

#### Reference

RebarShapeConstraintFixedSegmentDir Class

Autodesk.Revit.DB.Structure Namespace