Revit 2026 API

# SpatialElementTag Methods

---

The SpatialElementTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveToReferenceLocation | Moves the SpatialElementTag to the location of SpatialElement that the tag is associated with. |

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace