Revit 2026 API

# FormArrayIterator Properties

---

The FormArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

FormArrayIterator Class

Autodesk.Revit.DB Namespace