Revit 2026 API

# DocumentSetIterator Methods

---

The DocumentSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

DocumentSetIterator Class

Autodesk.Revit.DB Namespace