Revit 2026 API

# StairsComponentConnection Methods

---

The StairsComponentConnection type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

StairsComponentConnection Class

Autodesk.Revit.DB.Architecture Namespace