Revit 2026 API

# DesignOption Methods

---

The DesignOption type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetActiveDesignOptionId | Gets the active design option id for the document. |

#### Reference

DesignOption Class

Autodesk.Revit.DB Namespace