Revit 2026 API

# PipeScheduleType Class

---

Represents a pipe schedule type in the Autodesk Revit MEP product.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.PlumbingPipeScheduleType

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PipeScheduleType : ElementType
```
```vb
Public Class PipeScheduleType
	Inherits ElementType
```
```cpp
public ref class PipeScheduleType : public ElementType
```
```fsharp
type PipeScheduleType =
    class
        inherit ElementType
    end
```

The PipeScheduleType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new pipe schedule type with the given name. |
|  | GetPipeScheduleId | Returns an existing pipe schedule type with the same name. |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace