Revit 2026 API

# PathOfTravel Methods

---

The PathOfTravel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(View, XYZ, XYZ) | Creates a new path of travel between two points. |
|  | Create(View, XYZ, XYZ, PathOfTravelCalculationStatus) | Creates a new path of travel between two points and provides creation result status. |
|  | CreateMapped(View, IListXYZ, IListXYZ) |  |
|  | CreateMapped(View, IListXYZ, IListXYZ, IListPathOfTravelCalculationStatus) |  |
|  | CreateMultiple(View, IListXYZ, IListXYZ) |  |
|  | CreateMultiple(View, IListXYZ, IListXYZ, IListPathOfTravelCalculationStatus) |  |
|  | FindEndsOfShortestPaths |  |
|  | FindShortestPaths |  |
|  | FindStartsOfLongestPathsFromRooms |  |
|  | GetCurves | Gets the array of curves representing the path of travel. |
|  | GetWaypoints | return the waypoints set for the Path of Travel |
|  | InsertWaypoint | Insert a waypoint at the specified index |
|  | IsInRevealObstaclesMode | Returns current state of Reveal Obstacles mode for the given view. |
|  | RemoveWaypoint | Remove a waypoint. |
|  | SetRevealObstaclesMode | Sets Reveal Obstacles mode for the given view. |
|  | SetWaypoint | Updates the specified waypoint. |
|  | Update | Updates the path of travel by recalculating the path between the original start and end points. |
|  | UpdateMultiple(Document, IListElementId) |  |
|  | UpdateMultiple(Document, IListElementId, IListPathOfTravelCalculationStatus) |  |

#### Reference

PathOfTravel Class

Autodesk.Revit.DB.Analysis Namespace