Revit 2026 API

# SaveOptions Methods

---

The SaveOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

SaveOptions Class

Autodesk.Revit.DB Namespace