Revit 2026 API

# AutoJoinFailedException Methods

---

The AutoJoinFailedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

AutoJoinFailedException Class

Autodesk.Revit.Exceptions Namespace