Revit 2026 API

# ShapeImporter Class

---

A utility class that supports conversion of geometry stored in an external format into a Revit geometry objects.

SystemObject Autodesk.Revit.DBShapeImporter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ShapeImporter : IDisposable
```
```vb
Public Class ShapeImporter
	Implements IDisposable
```
```cpp
public ref class ShapeImporter : IDisposable
```
```fsharp
type ShapeImporter =
    class
        interface IDisposable
    end
```

The ShapeImporter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ShapeImporter | Default constructor. Initializes an instance of ShapeImporter that will automatically recognize the file format from its extension (ShapeImporterSourceFormat.Auto). |

|  | Name | Description |
| --- | --- | --- |
|  | DefaultLengthUnit | The length unit to be used if not specified when the input is a unitless SAT file. |
|  | InputFormat | The format of the incoming data. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Convert | Converts the geometry stored in the external format into a collection of Revit geometry objects. |
|  | Dispose | Releases all resources used by the ShapeImporter |
|  | IsServiceAvailable | Checks whether the data conversion service and Material Library are available. |
|  | SetDefaultLengthUnit | Sets the length unit to be used when the input is a unitless SAT file. |

See ShapeImporterSourceFormat for the list of supported formats.

#### Reference

Autodesk.Revit.DB Namespace