Revit 2026 API

# ConduitSettings Methods

---

The ConduitSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetConduitSettings | Gets the conduit settings of the project. |

#### Reference

ConduitSettings Class

Autodesk.Revit.DB.Electrical Namespace