Revit 2026 API

# GenericForm Class

---

Provides access to the Generic Form model in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GenericForm : CombinableElement
```
```vb
Public Class GenericForm
	Inherits CombinableElement
```
```cpp
public ref class GenericForm : public CombinableElement
```
```fsharp
type GenericForm =
    class
        inherit CombinableElement
    end
```

The GenericForm type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsSolid | Identifies if the GenericForm is a solid or a void element. |
|  | Name | Get and Set the Name property(Overrides ElementName) |
|  | Subcategory | The subcategory. |
|  | Visible | The visibility of the GenericForm. |

|  | Name | Description |
| --- | --- | --- |
|  | GetVisibility | Gets the visibility for the generic form. |
|  | SetVisibility | Sets the visibility for the generic form. |

The Generic Form object can be queried for a generic form for use in family modeling and massing. It is the base class of Sweep, Blend, Extrusion, Revolution.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBBlend Autodesk.Revit.DBExtrusion Autodesk.Revit.DBForm Autodesk.Revit.DBFreeFormElement Autodesk.Revit.DBRevolution Autodesk.Revit.DBSweep Autodesk.Revit.DBSweptBlend