Revit 2026 API

# LineSegment Class

---

An output node that represents a tessellated line segment.

SystemObject Autodesk.Revit.DBLineSegment

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LineSegment : IDisposable
```
```vb
Public Class LineSegment
	Implements IDisposable
```
```cpp
public ref class LineSegment : IDisposable
```
```fsharp
type LineSegment =
    class
        interface IDisposable
    end
```

The LineSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndParameter | Parameter associated with the end point. |
|  | EndPoint | End point of the line segment. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LineProperties | Access to the line (pen) properties of the line |
|  | StartParameter | Parameter associated with the start point. |
|  | StartPoint | Start point of the line segment. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LineSegment |

See also: [!:Autodesk::Revit::DB::IModelExportContext::OnLineSegment].

#### Reference

Autodesk.Revit.DB Namespace