Revit 2026 API

# IntersectingElementData Methods

---

The IntersectingElementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IntersectingElementData Class

Autodesk.Revit.DB Namespace