Revit 2026 API

# GeomCombinationSetIterator Methods

---

The GeomCombinationSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

GeomCombinationSetIterator Class

Autodesk.Revit.DB Namespace