Revit 2026 API

# BarTypeDiameterOptions Methods

---

The BarTypeDiameterOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

BarTypeDiameterOptions Class

Autodesk.Revit.DB Namespace