Revit 2026 API

# WireConduitTypeSetIterator Class

---

An iterator to a conduit type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireConduitTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class WireConduitTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class WireConduitTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class WireConduitTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type WireConduitTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The WireConduitTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WireConduitTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace