Revit 2026 API

# CircuitNamingSchemeSettings Properties

---

The CircuitNamingSchemeSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CircuitNamingSchemeId | The circuit naming scheme id set in CircuitNamingSchemeSettings. |

#### Reference

CircuitNamingSchemeSettings Class

Autodesk.Revit.DB.Electrical Namespace