Revit 2026 API

# LinearArray Properties

---

The LinearArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumMembers | Retrieves or changes the number of arrayed members. Array placeholder members in the family environment are not counted.(Overrides BaseArrayNumMembers) |

#### Reference

LinearArray Class

Autodesk.Revit.DB Namespace