Revit 2026 API

# Edge Properties

---

The Edge type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApproximateLength | Returns the approximate length of the edge. |
|  | Reference | Returns a stable reference to the edge. |

#### Reference

Edge Class

Autodesk.Revit.DB Namespace