Revit 2026 API

# FileAccessException Methods

---

The FileAccessException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides IOExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

FileAccessException Class

Autodesk.Revit.Exceptions Namespace