Revit 2026 API

# FlexPipe Methods

---

The FlexPipe type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, ElementId, IListXYZ) |  |
|  | Create(Document, ElementId, ElementId, ElementId, XYZ, XYZ, IListXYZ) |  |
|  | IsFlexPipeTypeId | Checks if given type is valid flexible pipe type. |
|  | IsPipingSystemTypeId | Checks if given type is valid piping system type. |

#### Reference

FlexPipe Class

Autodesk.Revit.DB.Plumbing Namespace