Revit 2026 API

# TransmissionData Class

---

A class representing information on all external file references in a document.

SystemObject Autodesk.Revit.DBTransmissionData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TransmissionData : IDisposable
```
```vb
Public Class TransmissionData
	Implements IDisposable
```
```cpp
public ref class TransmissionData : IDisposable
```
```fsharp
type TransmissionData =
    class
        interface IDisposable
    end
```

The TransmissionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TransmissionData | Constructs a TransmissionData from another TransmissionData |

|  | Name | Description |
| --- | --- | --- |
|  | IsTransmitted | Determines whether this file has been transmitted or not. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | UserData | A string which users can store notes in. |
|  | Version | The format version for TransmissionData |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TransmissionData |
|  | DocumentIsNotTransmitted | Determines whether the document at a given file location is not transmitted. |
|  | GetAllExternalFileReferenceIds | Gets the ids of all ExternalFileReferences. |
|  | GetDesiredReferenceData | Gets the ExternalFileReference representing path and load status information to be used the next time this TransmissionData's document is loaded. |
|  | GetLastSavedReferenceData | Gets the ExternalFileReference representing path and load status information concerning the most recent time this TransmissionData's document was opened. |
|  | IsDocumentTransmitted | Determines whether the document at a given file location is transmitted. |
|  | ReadTransmissionData | Reads the TransmissionData associated with the file at the given location. |
|  | SetDesiredReferenceData | Sets the ExternalFileReference information which Revit should use the next time it opens the document which this TransmissionData belongs to. |
|  | WriteTransmissionData | Writes the given TransmissionData into the Revit file at the given location. |

TransmissionData stores information on both the previous state and requested state of an external file reference. This means that it stores the load state and path of the reference from the most recent time this TransmissionData's document was opened. It also stores load state and path information for what Revit should do the next time the document is opened.

As such, TransmissionData can be used to perform operations on external file references without having to open the entire associated Revit document. The methods ReadTransmissionData and WriteTransmissionData can be used to obtain information about external references, or to change that information. For example, calling WriteTransmissionData with a TransmissionData object which has had all references set to LinkedFileStatus.Unloaded would cause no references to be loaded upon next opening the document.

TransmissionData cannot add or remove references to external files. If, on file open, Revit discovers information in the TransmissionData which does not correspond to an existing external file reference, the information will be ignored on file load.

The TransmissionData for a document does not contain information about references which come from external servers. TransmissionData only contains references to local files or Revit links on Revit Server. TransmissionData cannot be used to change a reference from a local file reference to an external server reference.

Note that TransmissionData objects must be set to "transmitted" for the requested reference data to be meaningful. Revit ignores the TransmissionData for non-transmitted files. Marking a file as transmitted has other effects - workshared files are opened as detached from the central model, and creation of new local files is prohibited, until the file is in its final location and the file has been marked as no longer transmitted.

#### Reference

Autodesk.Revit.DB Namespace