Revit 2026 API

# View3D Class

---

Class for 3D views

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBView Autodesk.Revit.DBView3D

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class View3D : View
```
```vb
Public Class View3D
	Inherits View
```
```cpp
public ref class View3D : public View
```
```fsharp
type View3D =
    class
        inherit View
    end
```

The View3D type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsLocked | Indicates if the view is locked. |
|  | IsPerspective | Identifies whether this is a perspective view. |
|  | IsSectionBoxActive | Identifies whether or not the section box is active in this 3D view. |
|  | ProjectGridsOnSectionBox | This option projects all grids from the current 3d view on the bottom face of the section box. Only grids that are inside or intersects the section box |

|  | Name | Description |
| --- | --- | --- |
|  | CanResetCameraTarget | Checks whether the camera target can be reset for this view. |
|  | CanSaveOrientation | Returns true if the View3D's orientation can be saved, false otherwise. |
|  | CanToggleBetweenPerspectiveAndIsometric | Checks whether this view can toggle between perspective and isometric. |
|  | CreateIsometric | Returns a new isometric View3D. |
|  | CreatePerspective | Returns a new perspective View3D. |
|  | GetLevelsThatShowGrids | Returns the list of levels ids where grids are displayed in this 3D view. |
|  | GetOrientation | Gets the current non-saved orientation of the View3D. |
|  | GetRenderingSettings | Returns the current rendering settings for this 3d view. |
|  | GetSavedOrientation | Gets the saved orientation of the View3D. |
|  | GetSectionBox | Gets a copy of the section box for this 3D view. |
|  | HasBeenLocked | Identifies if the view has ever been locked. |
|  | HideGridsOnLevel | This method hides the grid lines in this 3D view on the given Level. |
|  | OrientTo | Reorients the view to align with the forward direction. |
|  | ResetCameraTarget | Resets the camera target to the center of the field of view. |
|  | RestoreOrientationAndLock | Locks the view and restores its orientation. |
|  | SaveOrientation | Converts the temporary orientation of the View3D into its saved orientation. |
|  | SaveOrientationAndLock | Locks the view and saves its orientation |
|  | ScalePerspectiveCropBox | Scale an existing crop box of the perspective view. |
|  | SetOrientation | Sets the temporary orientation of the View3D. The new orientation is not saved in the document. |
|  | SetRenderingSettings | Changes the rendering settings for this 3d view. |
|  | SetSectionBox | Sets the section box for this 3D view. |
|  | ShowGridsOnLevel | This method displays the grid lines in this 3DView on the given Level. |
|  | ShowGridsOnLevels |  |
|  | ToggleToIsometric | Toggles this view to isometric. |
|  | ToggleToPerspective | Toggles this view to perspective. |
|  | Unlock | Unlocks the view. Has no effect if the view is already unlocked. |

#### Reference

Autodesk.Revit.DB Namespace