Revit 2026 API

# TableCellCalculatedValueData Class

---

The TableCellCalculatedValueData stores the data for calculated value

SystemObject Autodesk.Revit.DBTableCellCalculatedValueData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TableCellCalculatedValueData : IDisposable
```
```vb
Public Class TableCellCalculatedValueData
	Implements IDisposable
```
```cpp
public ref class TableCellCalculatedValueData : IDisposable
```
```fsharp
type TableCellCalculatedValueData =
    class
        interface IDisposable
    end
```

The TableCellCalculatedValueData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TableCellCalculatedValueData |
|  | GetName | Gets the name of the calculated value. |

#### Reference

Autodesk.Revit.DB Namespace