Revit 2026 API

# BaseArray Class

---

An abstract base class that represents an array within the Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBBaseArray Autodesk.Revit.DBLinearArray Autodesk.Revit.DBRadialArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class BaseArray : Element
```
```vb
Public MustInherit Class BaseArray
	Inherits Element
```
```cpp
public ref class BaseArray abstract : public Element
```
```fsharp
[<AbstractClassAttribute>]
type BaseArray =
    class
        inherit Element
    end
```

The BaseArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Label | The family parameter label of the BaseArray. |
|  | Name | Get and Set the Name property(Overrides ElementName) |
|  | NumMembers | Retrieves or changes the number of the arrayed members. |

|  | Name | Description |
| --- | --- | --- |
|  | GetCopiedMemberIds | Retrieves the copied member Ids of the Array. |
|  | GetOriginalMemberIds | Retrieves the original member Ids of the Array. |

#### Reference

Autodesk.Revit.DB Namespace