Revit 2026 API

# ImageView Class

---

Class for ImageView views

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBView Autodesk.Revit.DBViewDrafting Autodesk.Revit.DBImageView

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ImageView : ViewDrafting
```
```vb
Public Class ImageView
	Inherits ViewDrafting
```
```cpp
public ref class ImageView : public ViewDrafting
```
```fsharp
type ImageView =
    class
        inherit ViewDrafting
    end
```

The ImageView type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ImageInstanceId | Id of the image in the view. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create an ImageView containing an image imported from disk. |

#### Reference

Autodesk.Revit.DB Namespace