Revit 2026 API

# ReferencePointArrayIterator Methods

---

The ReferencePointArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ReferencePointArrayIterator Class

Autodesk.Revit.DB Namespace