Revit 2026 API

# IOException Methods

---

The IOException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

IOException Class

Autodesk.Revit.Exceptions Namespace