Revit 2026 API

# PolyLine Properties

---

The PolyLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumberOfCoordinates | Gets the number of the coordinate points. |

#### Reference

PolyLine Class

Autodesk.Revit.DB Namespace