Revit 2026 API

# INavisworksExporter Methods

---

The INavisworksExporter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Export | The method that Revit will invoke to perform an export to Navisworks. |
|  | ValidateExportOptions | Determines if the inputs are valid, and returns an error message if not. |

#### Reference

INavisworksExporter Interface

Autodesk.Revit.DB Namespace