Revit 2026 API

# MechanicalFitting Properties

---

The MechanicalFitting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PartType | The part type of the mechanical fitting. |

#### Reference

MechanicalFitting Class

Autodesk.Revit.DB.Mechanical Namespace