Revit 2026 API

# PaperSourceSet Class

---

A set that can contain any number of paper source objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPaperSourceSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PaperSourceSet : APIObject,
	IEnumerable
```
```vb
Public Class PaperSourceSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class PaperSourceSet : public APIObject,
	IEnumerable
```
```fsharp
type PaperSourceSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The PaperSourceSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PaperSourceSet | Initializes a new instance of the PaperSourceSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every item from the set, rendering it empty. |
|  | Contains | Tests for the existence of an item within the set. |
|  | Erase | Removes a specified object from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace