Revit 2026 API

# AssetPropertyDouble Class

---

Represents a property of material.

SystemObject Autodesk.Revit.DB.VisualAssetProperty Autodesk.Revit.DB.VisualAssetPropertyDouble

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssetPropertyDouble : AssetProperty
```
```vb
Public Class AssetPropertyDouble
	Inherits AssetProperty
```
```cpp
public ref class AssetPropertyDouble : public AssetProperty
```
```fsharp
type AssetPropertyDouble =
    class
        inherit AssetProperty
    end
```

The AssetPropertyDouble type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidValue | Checks that the value is a valid value for this property. |

#### Reference

Autodesk.Revit.DB.Visual Namespace