Revit 2026 API

# CopyPasteOptions Class

---

Settings to control the behavior of a copy-paste operation.

SystemObject Autodesk.Revit.DBCopyPasteOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CopyPasteOptions : IDisposable
```
```vb
Public Class CopyPasteOptions
	Implements IDisposable
```
```cpp
public ref class CopyPasteOptions : IDisposable
```
```fsharp
type CopyPasteOptions =
    class
        interface IDisposable
    end
```

The CopyPasteOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CopyPasteOptions | Creates a new instance of a CopyPasteOptions object. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CopyPasteOptions |
|  | GetDuplicateTypeNamesHandler | Returns current duplicate type names handler or  if none is set. |
|  | SetDuplicateTypeNamesHandler | Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation. |

#### Reference

Autodesk.Revit.DB Namespace