Revit 2026 API

# CurveExtents Class

---

Represents the start and end parameters for a curve segment.

SystemObject Autodesk.Revit.DBCurveExtents

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveExtents : IDisposable
```
```vb
Public Class CurveExtents
	Implements IDisposable
```
```cpp
public ref class CurveExtents : IDisposable
```
```fsharp
type CurveExtents =
    class
        interface IDisposable
    end
```

The CurveExtents type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndParameter | The end parameter of the curve extents. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | StartParameter | The start parameter of the curve extents. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CurveExtents |

#### Reference

Autodesk.Revit.DB Namespace