Revit 2026 API

# PrintSetup Properties

---

The PrintSetup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentPrintSetting | The current Print Setting of Print Setup. |
|  | InSession | The in-session Print Setting of Print Setup. |

#### Reference

PrintSetup Class

Autodesk.Revit.DB Namespace