Revit 2026 API

# IFCTransformSetter Methods

---

The IFCTransformSetter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of a transform setter. |
|  | Dispose |  |
|  | Initialize | Initializes the transformation in the transform setter. |
|  | InitializeFromBoundingBox |  |

#### Reference

IFCTransformSetter Class

Autodesk.Revit.DB.IFC Namespace