Revit 2026 API

# SketchedStairsCurveData Methods

---

The SketchedStairsCurveData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurve | Get a copy of the curve that is formed along this boundary. |

#### Reference

SketchedStairsCurveData Class

Autodesk.Revit.DB Namespace