Revit 2026 API

# GraphicsStyle Class

---

The graphics style instance in Autodesk Revit document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBGraphicsStyle

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GraphicsStyle : Element
```
```vb
Public Class GraphicsStyle
	Inherits Element
```
```cpp
public ref class GraphicsStyle : public Element
```
```fsharp
type GraphicsStyle =
    class
        inherit Element
    end
```

The GraphicsStyle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GraphicsStyleCategory | The graphics style category. |
|  | GraphicsStyleType | The graphics style type. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace