Revit 2026 API

# GroupSetIterator Class

---

An iterator to a group set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGroupSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class GroupSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class GroupSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class GroupSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type GroupSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The GroupSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroupSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace