Revit 2026 API

# ReinforcementRoundingManager Methods

---

The ReinforcementRoundingManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetLengthUnitTypeId | Gets the identifier of the length unit quantifying the reinforcement rounding values. |

#### Reference

ReinforcementRoundingManager Class

Autodesk.Revit.DB.Structure Namespace