Revit 2026 API

# UnauthenticatedException Methods

---

The UnauthenticatedException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

UnauthenticatedException Class

Autodesk.Revit.Exceptions Namespace