Revit 2026 API

# NumberingSchemaType Class

---

A type for identifying a NumberingSchema of a particular kind.

SystemObject Autodesk.Revit.DBGuidEnum Autodesk.Revit.DBNumberingSchemaType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class NumberingSchemaType : GuidEnum
```
```vb
Public Class NumberingSchemaType
	Inherits GuidEnum
```
```cpp
public ref class NumberingSchemaType : public GuidEnum
```
```fsharp
type NumberingSchemaType =
    class
        inherit GuidEnum
    end
```

The NumberingSchemaType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumberingSchemaType | Creates a new NumberingSchemaType instance. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(NumberingSchemaType, NumberingSchemaType) | Compares two NumberingSchemaType instances. |
|  | Inequality(NumberingSchemaType, NumberingSchemaType) | Compares two NumberingSchemaType instances. |

Each numbering schema is applicable to a certain category of Revit elements. For example, the Rebar numbering schema (built-in) is used and only applicable to Rebar elements. With that schema present, all Rebar elements automatically will get their respective numbers and those numbers would not correspond in any way to numbers of other enumerable elements that belong to different numbering schemas.

There are only built-in schemas available currently.

#### Reference

Autodesk.Revit.DB Namespace