Revit 2026 API

# StructuralSectionGeneralLZ Properties

---

The StructuralSectionGeneralLZ type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BottomFlangeLength | Bottom Flange segment length. |
|  | LipLength | Lip segment length. |

#### Reference

StructuralSectionGeneralLZ Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace