Revit 2026 API

# SketchedStairsCurveData Class

---

Sketched run/landing curves overrides with height and slope

SystemObject Autodesk.Revit.DBSketchedStairsCurveData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SketchedStairsCurveData : IDisposable
```
```vb
Public Class SketchedStairsCurveData
	Implements IDisposable
```
```cpp
public ref class SketchedStairsCurveData : IDisposable
```
```fsharp
type SketchedStairsCurveData =
    class
        interface IDisposable
    end
```

The SketchedStairsCurveData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SketchedStairsCurveData | Construct a SketchedStairsCurveData defined by a curve associated with its height and slope type. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SketchedStairsCurveData |
|  | GetCurve | Get a copy of the curve that is formed along this boundary. |

#### Reference

Autodesk.Revit.DB Namespace