Revit 2026 API

# AXMImportOptions Properties

---

The AXMImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ImportLevels | Indicate if levels are to be imported. False by default. |

#### Reference

AXMImportOptions Class

Autodesk.Revit.DB Namespace