Revit 2026 API

# PointRelativeToPoint Class

---

Represents a point placed relative to another point.

SystemObject Autodesk.Revit.DBPointElementReference Autodesk.Revit.DBPointRelativeToPoint

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PointRelativeToPoint : PointElementReference
```
```vb
Public Class PointRelativeToPoint
	Inherits PointElementReference
```
```cpp
public ref class PointRelativeToPoint : public PointElementReference
```
```fsharp
type PointRelativeToPoint =
    class
        inherit PointElementReference
    end
```

The PointRelativeToPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetHostPointReference | Get a copy of the host point reference. |
|  | SetHostPointReference | Change the host point reference. |

For this release, the only workflow supported is that the point is placed coincident with the referenced host (a relative transformation of Transform.Identity).

#### Reference

Autodesk.Revit.DB Namespace