Revit 2026 API

# PulldownButton Class

---

The PulldownButton object represents a button with a drop-down list on RibbonPanel.

SystemObject Autodesk.Revit.UIRibbonItem Autodesk.Revit.UIRibbonButton Autodesk.Revit.UIPulldownButton Autodesk.Revit.UISplitButton

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PulldownButton : RibbonButton
```
```vb
Public Class PulldownButton
	Inherits RibbonButton
```
```cpp
public ref class PulldownButton : public RibbonButton
```
```fsharp
type PulldownButton =
    class
        inherit RibbonButton
    end
```

The PulldownButton type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddPushButton | Adds a new pushbutton to the pulldown button and associates it with an ExternalCommand. |
|  | AddSeparator | Adds a separator to the drop-down list. |
|  | GetItems | Gets a copy of the collection of buttons assigned to the pulldown button. |

Use of this class is not supported in Revit Macros.

#### Reference

Autodesk.Revit.UI Namespace