Revit 2026 API

# ArcLengthDimension Methods

---

The ArcLengthDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |

#### Reference

ArcLengthDimension Class

Autodesk.Revit.DB Namespace