Revit 2026 API

# AnalysisDisplayLegendSettings Methods

---

The AnalysisDisplayLegendSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | IsEqual | Compares two legend settings objects. |

#### Reference

AnalysisDisplayLegendSettings Class

Autodesk.Revit.DB.Analysis Namespace