Revit 2026 API

# CurveIntersectResult Class

---

Contains the result of intersecting two curves and, if requested, a description of points where the two curves overlap or intersect.

SystemObject Autodesk.Revit.DBCurveIntersectResult

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveIntersectResult : IDisposable
```
```vb
Public Class CurveIntersectResult
	Implements IDisposable
```
```cpp
public ref class CurveIntersectResult : IDisposable
```
```fsharp
type CurveIntersectResult =
    class
        interface IDisposable
    end
```

The CurveIntersectResult type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Result | The classification of intersection or overlap between the two curves. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the CurveIntersectResult |
|  | GetOverlaps | Gets information about the points shared between the two curves. |

#### Reference

Autodesk.Revit.DB Namespace