Revit 2026 API

# ContextMenu Methods

---

The ContextMenu type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Add an item to the Context Menu. |
|  | Dispose |  |

#### Reference

ContextMenu Class

Autodesk.Revit.UI Namespace