Revit 2026 API

# IFCRange Class

---

Typically for IFC export, this represents the lower and upper elevations for split wall and column geometry.

SystemObject Autodesk.Revit.DB.IFCIFCRange

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCRange : IDisposable
```
```vb
Public Class IFCRange
	Implements IDisposable
```
```cpp
public ref class IFCRange : IDisposable
```
```fsharp
type IFCRange =
    class
        interface IDisposable
    end
```

The IFCRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IFCRange | Instantiates a default IFCRange object. |
|  | IFCRange(IFCRange) | Instantiates an IFCRange object by copy. |
|  | IFCRange(Double, Double) | Instantiates an IFCRange object. |

|  | Name | Description |
| --- | --- | --- |
|  | End | The ending value of the range. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Start | The starting value of the range. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCRange |

It contains two double values representing the starting and ending values as a range.

#### Reference

Autodesk.Revit.DB.IFC Namespace