Revit 2026 API

# FamilySizeTableErrorInfo Methods

---

The FamilySizeTableErrorInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FamilySizeTableErrorInfo Class

Autodesk.Revit.DB Namespace