Revit 2026 API

# PropertySetElement Class

---

An element that groups together a set of related parameters.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBPropertySetElement

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PropertySetElement : Element
```
```vb
Public Class PropertySetElement
	Inherits Element
```
```cpp
public ref class PropertySetElement : public Element
```
```fsharp
type PropertySetElement =
    class
        inherit Element
    end
```

The PropertySetElement type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, StructuralAsset) | Creates a new PropertySetElement to contain the given asset. |
|  | Create(Document, ThermalAsset) | Creates a new PropertySetElement to contain the given asset. |
|  | Duplicate | Creates a duplicate of this PropertySetElement. |
|  | GetStructuralAsset | Gets a copy of the StructuralAsset. |
|  | GetThermalAsset | Gets a copy of the ThermalAsset. |
|  | SetStructuralAsset | Sets a copy of the given StucturalAsset to be used in the PropertySetElement. |
|  | SetThermalAsset | Sets a copy of the given ThermalAsset to be used in the PropertySetElement. |

#### Reference

Autodesk.Revit.DB Namespace