Revit 2026 API

# PaperSourceSetIterator Class

---

An iterator to a set of paper source objects.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBPaperSourceSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class PaperSourceSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class PaperSourceSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class PaperSourceSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type PaperSourceSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The PaperSourceSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | PaperSourceSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace