Revit 2026 API

# AnalysisDisplayColorSettings Methods

---

The AnalysisDisplayColorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AreIntermediateColorsValid |  |
|  | Colors | Get number of colors, including min, max and intermediate. |
|  | Dispose |  |
|  | GetIntermediateColors | Get intermediate color entries (other than the minimum and maximum settings). |
|  | IsEqual | Compares two color settings objects. |
|  | SetIntermediateColors |  |

#### Reference

AnalysisDisplayColorSettings Class

Autodesk.Revit.DB.Analysis Namespace