Revit 2026 API

# MEPModel Class

---

Supports all MEP models that are persistent within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPModel : APIObject
```
```vb
Public Class MEPModel
	Inherits APIObject
```
```cpp
public ref class MEPModel : public APIObject
```
```fsharp
type MEPModel =
    class
        inherit APIObject
    end
```

The MEPModel type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectorManager | Retrieves the Connector Manager from this MEPModel. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | GetAssignedElectricalSystems | Retrieves the electrical systems this electrical panel currently is assigned to. |
|  | GetElectricalSystems | Retrieves the electrical systems that are currently created using this MEPModel. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBMEPModel Autodesk.Revit.DB.ElectricalElectricalEquipment Autodesk.Revit.DB.ElectricalLightingDevice Autodesk.Revit.DB.ElectricalLightingFixture Autodesk.Revit.DB.MechanicalMechanicalEquipment Autodesk.Revit.DB.MechanicalMechanicalFitting