Revit 2026 API

# PartMaker Methods

---

The PartMaker type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetSourceElementIds | Get the source elements for the PartMaker. |
|  | IsSourceElement | Is the element a source for this PartMaker |
|  | SetSourceElementIds |  |

#### Reference

PartMaker Class

Autodesk.Revit.DB Namespace