Revit 2026 API

# DesignOption Properties

---

The DesignOption type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPrimary | Determines whether this is a primary design option. |

#### Reference

DesignOption Class

Autodesk.Revit.DB Namespace