Revit 2026 API

# FabricationNetworkChangeService Class

---

This class represents the fabrication part change service and change size tools.

SystemObject Autodesk.Revit.DB.FabricationFabricationNetworkChangeService

**Namespace:** Autodesk.Revit.DB.Fabrication**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricationNetworkChangeService : IDisposable
```
```vb
Public Class FabricationNetworkChangeService
	Implements IDisposable
```
```cpp
public ref class FabricationNetworkChangeService : IDisposable
```
```fsharp
type FabricationNetworkChangeService =
    class
        interface IDisposable
    end
```

The FabricationNetworkChangeService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FabricationNetworkChangeService | Creates a new instance of the FabricationNetworkChangeService class. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | ApplyChange | Applies the previously set changes to the selection of fabrication parts to change the size, change the service, or both. |
|  | ChangeService(ISetElementId, Int32, Int32) |  |
|  | ChangeService(ISetElementId, Int32, Int32, Boolean) |  |
|  | ChangeSize |  |
|  | Dispose | Releases all resources used by the FabricationNetworkChangeService |
|  | GetElementsThatFailed | Gets the set of fabrication parts that had failures due to either there was no corresponding part in the service, the size was out of range, or a connection could not be made. |
|  | GetInLinePartTypes | Get a set of element identifiers of fabrication part types for in-line parts. |
|  | GetMapOfAllSizesForStraights | Get a set of FabricationPartSizeMapSet of all straight sizes for all services. |
|  | GetStraightsThatWereNotChanged | Gets the set of fabrication part straights that were not changed due to either there was no corresponding part in the service or the size was out of range. |
|  | SetMapOfInLinePartTypes |  |
|  | SetMapOfSizesForStraights |  |
|  | SetPaletteId | Set the fabrication palette identifier to change the elements to. |
|  | SetRestrictPalette | Restrict the placement of parts to only use parts associated to the passed in fabrication palette identifier. |
|  | SetSelection |  |
|  | SetServiceId | Set the fabrication service identifier to change the elements to. |

After a new instance of the class is created, call the **ChangeService** method to change the service of the fabrication parts or call the **ChangeSize** method to change the size of the fabrication parts. There is another workflow allowing for more control, call **SetSelection** to set the selection of fabrication parts to change. To change the service, call **SetServiceId** and **SetPaletteId** to set the service identifier and palette identifier. Changing the service there is an optional methods **GetInLinePartTypes** and **SetMapOfSizesForStraights** that can be called to replace in-line valves and dampers to the corresponding parts for the new service. The size can also be changed by calling **GetMapOfAllSizesForStraights** that will return a FabricationPartSizeMapSet containing a map of sizes for all straights found in the selection of fabrication parts. The FabricationPartSizeMapSet can then be modified to set the mapped values for the new size for the fabrication part straights and then call **SetMapOfSizesForStraights** set the new sizes that are to be applied. Finally call **ApplyChange** to apply the previously set parameters to the selection of fabrication parts.

  * GetStraightsThatWereNotChanged to get a set of fabrication part straight element identifiers that were not changed.
  * GetElementsThatFailed to get a set of fabrication part element identifiers that had failures.

#### Reference

Autodesk.Revit.DB.Fabrication Namespace