Revit 2026 API

# EnergyAnalysisWindowType Properties

---

The EnergyAnalysisWindowType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Description | The description of the window type. |
|  | HeatTransferCoefficient | The heat transfer coefficient value (U-value) of the window type, in W/(m^2*K) (equivalent to kg/(k*s^3)). |
|  | IsSchematic | Indicates if this originates from a schematic or analytical construction. |
|  | SolarHeatGainCoefficient | The solar heat gain coefficient (SHGC-value) for the window type, from 0.0 to 1.0. |
|  | Transmittance | The visual light transmittance value (VLT-value) for the window type, from 0.0 to 1.0. |
|  | WindowTypeName | The name of the window type. |

#### Reference

EnergyAnalysisWindowType Class

Autodesk.Revit.DB.Analysis Namespace