Revit 2026 API

# AssemblyInstance Methods

---

The AssemblyInstance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddMemberIds |  |
|  | AllowsAssemblyViewCreation | Returns true if assembly views can be created for this Assembly Instance. |
|  | AreElementsValidForAssembly |  |
|  | CanRemoveElementsFromAssembly |  |
|  | CompareAssemblyInstances | Compares two assembly instances and returns a result with details about the differences |
|  | Create |  |
|  | Disassemble | Removes the assembly instance and releases the member elements. |
|  | GetCenter | Returns the center of the bounding box for the assembly instance. This is the default position for placed assembly instances. |
|  | GetMemberIds | Gets member element ids for the assembly instance. |
|  | GetTransform | Gets the origin of the assembly instance. |
|  | IsMember | Determines whether the given ElementId is a member of this assembly |
|  | IsValidNamingCategory |  |
|  | PlaceInstance | Places an assembly instance of a given assembly type at the specified location. |
|  | RemoveMemberIds |  |
|  | SetMemberIds |  |
|  | SetTransform | Sets the origin of the assembly instance. |

#### Reference

AssemblyInstance Class

Autodesk.Revit.DB Namespace