Revit 2026 API

# RebarHandlePositionData Class

---

The class that contains data for the handle position calculation.

SystemObject Autodesk.Revit.DB.StructureRebarHandlePositionData

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarHandlePositionData : IDisposable
```
```vb
Public Class RebarHandlePositionData
	Implements IDisposable
```
```cpp
public ref class RebarHandlePositionData : IDisposable
```
```fsharp
type RebarHandlePositionData =
    class
        interface IDisposable
    end
```

The RebarHandlePositionData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the RebarHandlePositionData |
|  | GetBarGeometry | Returns the geometry for a bar at the specified index currently in the Rebar. |
|  | GetDistributionPath | Gets the distribution path currently stored in the rebar. |
|  | GetNumberOfBars | Gets the number of bars currently in the rebar. |
|  | SetPosition | Sets the position for a specified handle. This information is set to the rebar after the API execution is finished successfully. |

#### Reference

Autodesk.Revit.DB.Structure Namespace