Revit 2026 API

# MEPSize Methods

---

The MEPSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

MEPSize Class

Autodesk.Revit.DB Namespace