Revit 2026 API

# CurveByPointsUtils Methods

---

The CurveByPointsUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCurvesToFaceRegion |  |
|  | CreateArcThroughPoints | Creates an arc through the given reference points. |
|  | CreateRectangle |  |
|  | Dispose |  |
|  | GetFaceRegions | Gets the FaceRegions in the existing face. |
|  | GetHostFace | Gets the host face to which the CurveElement is added. |
|  | GetProjectionType | Gets the projection type of the CurveElement. |
|  | GetSketchOnSurface | Gets the relationship between the CurveElement and face. |
|  | SetProjectionType | Sets the projection type of the CurveElement. |
|  | SetSketchOnSurface | Sets the relationship between the CurveElement and face. |
|  | ValidateCurveElementIdArrayForFaceRegions |  |

#### Reference

CurveByPointsUtils Class

Autodesk.Revit.DB Namespace