Revit 2026 API

# TilePatterns Class

---

The TilePatterns object is an interface for retrieving the TilePattern objects within the Document.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBTilePatterns

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TilePatterns : APIObject
```
```vb
Public Class TilePatterns
	Inherits APIObject
```
```cpp
public ref class TilePatterns : public APIObject
```
```fsharp
type TilePatterns =
    class
        inherit APIObject
    end
```

The TilePatterns type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetTilePattern | Retrieve a TilePattern object from a built-in type. |

#### Reference

Autodesk.Revit.DB Namespace