Revit 2026 API

# RebarShape Methods

---

The RebarShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarShapeTerminationsData) | Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
|  | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32) | **Obsolete.** Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
|  | Create(Document, RebarShapeDefinition, RebarShapeMultiplanarDefinition, RebarStyle, StirrupTieAttachmentType, Int32, RebarHookOrientation, Int32, RebarHookOrientation, Int32, Double, Double, ElementId, ElementId) | **Obsolete.** Create a new instance of a Rebar Shape, which defines the shape of a rebar. |
|  | GetAllowed | Check whether a bar type can be used with this RebarShape. Bar types are allowed by default. |
|  | GetCurvesForBrowser | Generate curves for the shape, as used in the shape browser. |
|  | GetDefaultHookAngle | **Obsolete.** Get the hook angle, expressed as an integral number of degrees (common values are 0, 90, 135, and 180). |
|  | GetDefaultHookOrientation | **Obsolete.** Gets the termination's orientation. The orientation it's the same for both hook and crank. |
|  | GetEndTreatmentTypeId | **Obsolete.** Gets the id of the EndTreatmentType at the specified rebar shape end. |
|  | GetHookRotationAngle | **Obsolete.** Gets the termination's (e.g hook, crank) out of plane rotation angle at the specified end. The angle is used for both hook and crank. |
|  | GetMultiplanarDefinition | The optional 3D structure of the shape. |
|  | GetRebarShapeDefinition | Return the definition of the RebarShape. |
|  | GetTerminationsData | Gets the terminations (e.g. hook, crank) data. |
|  | HasEndTreatment | Identifies if the rebar shape has end treatment at at least one end. |
|  | IsSameShapeIgnoringHooks | **Obsolete.** Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties. |
|  | IsSameShapeIgnoringTerminations | Test whether two shapes have equivalent definitions by comparing the RebarShapeDefinition and MultiplanarDefinition properties. |
|  | RebarShapeMatchesCurvesAndTerminationsData |  |
|  | SetAllowed | Specify which bar types can be used with this RebarShape. Bar types are allowed by default. |
|  | SetEndTreatmentTypeId | **Obsolete.** Sets the EndTreatmentType id at the specified rebar shape end. |
|  | SetHookRotationAngle | **Obsolete.** Sets the termination's (e.g hook, crank) out of plane rotation angle at the specified end. The angle will be used for both hook and crank. |

#### Reference

RebarShape Class

Autodesk.Revit.DB.Structure Namespace