Revit 2026 API

# ModelCurveArrayIterator Methods

---

The ModelCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

ModelCurveArrayIterator Class

Autodesk.Revit.DB Namespace