Revit 2026 API

# ViewSetIterator Methods

---

The ViewSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

ViewSetIterator Class

Autodesk.Revit.DB Namespace