Revit 2026 API

# RadioButtonGroup Methods

---

The RadioButtonGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddItem | Adds a new ToggleButton to the RadioButtonGroup. |
|  | AddItems |  |
|  | GetItems | Gets the collection of ToggleButtons assigned to the RadioButtonGroup. |

#### Reference

RadioButtonGroup Class

Autodesk.Revit.UI Namespace