Revit 2026 API

# Vertex Methods

---

The Vertex type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

Vertex Class

Autodesk.Revit.DB.DirectContext3D Namespace