Revit 2026 API

# TextRange Methods

---

The TextRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

TextRange Class

Autodesk.Revit.DB Namespace