Revit 2026 API

# RebarReinforcementData Properties

---

The RebarReinforcementData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | End | The end of the rebar. The end should be 0 or 1. |
|  | RebarId | The id of the Rebar |

#### Reference

RebarReinforcementData Class

Autodesk.Revit.DB.Structure Namespace