Revit 2026 API

# ContextualHelp Methods

---

The ContextualHelp type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Launch | Launches and displays the help topic specified by the contents of this ContextualHelp object. |

#### Reference

ContextualHelp Class

Autodesk.Revit.UI Namespace