Revit 2026 API

# ImagePlacementOptions Methods

---

The ImagePlacementOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ImagePlacementOptions Class

Autodesk.Revit.DB Namespace