Revit 2026 API

# PostPattern Methods

---

The PostPattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

PostPattern Class

Autodesk.Revit.DB.Architecture Namespace