Revit 2026 API

# TemperatureRatingTypeSet Properties

---

The TemperatureRatingTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of TemperatureRating types that are in the set. |

#### Reference

TemperatureRatingTypeSet Class

Autodesk.Revit.DB.Electrical Namespace