Revit 2026 API

# Segment Properties

---

The Segment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Description | The description of the segment. |
|  | MaterialId | The ElementId of the MaterialElem. |
|  | Roughness | The roughness value for given material. |
|  | SizeCount | The number of size objects in the segment. |

#### Reference

Segment Class

Autodesk.Revit.DB Namespace