Revit 2026 API

# ElementWorksetFilter Properties

---

The ElementWorksetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WorksetId | The workset id. |

#### Reference

ElementWorksetFilter Class

Autodesk.Revit.DB Namespace