Revit 2026 API

# AssetPropertyBoolean Properties

---

The AssetPropertyBoolean type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

#### Reference

AssetPropertyBoolean Class

Autodesk.Revit.DB.Visual Namespace