Revit 2026 API

# FluidTemperature Class

---

Represents the dynamic viscosity and density properties as defined at a certain temperature.

SystemObject Autodesk.Revit.DB.PlumbingFluidTemperature

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FluidTemperature : IDisposable
```
```vb
Public Class FluidTemperature
	Implements IDisposable
```
```cpp
public ref class FluidTemperature : IDisposable
```
```fsharp
type FluidTemperature =
    class
        interface IDisposable
    end
```

The FluidTemperature type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FluidTemperature | Creates a new fluid temperature with given temperature, dynamic viscosity and density. |

|  | Name | Description |
| --- | --- | --- |
|  | Density | The density value |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Temperature | The temperature value |
|  | Viscosity | The dynamic viscosity value |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the FluidTemperature |

#### Reference

Autodesk.Revit.DB.Plumbing Namespace