Revit 2026 API

# CylindricalFace Class

---

A cylindrical face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBCylindricalFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CylindricalFace : Face
```
```vb
Public Class CylindricalFace
	Inherits Face
```
```cpp
public ref class CylindricalFace : public Face
```
```fsharp
type CylindricalFace =
    class
        inherit Face
    end
```

The CylindricalFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radii of the surface. |

|  | Name | Description |
| --- | --- | --- |

For details on the parameterization, refer to the documentation for CylindricalSurface.

#### Reference

Autodesk.Revit.DB Namespace