Revit 2026 API

# ElementSlowFilter Class

---

A base class for a type of filter that operates on expanded elements.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementSlowFilter : ElementFilter
```
```vb
Public Class ElementSlowFilter
	Inherits ElementFilter
```
```cpp
public ref class ElementSlowFilter : public ElementFilter
```
```fsharp
type ElementSlowFilter =
    class
        inherit ElementFilter
    end
```

The ElementSlowFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

Slow filters require that the Element be obtained and expanded in memory first. Thus it is preferable to couple slow filters with at least one ElementQuickFilter, which should minimize the number of Elements that are expanded in order to evaluate against the criteria set by this filter.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DB.ArchitectureRoomFilter Autodesk.Revit.DB.ArchitectureRoomTagFilter Autodesk.Revit.DBAreaFilter Autodesk.Revit.DBAreaTagFilter Autodesk.Revit.DBCurveElementFilter Autodesk.Revit.DBElementIntersectsFilter Autodesk.Revit.DBElementLevelFilter Autodesk.Revit.DBElementParameterFilter Autodesk.Revit.DBElementPhaseStatusFilter Autodesk.Revit.DBFamilyInstanceFilter Autodesk.Revit.DB.MechanicalSpaceFilter Autodesk.Revit.DB.MechanicalSpaceTagFilter Autodesk.Revit.DBPrimaryDesignOptionMemberFilter Autodesk.Revit.DB.StructureFamilyStructuralMaterialTypeFilter Autodesk.Revit.DB.StructureStructuralInstanceUsageFilter Autodesk.Revit.DB.StructureStructuralMaterialTypeFilter Autodesk.Revit.DB.StructureStructuralWallUsageFilter Autodesk.Revit.UI.SelectionSelectableInViewFilter