Revit 2026 API

# InsufficientResourcesException Methods

---

The InsufficientResourcesException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InsufficientResourcesException Class

Autodesk.Revit.Exceptions Namespace