Revit 2026 API

# ViewFamilyType Class

---

Represents a type of a Revit view.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBViewFamilyType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ViewFamilyType : ElementType
```
```vb
Public Class ViewFamilyType
	Inherits ElementType
```
```cpp
public ref class ViewFamilyType : public ElementType
```
```fsharp
type ViewFamilyType =
    class
        inherit ElementType
    end
```

The ViewFamilyType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DefaultTemplateId | The default template id assigned to this view type. |
|  | PlanViewDirection | The PlanViewDirection of this view. |
|  | ViewFamily | The ViewFamily for this view type. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidDefaultTemplate | Verifies that the input can be used as a default template for this view type. |

ViewFamilyTypes represent possible types for a Revit view and contain view type related properties and options such as the default template associated to views created from this type. They are commonly input to new View creation methods in the Revit API.

#### Reference

Autodesk.Revit.DB Namespace