Revit 2026 API

# GeometryObject Class

---

The common base class for all geometric primitives.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GeometryObject : APIObject
```
```vb
Public Class GeometryObject
	Inherits APIObject
```
```cpp
public ref class GeometryObject : public APIObject
```
```fsharp
type GeometryObject =
    class
        inherit APIObject
    end
```

The GeometryObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GraphicsStyleId | The ElementId of the GeometryObject's GraphicsStyle |
|  | Id | A unique integer identifying the GeometryObject in its associated non view-specific GeometryElement. |
|  | IsElementGeometry | Indicates whether this geometry is obtained directly from an Element. |
|  | Visibility | The visibility. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the integer value of the geometry object as hash code (Overrides ObjectGetHashCode) |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(GeometryObject, GeometryObject) | Determines whether two GeometryObjects are the same. |
|  | Inequality(GeometryObject, GeometryObject) | Determines whether two GeometryObjects are different. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBEdge Autodesk.Revit.DBFace Autodesk.Revit.DBGeometryElement Autodesk.Revit.DBGeometryInstance Autodesk.Revit.DBMesh Autodesk.Revit.DBPoint Autodesk.Revit.DBPolyLine Autodesk.Revit.DBProfile Autodesk.Revit.DBSolid