Revit 2026 API

# KeynoteTable Class

---

KeynoteTable represents the collection of keynotes (KeynoteEntries) for a document.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBKeyBasedTreeEntryTable Autodesk.Revit.DBKeynoteTable

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class KeynoteTable : KeyBasedTreeEntryTable
```
```vb
Public Class KeynoteTable
	Inherits KeyBasedTreeEntryTable
```
```cpp
public ref class KeynoteTable : public KeyBasedTreeEntryTable
```
```fsharp
type KeynoteTable =
    class
        inherit KeyBasedTreeEntryTable
    end
```

The KeynoteTable type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetKeynoteTable | Gets the KeynoteTable from a Revit document. |

#### Reference

Autodesk.Revit.DB Namespace