Revit 2026 API

# SpatialElementDomainData Class

---

A base class for specific domain requirements for a spatial element.

SystemObject Autodesk.Revit.DBSpatialElementDomainData Autodesk.Revit.DB.ElectricalElectricalLoadAreaData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementDomainData : IDisposable
```
```vb
Public Class SpatialElementDomainData
	Implements IDisposable
```
```cpp
public ref class SpatialElementDomainData : IDisposable
```
```fsharp
type SpatialElementDomainData =
    class
        interface IDisposable
    end
```

The SpatialElementDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SpatialElementDomainData |

#### Reference

Autodesk.Revit.DB Namespace