Revit 2026 API

# Path3d Properties

---

The Path3d type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AllCurveLoops | Get all the Curve Loops of Path3d. |
|  | CurveLoop | Get the Curve Loop of Path3d via index. |
|  | NumCurveLoops | Get the Number of Curve Loops of Path3d. |

#### Reference

Path3d Class

Autodesk.Revit.DB Namespace