Revit 2026 API

# ZoneElementDomainData Methods

---

The ZoneElementDomainData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ZoneElementDomainData Class

Autodesk.Revit.DB.Mechanical Namespace