Revit 2026 API

# FamilyTypeSet Properties

---

The FamilyTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of objects that are in the set. |

#### Reference

FamilyTypeSet Class

Autodesk.Revit.DB Namespace