Revit 2026 API

# ThinLinesOptions Methods

---

The ThinLinesOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ThinLinesOptions Class

Autodesk.Revit.UI Namespace