Revit 2026 API

# AssemblyMemberDifferentCategory Class

---

The two assembly members being compared have different category

SystemObject Autodesk.Revit.DBAssemblyMemberDifference Autodesk.Revit.DBAssemblyMemberDifferentCategory

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyMemberDifferentCategory : AssemblyMemberDifference
```
```vb
Public Class AssemblyMemberDifferentCategory
	Inherits AssemblyMemberDifference
```
```cpp
public ref class AssemblyMemberDifferentCategory : public AssemblyMemberDifference
```
```fsharp
type AssemblyMemberDifferentCategory =
    class
        inherit AssemblyMemberDifference
    end
```

The AssemblyMemberDifferentCategory type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryId1 | Category id of the first assembly member |
|  | CategoryId2 | Category id of the second assembly member |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace