Revit 2026 API

# WireSizeSet Methods

---

The WireSizeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every wire size from the set, rendering it empty. |
|  | Contains | Tests for the existence of a wire size within the set. |
|  | Erase | Removes a specified wire size from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified wire size into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace