Revit 2026 API

# PaperSize Properties

---

The PaperSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name | Retrieve the paper size name of current project. |

#### Reference

PaperSize Class

Autodesk.Revit.DB Namespace