Revit 2026 API

# MEPHiddenLineSettings Methods

---

The MEPHiddenLineSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetMEPHiddenLineSettings | Gets the MEP hidden line settings in the document. |

#### Reference

MEPHiddenLineSettings Class

Autodesk.Revit.DB.Mechanical Namespace