Revit 2026 API

# LineLightShape Properties

---

The LineLightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmitLength | The emit length. |

#### Reference

LineLightShape Class

Autodesk.Revit.DB.Lighting Namespace