Revit 2026 API

# FieldDomainPointsByXYZ Class

---

Represents a set of three-dimensional point coordinates

SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByXYZ

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FieldDomainPointsByXYZ : FieldDomainPoints
```
```vb
Public Class FieldDomainPointsByXYZ
	Inherits FieldDomainPoints
```
```cpp
public ref class FieldDomainPointsByXYZ : public FieldDomainPoints
```
```fsharp
type FieldDomainPointsByXYZ =
    class
        inherit FieldDomainPoints
    end
```

The FieldDomainPointsByXYZ type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FieldDomainPointsByXYZ | Initializes a new instance of the FieldDomainPointsByXYZ class |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Analysis Namespace