Revit 2026 API

# GenericImportOptions Class

---

Generic Import options.

SystemObject Autodesk.Revit.DBGenericImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class GenericImportOptions
```
```vb
Public MustInherit Class GenericImportOptions
```
```cpp
public ref class GenericImportOptions abstract
```
```fsharp
[<AbstractClassAttribute>]
type GenericImportOptions = class end
```

The GenericImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RefPoint | Reference point (in Revit) to which the image is going to be inserted. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace