Revit 2026 API

# BoundingBoxUV Class

---

A two-dimensional rectangle, parallel to the coordinate axes.

SystemObject Autodesk.Revit.DBBoundingBoxUV

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundingBoxUV : IDisposable
```
```vb
Public Class BoundingBoxUV
	Implements IDisposable
```
```cpp
public ref class BoundingBoxUV : IDisposable
```
```fsharp
type BoundingBoxUV =
    class
        interface IDisposable
    end
```

The BoundingBoxUV type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BoundingBoxUV | default constructor |
|  | BoundingBoxUV(Double, Double, Double, Double) | Creates object with supplied values. |

|  | Name | Description |
| --- | --- | --- |
|  | Bounds | Indexed access for loops. Use 0 for Min and 1 for Max. |
|  | IsSet | Indicates whether the BoundingBoxUV is set or not. |
|  | Max | Maximum coordinates (upper-right corner of the box). |
|  | Min | Minimum coordinates (lower-left corner of the box). |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BoundingBoxUV |

#### Reference

Autodesk.Revit.DB Namespace