Revit 2026 API

# DocumentPreviewSettings Class

---

Contains the settings related to the saving of preview images for a given document.

SystemObject Autodesk.Revit.DBDocumentPreviewSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DocumentPreviewSettings : IDisposable
```
```vb
Public Class DocumentPreviewSettings
	Implements IDisposable
```
```cpp
public ref class DocumentPreviewSettings : IDisposable
```
```fsharp
type DocumentPreviewSettings =
    class
        interface IDisposable
    end
```

The DocumentPreviewSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | IsViewUpdateForced | Identifies if Revit will update the preview view if necessary. |
|  | PreviewViewId | The view id that will be used to generate the preview. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the DocumentPreviewSettings |
|  | ForceViewUpdate | Sets Revit to update the preview view if necessary. |
|  | IsViewIdValidForPreview | Identifies if the view id is valid as a preview view id. |

#### Reference

Autodesk.Revit.DB Namespace