Revit 2026 API

# RevitServerCommunicationException Methods

---

The RevitServerCommunicationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerCommunicationException Class

Autodesk.Revit.Exceptions Namespace