Revit 2026 API

# StructuralConnectionType Class

---

A type element that represents a connection symbol applied to structural members.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureStructuralConnectionType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralConnectionType : ElementType
```
```vb
Public Class StructuralConnectionType
	Inherits ElementType
```
```cpp
public ref class StructuralConnectionType : public ElementType
```
```fsharp
type StructuralConnectionType =
    class
        inherit ElementType
    end
```

The StructuralConnectionType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplyTo | Choose whether this connection type applies to beams and braces, to tops of columns, or to bases of columns. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a new StructuralConnectionType, allowing the specified annotation FamilySymbol to be applied to structural members. |
|  | GetAllStructuralConnectionTypeIds |  |
|  | GetFamilySymbolId | FamilySymbol of the annotation to use for this connection type. |
|  | SetFamilySymbolId | FamilySymbol of the annotation to use for this connection type. |
|  | ValidFamilySymbolId | Checks whether the family symbol id is allowed for StructuralConnectionTypes with the given value for the applyTo property. |

#### Reference

Autodesk.Revit.DB.Structure Namespace