Revit 2026 API

# WireSetIterator Methods

---

The WireSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

WireSetIterator Class

Autodesk.Revit.DB.Electrical Namespace