Revit 2026 API

# DuctLiningType Methods

---

The DuctLiningType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidRoughness | Identifies if the input roughness is valid. |

#### Reference

DuctLiningType Class

Autodesk.Revit.DB.Mechanical Namespace