Revit 2026 API

# ScheduleFieldId Class

---

The ScheduleFieldId object is used as a unique identification for a field in a schedule.

SystemObject Autodesk.Revit.DBScheduleFieldId

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ScheduleFieldId
```
```vb
Public Class ScheduleFieldId
```
```cpp
public ref class ScheduleFieldId
```
```fsharp
type ScheduleFieldId = class end
```

The ScheduleFieldId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ScheduleFieldId | Initializes a new instance of the ScheduleFieldId class |

|  | Name | Description |
| --- | --- | --- |
|  | IntegerValue | Provides the value of the ScheduleFieldId as an integer. |
|  | InvalidScheduleFieldId | Get the invalid ScheduleFieldId whose IntegerValue is -1. |

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetHashCode | Gets the integer value of the id as hash code (Overrides ObjectGetHashCode) |
|  | ToString | Gets a String representation of the integer value of the id. (Overrides ObjectToString) |

|  | Name | Description |
| --- | --- | --- |
|  | Equality(ScheduleFieldId, ScheduleFieldId) | Determines whether two ScheduleFieldIds are the same. |
|  | Inequality(ScheduleFieldId, ScheduleFieldId) | Determines whether two ScheduleFieldId are different. |

#### Reference

Autodesk.Revit.DB Namespace