Revit 2026 API

# ViewSetIterator Class

---

An iterator to a view set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBViewSetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ViewSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ViewSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ViewSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ViewSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ViewSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ViewSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace