Revit 2026 API

# VertexIndexPairArrayIterator Class

---

An iterator to an array of VertexIndex pairs.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBVertexIndexPairArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class VertexIndexPairArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class VertexIndexPairArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class VertexIndexPairArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type VertexIndexPairArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The VertexIndexPairArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexIndexPairArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace