Revit 2026 API

# FabricWireType Class

---

A Fabric Wire Type object that is used in the generation of Fabric Wire.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureFabricWireType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricWireType : ElementType
```
```vb
Public Class FabricWireType
	Inherits ElementType
```
```cpp
public ref class FabricWireType : public ElementType
```
```fsharp
type FabricWireType =
    class
        inherit ElementType
    end
```

The FabricWireType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BendDiameter | Determines the bending diameter of the wire. |
|  | WireDiameter | Determines the diameter of the wire. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateDefaultFabricWireType | Creates a new FabricWireType object with a default name. |

#### Reference

Autodesk.Revit.DB.Structure Namespace