Revit 2026 API

# WireSize Class

---

**Note: This API is now obsolete.**

Represents specific electrical wire size information.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalWireSize

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")]
public class WireSize : APIObject
```
```vb
<ObsoleteAttribute("WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")>
Public Class WireSize
	Inherits APIObject
```
```cpp
[ObsoleteAttribute(L"WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")]
public ref class WireSize : public APIObject
```
```fsharp
[<ObsoleteAttribute("WireSize is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use ConductorSize instead. ConductorSizes will be created by WireSizes properly during document upgrade.")>]
type WireSize =
    class
        inherit APIObject
    end
```

The WireSize type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Ampacity | Get ampacity which be used for specifying size, the unit is ampere. |
|  | Diameter | Get diameter of wire. |
|  | InUse | Get or set whether the size can be used in sizing. |
|  | Size | Get size symbol of wire. |

|  | Name | Description |
| --- | --- | --- |

Wire size is defined based on corresponding wire material type and temperature rating type.

#### Reference

Autodesk.Revit.DB.Electrical Namespace