Revit 2026 API

# MultipleValuesIndicationSettings Methods

---

The MultipleValuesIndicationSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetMultipleValuesIndicationSettings | Returns the MultipleValuesIndicationSettings element for a given document. |

#### Reference

MultipleValuesIndicationSettings Class

Autodesk.Revit.DB Namespace