Revit 2026 API

# BuildingPadType Properties

---

The BuildingPadType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ThermalProperties | The calculated and settable thermal properties of the BuildingPadType |

#### Reference

BuildingPadType Class

Autodesk.Revit.DB Namespace