Revit 2026 API

# VoltageTypeSetIterator Class

---

An iterator to a voltage type set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalVoltageTypeSetIterator

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class VoltageTypeSetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class VoltageTypeSetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class VoltageTypeSetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type VoltageTypeSetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The VoltageTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VoltageTypeSetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB.Electrical Namespace