Revit 2026 API

# ElementParameterFilter Methods

---

The ElementParameterFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetRules | Returns the set of rules contained in this filter. |

#### Reference

ElementParameterFilter Class

Autodesk.Revit.DB Namespace