Revit 2026 API

# FilterStringLessOrEqual Class

---

Tests whether string values from the document would sort before or match a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringLessOrEqual

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringLessOrEqual : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringLessOrEqual
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringLessOrEqual : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringLessOrEqual =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringLessOrEqual type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringLessOrEqual | Constructs an instance of FilterStringLessOrEqual. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace