Revit 2026 API

# DialogBoxShowingEventArgs Methods

---

The DialogBoxShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |

#### Reference

DialogBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace