Revit 2026 API

# PlanarFace Class

---

A bounded face of a 3d solid or open shell.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBFace Autodesk.Revit.DBPlanarFace

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PlanarFace : Face
```
```vb
Public Class PlanarFace
	Inherits Face
```
```cpp
public ref class PlanarFace : public Face
```
```fsharp
type PlanarFace =
    class
        inherit Face
    end
```

The PlanarFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FaceNormal | Normal of the planar face. |
|  | Origin | Origin of the surface. |
|  | XVector | The X-vector of the planar face. |
|  | YVector | The Y-vector of the planar face. |

|  | Name | Description |
| --- | --- | --- |

Planar faces are defined by planes bounded by edge loops. The planes provide natural UV parameterization to the faces. S(u, v) = Origin + u*Vector[0] + v*Vector[1]

#### Reference

Autodesk.Revit.DB Namespace