Revit 2026 API

# LoadUsage Methods

---

The LoadUsage type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new LoadUsage. |

#### Reference

LoadUsage Class

Autodesk.Revit.DB.Structure Namespace