Revit 2026 API

# LineSegment Methods

---

The LineSegment type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

LineSegment Class

Autodesk.Revit.DB Namespace