Revit 2026 API

# ReferencePlane Class

---

Represents a reference plane of Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDatumPlane Autodesk.Revit.DBReferencePlane

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ReferencePlane : DatumPlane
```
```vb
Public Class ReferencePlane
	Inherits DatumPlane
```
```cpp
public ref class ReferencePlane : public DatumPlane
```
```fsharp
type ReferencePlane =
    class
        inherit DatumPlane
    end
```

The ReferencePlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BubbleEnd | The bubble end of the reference plane. |
|  | Direction | The direction of the reference plane. |
|  | FreeEnd | The free end of the reference plane. |
|  | Name | The name property of the reference plane. |
|  | Normal | The normal vector of the reference plane. |

|  | Name | Description |
| --- | --- | --- |
|  | Flip | Flips the orientation of the reference plane. |
|  | GetPlane | Returns the geometry plane to which the reference plane is assigned. |
|  | GetReference | Returns the geometry reference of the reference plane. |

#### Reference

Autodesk.Revit.DB Namespace