Revit 2026 API

# StructuralConnectionSettings Class

---

Provides access to project-wide structural connections settings.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.StructureStructuralConnectionSettings

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralConnectionSettings : Element
```
```vb
Public Class StructuralConnectionSettings
	Inherits Element
```
```cpp
public ref class StructuralConnectionSettings : public Element
```
```fsharp
type StructuralConnectionSettings =
    class
        inherit Element
    end
```

The StructuralConnectionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IncludeWarningControls | This property controls how Structural Connection Element is generated. If set to true and warnings are reported for given Element, additional yellow triangle is displayed. |

|  | Name | Description |
| --- | --- | --- |
|  | GetStructuralConnectionSettings | Obtains the StructuralConnectionSettings object for the specified project document. |

#### Reference

Autodesk.Revit.DB.Structure Namespace