Revit 2026 API

# ElementSet Properties

---

The ElementSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of elements that are in the set. |

#### Reference

ElementSet Class

Autodesk.Revit.DB Namespace