Revit 2026 API

# Line Class

---

A line in space.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBLine

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Line : Curve
```
```vb
Public Class Line
	Inherits Curve
```
```cpp
public ref class Line : public Curve
```
```fsharp
type Line =
    class
        inherit Curve
    end
```

The Line type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Direction | Returns the direction of the line. |
|  | Origin | Returns the origin of the line. |

|  | Name | Description |
| --- | --- | --- |
|  | CreateBound | Creates a new instance of a bound linear curve. |
|  | CreateUnbound | Creates a new instance of an unbound linear curve. |

#### Reference

Autodesk.Revit.DB Namespace