Revit 2026 API

# CylindricalHelix Methods

---

The CylindricalHelix type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a cylindrical helix. |

#### Reference

CylindricalHelix Class

Autodesk.Revit.DB Namespace