Revit 2026 API

# JournalingAttribute Properties

---

The JournalingAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Mode | Journaling mode. |

#### Reference

JournalingAttribute Class

Autodesk.Revit.Attributes Namespace