Revit 2026 API

# ConnectorManager Methods

---

The ConnectorManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Lookup | Lookup the connector using the unique index value that identify this connector. |

#### Reference

ConnectorManager Class

Autodesk.Revit.DB Namespace