Revit 2026 API

# CurtainSystemBase Class

---

Provides access to the CurtainSystemBase object in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBCurtainSystemBase Autodesk.Revit.DBCurtainSystem

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurtainSystemBase : HostObject
```
```vb
Public Class CurtainSystemBase
	Inherits HostObject
```
```cpp
public ref class CurtainSystemBase : public HostObject
```
```fsharp
type CurtainSystemBase =
    class
        inherit HostObject
    end
```

The CurtainSystemBase type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This is the base class of CurtainSystem.

#### Reference

Autodesk.Revit.DB Namespace