Revit 2026 API

# TableMergedCell Methods

---

The TableMergedCell type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

TableMergedCell Class

Autodesk.Revit.DB Namespace