Revit 2026 API

# DWFExportOptions Class

---

DWF Export options.

SystemObject Autodesk.Revit.DBCADExportOptions Autodesk.Revit.DBDWFExportOptions Autodesk.Revit.DBDWFXExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DWFExportOptions : CADExportOptions
```
```vb
Public Class DWFExportOptions
	Inherits CADExportOptions
```
```cpp
public ref class DWFExportOptions : public CADExportOptions
```
```fsharp
type DWFExportOptions =
    class
        inherit CADExportOptions
    end
```

The DWFExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DWFExportOptions | Default constructor. Sets all options to their default values. |

|  | Name | Description |
| --- | --- | --- |
|  | CropBoxVisible | Whether to export crop box. |
|  | ExportingAreas | Whether to also export areas and rooms' geometry. |
|  | ExportObjectData | Whether to include properties associated with elements. |
|  | ExportOnlyViewId | Only export the specified view. |
|  | ExportTexture | Whether to export texture. |
|  | ImageFormat | Controls the compression level of images embedded. |
|  | ImageQuality | Image quality level when compressed raster format(JPEG) is used. |
|  | MergedViews | Whether to merge all views in one file. |
|  | PaperFormat | Standard paper format. |
|  | PortraitLayout | Paper orientation - Portrait/Landscape. |
|  | StopOnError | Whether export process should stop when a view fails to export. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace