Revit 2026 API

# Location Methods

---

The Location type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Move | Move the element within the project by a specified vector. |
|  | Rotate | Rotate the element within the project by a specified angle around a given axis. |

#### Reference

Location Class

Autodesk.Revit.DB Namespace