Revit 2026 API

# BeamSystem Methods

---

The BeamSystem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BeamBelongsTo | Find out the BeamSystem to which the beam belongs. |
|  | Create(Document, IListCurve, SketchPlane, Int32) |  |
|  | Create(Document, IListCurve, Level, XYZ, Boolean) |  |
|  | Create(Document, IListCurve, Level, Int32, Boolean) |  |
|  | Create(Document, IListCurve, SketchPlane, XYZ, Boolean) |  |
|  | DropBeamSystem | Drop beam system, it will disassociate all members from the beam system and delete the beam system. |
|  | GetBeamIds | Gets all the beams of the BeamSystem. |

#### Reference

BeamSystem Class

Autodesk.Revit.DB Namespace