Revit 2026 API

# RebarBendingDetailType Methods

---

The RebarBendingDetailType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CreateRealistic | Creates a new RebarBendingDetailType object for full representations. |
|  | CreateSchematic | Creates a new RebarBendingDetailType object for schematic representations. |

#### Reference

RebarBendingDetailType Class

Autodesk.Revit.DB.Structure Namespace