Revit 2026 API

# VendorIdAttribute Properties

---

The VendorIdAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | AddInId VendorId value. |

#### Reference

VendorIdAttribute Class

Autodesk.Revit.DB.Macros Namespace