Revit 2026 API

# WorksharingSaveAsOptions Methods

---

The WorksharingSaveAsOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

WorksharingSaveAsOptions Class

Autodesk.Revit.DB Namespace