Revit 2026 API

# ProjectInfo Class

---

An object that represents a Project Information within the Autodesk Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBProjectInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ProjectInfo : Element
```
```vb
Public Class ProjectInfo
	Inherits Element
```
```cpp
public ref class ProjectInfo : public Element
```
```fsharp
type ProjectInfo =
    class
        inherit Element
    end
```

The ProjectInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Address | Get or Set the Project Address of the Project Information. |
|  | Author | Get or Set the Project Author of the Project Information. |
|  | BuildingName | Get or Set the Building Name of the Project Information. |
|  | ClientName | Get or Set the Client Name of the Project Information. |
|  | IssueDate | Get or Set the Project Issue Date of the Project Information. |
|  | Name | Get or Set the Project Name of the Project Information. |
|  | Number | Get or Set the Project Number of the Project Information. |
|  | OrganizationDescription | Get or Set the Organization Description of the Project Information. |
|  | OrganizationName | Get or Set the Organization Name of the Project Information. |
|  | Status | Get or Set the Project Status of the Project Information. |

|  | Name | Description |
| --- | --- | --- |

This object derived from the Element base object and such supports all the methods of that object such as the ability to retrieve the parameters of that object.

#### Reference

Autodesk.Revit.DB Namespace