Revit 2026 API

# Control Properties

---

The Control type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Origin | The control origin. |
|  | Shape | The control shape. |
|  | View | The view. |

#### Reference

Control Class

Autodesk.Revit.DB Namespace