Revit 2026 API

# PrimarySizeCriterion Properties

---

The PrimarySizeCriterion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MaximumSize | The maximum size of this criterion. |
|  | MinimumSize | The minimum size of this criterion. |

#### Reference

PrimarySizeCriterion Class

Autodesk.Revit.DB Namespace