Revit 2026 API

# PointLocationOnCurve Methods

---

The PointLocationOnCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

PointLocationOnCurve Class

Autodesk.Revit.DB Namespace