Revit 2026 API

# StructuralConnectionHandlerType Class

---

A StructuralConnectionHandlerType is used in StructuralConnectionHandler element generation.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.StructureStructuralConnectionHandlerType

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StructuralConnectionHandlerType : ElementType
```
```vb
Public Class StructuralConnectionHandlerType
	Inherits ElementType
```
```cpp
public ref class StructuralConnectionHandlerType : public ElementType
```
```fsharp
type StructuralConnectionHandlerType =
    class
        inherit ElementType
    end
```

The StructuralConnectionHandlerType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionGuid | The GUID to use for identifying connection geometry generation algorithm. |

|  | Name | Description |
| --- | --- | --- |
|  | AddElementsToCustomConnection | **Obsolete.** |
|  | Create(Document, String, Guid, String) | Creates a new StructuralConnectionHandlerType object. |
|  | Create(Document, String, Guid, String, ElementId) | Creates a new StructuralConnectionHandlerType object. |
|  | Create(Document, String, Guid, String, ElementId, IListConnectionInputPointInfo) |  |
|  | CreateDefaultStructuralConnectionHandlerType | Creates a new StructuralConnectionHandlerType object with a default name. |
|  | FindGenericConnectionType | Finds StructuralConnectionHandlerType which is Generic Connection type. |
|  | GetDefaultConnectionHandlerType | Gets a default type id for Structural Connection. |
|  | IsCustom | Checks if StructuralConnectionHandlerType is custom. |
|  | IsDetailed | Checks if StructuralConnectionHandlerType is detailed. |
|  | IsGeneric | Checks if StructuralConnectionHandlerType is generic. |
|  | IsTypeNameValidForCustomConnection | Validates if the input name matches the criteria of StructuralConnectionHandlerType name. Name must be unique among other existing StructuralConnectionHandlerTypes and cannot contain any of the following characters: new line, {}[];`~\\\/:*?";<> | or any of the non-printable characters. |
|  | RemoveMainSubelementsFromCustomConnection | **Obsolete.** |
|  | UpdateCustomConnectionType |  |

#### Reference

Autodesk.Revit.DB.Structure Namespace