Revit 2026 API

# ArcLengthDimension Class

---

An object that represents an ArcLengthDimension within the Revit Project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDimension Autodesk.Revit.DBAngularDimension Autodesk.Revit.DBArcLengthDimension

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ArcLengthDimension : AngularDimension
```
```vb
Public Class ArcLengthDimension
	Inherits AngularDimension
```
```cpp
public ref class ArcLengthDimension : public AngularDimension
```
```fsharp
type ArcLengthDimension =
    class
        inherit AngularDimension
    end
```

The ArcLengthDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create |  |

#### Reference

Autodesk.Revit.DB Namespace