Revit 2026 API

# MEPBuildingConstructionSetIterator Properties

---

The MEPBuildingConstructionSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

MEPBuildingConstructionSetIterator Class

Autodesk.Revit.DB.Mechanical Namespace