Revit 2026 API

# ExternalCommandData Class

---

A class contains reference to Application and View which are needed by external command.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.UIExternalCommandData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternalCommandData : APIObject
```
```vb
Public Class ExternalCommandData
	Inherits APIObject
```
```cpp
public ref class ExternalCommandData : public APIObject
```
```fsharp
type ExternalCommandData =
    class
        inherit APIObject
    end
```

The ExternalCommandData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Application | Retrieves an object that represents the current Application for external command. |
|  | JournalData | A data map that can be used to read and write data to the Autodesk Revit journal file. |
|  | View | Retrieves an object that represents the View external command work on. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace