Revit 2026 API

# ElementStructuralTypeFilter Class

---

A filter used to find elements matching a structural type.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementStructuralTypeFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementStructuralTypeFilter : ElementQuickFilter
```
```vb
Public Class ElementStructuralTypeFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementStructuralTypeFilter : public ElementQuickFilter
```
```fsharp
type ElementStructuralTypeFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementStructuralTypeFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementStructuralTypeFilter(StructuralType) | Constructs a new instance of a filter to match elements by structural type. |
|  | ElementStructuralTypeFilter(StructuralType, Boolean) | Constructs a new instance of a filter to match elements by structural type, with the option to match all elements which are of the given structural type. |

|  | Name | Description |
| --- | --- | --- |
|  | StructuralType | The structural type. |

|  | Name | Description |
| --- | --- | --- |

This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace