Revit 2026 API

# GroupType Properties

---

The GroupType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Groups | Retrieve a set of all the groups that have this type. |

#### Reference

GroupType Class

Autodesk.Revit.DB Namespace