Revit 2026 API

# SlabShapeVertexArrayIterator Methods

---

The SlabShapeVertexArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

SlabShapeVertexArrayIterator Class

Autodesk.Revit.DB Namespace