Revit 2026 API

# DistributionSysTypeSetIterator Properties

---

The DistributionSysTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

DistributionSysTypeSetIterator Class

Autodesk.Revit.DB.Electrical Namespace