Revit 2026 API

# DocumentSetIterator Properties

---

The DocumentSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

DocumentSetIterator Class

Autodesk.Revit.DB Namespace