Revit 2026 API

# ElementPhaseStatusFilter Methods

---

The ElementPhaseStatusFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetPhaseStatuses | Returns the phase statuses assigned to this filter. |

#### Reference

ElementPhaseStatusFilter Class

Autodesk.Revit.DB Namespace