Revit 2026 API

# AreaReinforcementCurve Properties

---

The AreaReinforcementCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Curve | Returns the 3D curve forming part of the boundary of an Area Reinforcement element. |

#### Reference

AreaReinforcementCurve Class

Autodesk.Revit.DB.Structure Namespace