Revit 2026 API

# FolderItemInfo Methods

---

The FolderItemInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetGroupingParameterIdPath | The parameter Id path used to determine the folder items in the browser. |

#### Reference

FolderItemInfo Class

Autodesk.Revit.DB Namespace