Revit 2026 API

# PromptForFamilyInstancePlacementOptions Methods

---

The PromptForFamilyInstancePlacementOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

PromptForFamilyInstancePlacementOptions Class

Autodesk.Revit.UI Namespace