Revit 2026 API

# Element Class

---

Base class for most persistent data within a Revit document.

SystemObject Autodesk.Revit.DBElement More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Element : IDisposable
```
```vb
Public Class Element
	Implements IDisposable
```
```cpp
public ref class Element : IDisposable
```
```fsharp
type Element =
    class
        interface IDisposable
    end
```

The Element type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AssemblyInstanceId | The id of the assembly instance to which the element belongs. |
|  | BoundingBox | Retrieves a box that circumscribes all geometry of the element. |
|  | Category | Retrieves a Category object that represents the category or sub category in which the element resides. |
|  | CreatedPhaseId | Id of a Phase at which the Element was created. |
|  | DemolishedPhaseId | Id of a Phase at which the Element was demolished. |
|  | DesignOption | Returns the design option to which the element belongs. |
|  | Document | Returns the Document in which the Element resides. |
|  | Geometry | Retrieves the geometric representation of the element. |
|  | GroupId | The id of the group to which an element belongs. |
|  | Id | A unique identifier for an Element in an Autodesk Revit project. |
|  | IsModifiable | Identifies if the element is modifiable. |
|  | IsTransient | Indicates whether an element is transient or permanent. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LevelId | The id of the level associated with the element. |
|  | Location | This property is used to find the physical location of an element within a project. |
|  | Name | A human readable name for the Element. |
|  | OwnerViewId | The id of the view that owns the element. |
|  | ParameterBuiltInParameter | Retrieves a parameter from the element given a parameter id. |
|  | ParameterDefinition | Retrieves a parameter from the element based on its definition. |
|  | ParameterGuid | Retrieves a parameter from the element given a GUID for a shared parameter. |
|  | Parameters | Retrieves a set containing all of the parameters that are contained within the element. |
|  | ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. |
|  | Pinned | Identifies if the element has been pinned to prevent changes. |
|  | UniqueId | A stable unique identifier for an element within the document. |
|  | VersionGuid | Get the element version Guid. |
|  | ViewSpecific | Identifies if the element is owned by a view. |
|  | WorksetId | Get Id of the Workset which owns the element. |

|  | Name | Description |
| --- | --- | --- |
|  | ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element. |
|  | CanBeHidden | Indicates if the element can be hidden in the view. |
|  | CanBeLocked | Identifies if the element can be locked. |
|  | CanDeleteSubelement | Checks if given subelement can be removed from the element. |
|  | CanHaveTypeAssigned | Identifies if the element can have a type assigned. |
|  | CanHaveTypeAssigned(Document, ICollectionElementId) |  |
|  | ChangeTypeId(ElementId) | Changes the type of the element. |
|  | ChangeTypeId(Document, ICollectionElementId, ElementId) |  |
|  | DeleteEntity | Deletes the existing entity created by %schema% in the element |
|  | DeleteSubelement | Removes a subelement from the element. |
|  | DeleteSubelements |  |
|  | Dispose | Releases all resources used by the Element |
|  | EvaluateAllParameterValues | Evaluates all the parameters' values of the element. |
|  | EvaluateParameterValues |  |
|  | GetChangeTypeAny | Returns ChangeType associated with any change in an element. |
|  | GetChangeTypeElementAddition | Returns ChangeType associated with element addition |
|  | GetChangeTypeElementDeletion | Returns ChangeType associated with element deletion. |
|  | GetChangeTypeGeometry | Returns ChangeType associated with a change in the geometry of an element |
|  | GetChangeTypeParameter(ElementId) | Returns ChangeType associated with a change in a parameter's value |
|  | GetChangeTypeParameter(Parameter) | Returns ChangeType associated with a change in a parameter's value |
|  | GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element. |
|  | GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise. |
|  | GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element. |
|  | GetExternalFileReference | Gets information pertaining to the external file referenced by the element. |
|  | GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type. |
|  | GetExternalResourceReferenceExpanded | Gets the collection of ExternalResourceReference associated with a specified external resource type. |
|  | GetExternalResourceReferences | Gets the map of the external resource references referenced by the element. |
|  | GetExternalResourceReferencesExpanded | Gets the expanded map of the external resource references referenced by the element. |
|  | GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object. |
|  | GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference. |
|  | GetMaterialArea | Gets the area of the material with the given id. |
|  | GetMaterialIds | Gets the element ids of all materials present in the element. |
|  | GetMaterialVolume | Gets the volume of the material with the given id. |
|  | GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring. |
|  | GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring. |
|  | GetOrderedParameters | Gets the parameters associated to the element in order. |
|  | GetParameter | Retrieves a parameter from the element given identifier. |
|  | GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists. |
|  | GetParameters | Retrieves the parameters from the element via the given name. |
|  | GetPhaseStatus | Gets the status of a given element in the input phase |
|  | GetSubelements | Returns the collection of element subelements. |
|  | GetTypeId | Returns the identifier of this element's type. |
|  | GetValidTypes | Obtains a set of types that are valid for this element. |
|  | GetValidTypes(Document, ICollectionElementId) |  |
|  | HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId. |
|  | IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. |
|  | IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order. |
|  | IsExternalFileReference | Determines whether this Element represents an external file. |
|  | IsHidden | Identifies if the element has been permanently hidden in the view. |
|  | IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models. |
|  | IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements. |
|  | IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element. |
|  | IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element. |
|  | IsValidType(ElementId) | Checks if given type is valid for this element. |
|  | IsValidType(Document, ICollectionElementId, ElementId) |  |
|  | LookupParameter | Attempts to find a parameter on the element which has the given name. |
|  | RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type. |
|  | RefersToExternalResourceReferences | Determines whether this Element uses external resources. |
|  | SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten. |

The data in a Revit document consists primarily of a collection of elements. An element usually corresponds to a single component of a building or drawing, such as a wall, door, or dimension, but it can also be something more abstract, like a wall type or a view. Every element in a document has a unique ID, represented by the ElementId class.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DB.AnalysisAnalysisDisplayLegend Autodesk.Revit.DB.AnalysisAnalysisDisplayStyle Autodesk.Revit.DB.AnalysisBuildingOperatingDaySchedule Autodesk.Revit.DB.AnalysisBuildingOperatingYearSchedule Autodesk.Revit.DB.AnalysisConceptualSurfaceType Autodesk.Revit.DB.AnalysisEnergyAnalysisConstruction Autodesk.Revit.DB.AnalysisEnergyAnalysisDetailModel Autodesk.Revit.DB.AnalysisEnergyAnalysisMaterial Autodesk.Revit.DB.AnalysisEnergyAnalysisOpening Autodesk.Revit.DB.AnalysisEnergyAnalysisSpace Autodesk.Revit.DB.AnalysisEnergyAnalysisSurface Autodesk.Revit.DB.AnalysisEnergyAnalysisWindowType Autodesk.Revit.DB.AnalysisEnergyAnalysisZone Autodesk.Revit.DB.AnalysisEnergyDataSettings Autodesk.Revit.DB.AnalysisGenericZone Autodesk.Revit.DB.AnalysisHVACLoadType Autodesk.Revit.DB.AnalysisMassLevelData Autodesk.Revit.DB.AnalysisMassSurfaceData Autodesk.Revit.DB.AnalysisPathOfTravel Autodesk.Revit.DB.AnalysisRouteAnalysisSettings Autodesk.Revit.DB.AnalysisSpatialFieldManager Autodesk.Revit.DBAppearanceAssetElement Autodesk.Revit.DB.ArchitectureContinuousRail Autodesk.Revit.DB.ArchitectureMultistoryStairs Autodesk.Revit.DB.ArchitectureRailing Autodesk.Revit.DB.ArchitectureStairs Autodesk.Revit.DB.ArchitectureStairsLanding Autodesk.Revit.DB.ArchitectureStairsPath Autodesk.Revit.DB.ArchitectureStairsRun Autodesk.Revit.DB.ArchitectureTopographySurface Autodesk.Revit.DBAreaScheme Autodesk.Revit.DBAreaVolumeSettings Autodesk.Revit.DBAssemblyInstance Autodesk.Revit.DBBaseArray Autodesk.Revit.DBBasePoint Autodesk.Revit.DBBeamSystem Autodesk.Revit.DBColorFillLegend Autodesk.Revit.DBColorFillScheme Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBComponentRepeater Autodesk.Revit.DBComponentRepeaterSlot Autodesk.Revit.DBConnectorElement Autodesk.Revit.DBControl Autodesk.Revit.DBCurveElement Autodesk.Revit.DBDatumPlane Autodesk.Revit.DBDefaultDivideSettings Autodesk.Revit.DBDesignOption Autodesk.Revit.DBDimension Autodesk.Revit.DBDirectShape Autodesk.Revit.DBDisplacementElement Autodesk.Revit.DBDisplacementPath Autodesk.Revit.DBDividedPath Autodesk.Revit.DBDividedSurface Autodesk.Revit.DB.ElectricalAreaBasedLoadType Autodesk.Revit.DB.ElectricalCableTrayConduitRunBase Autodesk.Revit.DB.ElectricalCableTraySettings Autodesk.Revit.DB.ElectricalCableTraySizes Autodesk.Revit.DB.ElectricalCircuitNamingScheme Autodesk.Revit.DB.ElectricalCircuitNamingSchemeSettings Autodesk.Revit.DB.ElectricalConduitSettings Autodesk.Revit.DB.ElectricalConduitSizeSettings Autodesk.Revit.DB.ElectricalElectricalAnalyticalLoadSet Autodesk.Revit.DB.ElectricalElectricalAnalyticalNode Autodesk.Revit.DB.ElectricalElectricalDemandFactorDefinition Autodesk.Revit.DB.ElectricalElectricalLoadClassification Autodesk.Revit.DB.ElectricalElectricalSetting Autodesk.Revit.DB.ElectricalPanelScheduleSheetInstance Autodesk.Revit.DB.ElectricalPanelScheduleTemplate Autodesk.Revit.DBElementType Autodesk.Revit.DBElevationMarker Autodesk.Revit.DBExportDGNSettings Autodesk.Revit.DBExportDWGSettings Autodesk.Revit.DBExportPDFSettings Autodesk.Revit.DB.ExtensibleStorageDataStorage Autodesk.Revit.DBFabricationConfiguration Autodesk.Revit.DBFabricationPart Autodesk.Revit.DBFabricationServiceSettings Autodesk.Revit.DBFaceSplitter Autodesk.Revit.DBFamily Autodesk.Revit.DBFilledRegion Autodesk.Revit.DBFillPatternElement Autodesk.Revit.DBFilterElement Autodesk.Revit.DBGraphicsStyle Autodesk.Revit.DBGroup Autodesk.Revit.DBHostObject Autodesk.Revit.DBIFCCategoryTemplate Autodesk.Revit.DBIFCParameterTemplate Autodesk.Revit.DBImageInstance Autodesk.Revit.DBIndependentTag Autodesk.Revit.DBInstance Autodesk.Revit.DBInternalOrigin Autodesk.Revit.DBKeyBasedTreeEntryTable Autodesk.Revit.DBLinePatternElement Autodesk.Revit.DBMaterial Autodesk.Revit.DB.MechanicalDuctSettings Autodesk.Revit.DB.MechanicalDuctSizeSettings Autodesk.Revit.DB.MechanicalMechanicalEquipmentSet Autodesk.Revit.DB.MechanicalMEPAnalyticalSystem Autodesk.Revit.DB.MechanicalMEPHiddenLineSettings Autodesk.Revit.DB.MechanicalZone Autodesk.Revit.DB.MechanicalZoneEquipment Autodesk.Revit.DBMEPSystem Autodesk.Revit.DBModelText Autodesk.Revit.DBMultipleValuesIndicationSettings Autodesk.Revit.DBMultiReferenceAnnotation Autodesk.Revit.DBMultiSegmentGrid Autodesk.Revit.DBNestedFamilyTypeReference Autodesk.Revit.DBNumberingSchema Autodesk.Revit.DBNumberSystem Autodesk.Revit.DBOpening Autodesk.Revit.DBParameterElement Autodesk.Revit.DBPart Autodesk.Revit.DBPartMaker Autodesk.Revit.DBPhase Autodesk.Revit.DBPhaseFilter Autodesk.Revit.DB.PlumbingPipeSettings Autodesk.Revit.DBPrintSetting Autodesk.Revit.DBProjectInfo Autodesk.Revit.DBPropertyLine Autodesk.Revit.DBPropertySetElement Autodesk.Revit.DBReferencePoint Autodesk.Revit.DBRevision Autodesk.Revit.DBRevisionCloud Autodesk.Revit.DBRevisionNumberingSequence Autodesk.Revit.DBRevisionSettings Autodesk.Revit.DBScheduleSheetInstance Autodesk.Revit.DBSegment Autodesk.Revit.DBSheetCollection Autodesk.Revit.DBSketchBase Autodesk.Revit.DBSketchPlane Autodesk.Revit.DBSpatialElement Autodesk.Revit.DBSpatialElementCalculationLocation Autodesk.Revit.DBSpatialElementTag Autodesk.Revit.DBSSEPointVisibilitySettings Autodesk.Revit.DBStartingViewSettings Autodesk.Revit.DB.StructureAnalyticalElement Autodesk.Revit.DB.StructureAnalyticalLink Autodesk.Revit.DB.StructureAnalyticalToPhysicalAssociationManager Autodesk.Revit.DB.StructureAreaReinforcement Autodesk.Revit.DB.StructureBoundaryConditions Autodesk.Revit.DB.StructureFabricArea Autodesk.Revit.DB.StructureFabricSheet Autodesk.Revit.DB.StructureHub Autodesk.Revit.DB.StructureLoadBase Autodesk.Revit.DB.StructureLoadCase Autodesk.Revit.DB.StructureLoadCombination Autodesk.Revit.DB.StructureLoadNature Autodesk.Revit.DB.StructureLoadUsage Autodesk.Revit.DB.StructurePathReinforcement Autodesk.Revit.DB.StructureRebar Autodesk.Revit.DB.StructureRebarContainer Autodesk.Revit.DB.StructureRebarCoupler Autodesk.Revit.DB.StructureRebarInSystem Autodesk.Revit.DB.StructureReinforcementSettings Autodesk.Revit.DB.StructureStructuralConnectionHandler Autodesk.Revit.DB.StructureStructuralConnectionSettings Autodesk.Revit.DB.StructureStructuralSettings Autodesk.Revit.DB.StructureTruss Autodesk.Revit.DBSunAndShadowSettings Autodesk.Revit.DBTextElement Autodesk.Revit.DBView Autodesk.Revit.DBViewNavigationToolSettings Autodesk.Revit.DBViewport Autodesk.Revit.DBViewPosition Autodesk.Revit.DBViewSheetSet Autodesk.Revit.DBWorksetDefaultVisibilitySettings Autodesk.Revit.DBWorksharingDisplaySettings