Revit 2026 API

# IndexStreamTriangle Class

---

A stream that can be used to write IndexTriangle primitives into an IndexBuffer

SystemObject Autodesk.Revit.DB.DirectContext3DIndexStream Autodesk.Revit.DB.DirectContext3DIndexStreamTriangle

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IndexStreamTriangle : IndexStream
```
```vb
Public Class IndexStreamTriangle
	Inherits IndexStream
```
```cpp
public ref class IndexStreamTriangle : public IndexStream
```
```fsharp
type IndexStreamTriangle =
    class
        inherit IndexStream
    end
```

The IndexStreamTriangle type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | AddTriangle | Inserts a IndexTriangle into the stream and associated buffer. |
|  | AddTriangles |  |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace