Revit 2026 API

# DialogBoxData Methods

---

The DialogBoxData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |

#### Reference

DialogBoxData Class

Autodesk.Revit.UI.Events Namespace