Revit 2026 API

# BackgroundSettings Class

---

Represents the rendering background settings.

SystemObject Autodesk.Revit.DBBackgroundSettings Autodesk.Revit.DBColorBackgroundSettings Autodesk.Revit.DBGradientBackgroundSettings Autodesk.Revit.DBImageBackgroundSettings Autodesk.Revit.DBSkyBackgroundSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BackgroundSettings : IDisposable
```
```vb
Public Class BackgroundSettings
	Implements IDisposable
```
```cpp
public ref class BackgroundSettings : IDisposable
```
```fsharp
type BackgroundSettings =
    class
        interface IDisposable
    end
```

The BackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the BackgroundSettings |

#### Reference

Autodesk.Revit.DB Namespace