Revit 2026 API

# DefinitionFile Properties

---

The DefinitionFile type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Filename | This property returns the physical filename of the shared parameters file on disk. |
|  | Groups | Return a map of shared parameter definition groups contained within the file. |

#### Reference

DefinitionFile Class

Autodesk.Revit.DB Namespace