Revit 2026 API

# BoundingBoxIsInsideFilter Class

---

A filter used to match elements with a bounding box that is contained by the given Outline.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBBoundingBoxIsInsideFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class BoundingBoxIsInsideFilter : ElementQuickFilter
```
```vb
Public Class BoundingBoxIsInsideFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class BoundingBoxIsInsideFilter : public ElementQuickFilter
```
```fsharp
type BoundingBoxIsInsideFilter =
    class
        inherit ElementQuickFilter
    end
```

The BoundingBoxIsInsideFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BoundingBoxIsInsideFilter(Outline) | Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline. |
|  | BoundingBoxIsInsideFilter(Outline, Boolean) | Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline. |
|  | BoundingBoxIsInsideFilter(Outline, Double) | Constructs a new instance of a filter to match elements with a bounding box that is contained by the given Outline. |
|  | BoundingBoxIsInsideFilter(Outline, Double, Boolean) | Constructs a new instance of a filter to match elements with a bounding box is contained by the given Outline, with the option to invert the filter and match all elements with a bounding box that are not contained by the given Outline. |

|  | Name | Description |
| --- | --- | --- |
|  | Tolerance | Allows control over the match criteria by using a tolerance in the geometry comparison. It is suggested to use this in cases where trivial differences should be considered when matching elements. |

|  | Name | Description |
| --- | --- | --- |
|  | GetBoundingBox | Gets the outline being used for this filter. |

This filter excludes all objects derived from View and objects derived from ElementType. This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace