Revit 2026 API

# TriangleInShellComponent Methods

---

The TriangleInShellComponent type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

TriangleInShellComponent Class

Autodesk.Revit.DB Namespace