Revit 2026 API

# VertexIndexPairArray Class

---

An array that contains VertexIndex pairs.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBVertexIndexPairArray

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexIndexPairArray : APIObject,
	IEnumerable
```
```vb
Public Class VertexIndexPairArray
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class VertexIndexPairArray : public APIObject,
	IEnumerable
```
```fsharp
type VertexIndexPairArray =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The VertexIndexPairArray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexIndexPairArray | Initializes a new instance of the VertexIndexPairArray class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the array is empty. |
|  | Item | Gets or sets a VertexIndex pair at a specified index within the array. |
|  | Size | Returns the number of VertexIndex pairs that are in the array. |

|  | Name | Description |
| --- | --- | --- |
|  | Append |  |
|  | Clear | Removes every VertexIndex pair from the array, rendering it empty. |
|  | ForwardIterator | Retrieve a forward moving iterator to the array. |
|  | GetEnumerator | Retrieve a forward moving iterator to the array. |
|  | Insert |  |
|  | ReverseIterator | Retrieve a backward moving iterator to the array. |

#### Reference

Autodesk.Revit.DB Namespace