Revit 2026 API

# FamilyInstanceFilter Class

---

A filter used to find elements that are family instances of the given family symbol.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementSlowFilter Autodesk.Revit.DBFamilyInstanceFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyInstanceFilter : ElementSlowFilter
```
```vb
Public Class FamilyInstanceFilter
	Inherits ElementSlowFilter
```
```cpp
public ref class FamilyInstanceFilter : public ElementSlowFilter
```
```fsharp
type FamilyInstanceFilter =
    class
        inherit ElementSlowFilter
    end
```

The FamilyInstanceFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyInstanceFilter | Constructs a new instance of a filter to match family instances of the given family symbol. |

|  | Name | Description |
| --- | --- | --- |
|  | FamilySymbolId | The family symbol id. |

|  | Name | Description |
| --- | --- | --- |

This filter is a slow filter, but it uses a quick filter to eliminate non-candidate elements before the elements are obtained and expanded. Therefore this filter does not have to be paired with another quick filter to minimize the number of Elements that are expanded.

#### Reference

Autodesk.Revit.DB Namespace