Revit 2026 API

# ProjectBrowserOptions Class

---

Provides access to settings that control Revit's Project Browser appearance and functionality.

SystemObject Autodesk.Revit.UIProjectBrowserOptions

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ProjectBrowserOptions : IDisposable
```
```vb
Public Class ProjectBrowserOptions
	Implements IDisposable
```
```cpp
public ref class ProjectBrowserOptions : IDisposable
```
```fsharp
type ProjectBrowserOptions =
    class
        interface IDisposable
    end
```

The ProjectBrowserOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ShowViewPlacementOnSheetStatusIcons | Show the icons indicating view placement on sheet status. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ProjectBrowserOptions |
|  | GetProjectBrowserOptions | Returns the current Revit instance's ProjectBrowserOptions. |

These settings are stored in the Revit.ini file. All documents in Revit instances which use this Revit.ini will follow these settings.

#### Reference

Autodesk.Revit.UI Namespace