Revit 2026 API

# PartMaker Class

---

PartMaker is an element which takes some source elements (e.g., a wall with all its layers) and creates one or more Parts out of it. The logic according to which these Parts are created is non-trivial and PartMaker uses various PartMakerMethods which represents these logics. This element manages the strategy to make Part elements for one or more original elements.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBPartMaker

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PartMaker : Element
```
```vb
Public Class PartMaker
	Inherits Element
```
```cpp
public ref class PartMaker : public Element
```
```fsharp
type PartMaker =
    class
        inherit Element
    end
```

The PartMaker type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetSourceElementIds | Get the source elements for the PartMaker. |
|  | IsSourceElement | Is the element a source for this PartMaker |
|  | SetSourceElementIds |  |

#### Reference

Autodesk.Revit.DB Namespace