Revit 2026 API

# PolymeshFacet Methods

---

The PolymeshFacet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetVertices | Returns the three vertices that define this facet |
|  | ToString | Returns formatted string showing (V1, V2, V3) with values formatted as regular integers (Overrides ObjectToString) |

#### Reference

PolymeshFacet Class

Autodesk.Revit.DB Namespace