Revit 2026 API

# IFCRange Methods

---

The IFCRange type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

IFCRange Class

Autodesk.Revit.DB.IFC Namespace