Revit 2026 API

# DirectShapeType Properties

---

The DirectShapeType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | UserAssignability | An option controlling the ability of DirectShapes to assign this DirectShapeType as its type. |

#### Reference

DirectShapeType Class

Autodesk.Revit.DB Namespace