Revit 2026 API

# ExternallyTaggedGeometryObject Methods

---

The ExternallyTaggedGeometryObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExternallyTaggedGeometryObject Class

Autodesk.Revit.DB Namespace