Revit 2026 API

# GradientBackgroundSettings Class

---

Represents the view gradient background settings.

SystemObject Autodesk.Revit.DBBackgroundSettings Autodesk.Revit.DBGradientBackgroundSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GradientBackgroundSettings : BackgroundSettings
```
```vb
Public Class GradientBackgroundSettings
	Inherits BackgroundSettings
```
```cpp
public ref class GradientBackgroundSettings : public BackgroundSettings
```
```fsharp
type GradientBackgroundSettings =
    class
        inherit BackgroundSettings
    end
```

The GradientBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroundColor | The color of the ground. |
|  | HorizonColor | The color of the horizon. |
|  | SkyColor | The color of the top of the sky. |

|  | Name | Description |
| --- | --- | --- |

The colors of the background are interpolated for the pixels corresponding to the sky - from the "sky color" (top) to the "horizon color" (bottom). The ground is represented with a solid color ("ground color").

#### Reference

Autodesk.Revit.DB Namespace