Revit 2026 API

# ConnectionValidationWarning Methods

---

The ConnectionValidationWarning type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetParts | Get ElementIds of affected parts. |

#### Reference

ConnectionValidationWarning Class

Autodesk.Revit.DB Namespace