Revit 2026 API

# FamilyParameter Methods

---

The FamilyParameter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetUnitTypeId | Gets the identifier of the unit quantifying the parameter value. |

#### Reference

FamilyParameter Class

Autodesk.Revit.DB Namespace