Revit 2026 API

# DimensionSegmentArrayIterator Methods

---

The DimensionSegmentArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

DimensionSegmentArrayIterator Class

Autodesk.Revit.DB Namespace