Revit 2026 API

# FabricReinSpanSymbol Class

---

Represents an instance of a Structural Fabric Reinforcement Symbol in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBIndependentTag Autodesk.Revit.DB.StructureFabricReinSpanSymbol

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FabricReinSpanSymbol : IndependentTag
```
```vb
Public Class FabricReinSpanSymbol
	Inherits IndependentTag
```
```cpp
public ref class FabricReinSpanSymbol : public IndependentTag
```
```fsharp
type FabricReinSpanSymbol =
    class
        inherit IndependentTag
    end
```

The FabricReinSpanSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Places a new instance of the Structural Fabric Reinforcement Symbol into the project relative to a particular FabricSheet and View. |

#### Reference

Autodesk.Revit.DB.Structure Namespace