Revit 2026 API

# DesignOption Class

---

An element that represents a design alternative.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDesignOption

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DesignOption : Element
```
```vb
Public Class DesignOption
	Inherits Element
```
```cpp
public ref class DesignOption : public Element
```
```fsharp
type DesignOption =
    class
        inherit Element
    end
```

The DesignOption type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsPrimary | Determines whether this is a primary design option. |

|  | Name | Description |
| --- | --- | --- |
|  | GetActiveDesignOptionId | Gets the active design option id for the document. |

Design options enable the user to add alternative designs within the same project. Each element can either be in a design option or not at all, in which case it is considered to be part of the main model and have no design alternatives.

#### Reference

Autodesk.Revit.DB Namespace