Revit 2026 API

# Sweep Class

---

A sweep solid or void form.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCombinableElement Autodesk.Revit.DBGenericForm Autodesk.Revit.DBSweep

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class Sweep : GenericForm
```
```vb
Public Class Sweep
	Inherits GenericForm
```
```cpp
public ref class Sweep : public GenericForm
```
```fsharp
type Sweep =
    class
        inherit GenericForm
    end
```

The Sweep type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsTrajectorySegmentationEnabled | The trajectory segmentation option for the sweep. |
|  | MaxSegmentAngle | The maximum segment angle of the sweep in radians. |
|  | Path3d | The selected curves used for the sweep path. |
|  | PathSketch | The sketched path for the sweep. |
|  | ProfileSketch | The profile sketch of the sweep. |
|  | ProfileSymbol | The family symbol profile details for the sweep. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace