Revit 2026 API

# TilePattern Class

---

An object representing a tile pattern that may be applied to a DividedSurface.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DBTilePattern

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TilePattern : ElementType
```
```vb
Public Class TilePattern
	Inherits ElementType
```
```cpp
public ref class TilePattern : public ElementType
```
```fsharp
type TilePattern =
    class
        inherit ElementType
    end
```

The TilePattern type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TilePatternType | The built-in system tile pattern specified by this object. |
|  | TilesPerSeedNode | Get the number of tiles located at each seed node. |

|  | Name | Description |
| --- | --- | --- |

TilePatterns cannot be created. A fixed selection is built into each Conceptual Mass family. TilePatterns can be retrieved by key from the Revit::DB::Document::Settings::TilePatternTable object.

#### Reference

Autodesk.Revit.DB Namespace