Revit 2026 API

# StructuralConnectionHandler Methods

---

The StructuralConnectionHandler type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddElementIds |  |
|  | AddReferences |  |
|  | Create(Document, IListElementId, ElementId) |  |
|  | Create(Document, IListElementId, String) |  |
|  | Create(Document, IListElementId, ElementId, IListConnectionInputPoint) |  |
|  | CreateGenericConnection |  |
|  | GetConnectedElementIds | Retrieves list of element ids of connected elements. |
|  | GetInputPoint | Returns point with specified id. Returns null if specified point does not exist |
|  | GetInputPoints | Returns a list of additional points defining certain connections. |
|  | GetInputReferences | Gets references of input elements. |
|  | GetOrigin | Retrieves origin point of Structural Connection Handler element. |
|  | IsCustom | Checks if Structural Connection Handler has the custom connection style. |
|  | IsDetailed | Checks if Structural Connection Handler has the detailed connection style. |
|  | RemoveElementIds |  |
|  | RemoveReferences |  |
|  | SetDefaultElementOrder | Sorts the connected elements connection according to structural categories, element materials and geometries. The steel element is set rather than an element of other material. The priorities of the elements are set according structural categories in following order: columns, framings, walls, foundations, floors. In case of several Structural Framing elements order is determined by cutting - the cutting element is set as the primary one rather than element being cut. |

#### Reference

StructuralConnectionHandler Class

Autodesk.Revit.DB.Structure Namespace