Revit 2026 API

# DefinitionBindingMapIterator Properties

---

The DefinitionBindingMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the binding that is the current focus of the iterator. |
|  | Key | Retrieves the definition that is the current focus of the iterator. |

#### Reference

DefinitionBindingMapIterator Class

Autodesk.Revit.DB Namespace