Revit 2026 API

# Extrusion Properties

---

The Extrusion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EndOffset | The offset of the end of the extrusion relative to the sketch plane. |
|  | Sketch | Returns the Sketch of the Extrusion. |
|  | StartOffset | The offset of the start of the extrusion relative to the sketch plane. |

#### Reference

Extrusion Class

Autodesk.Revit.DB Namespace