Revit 2026 API

# IExternalResourceUIServer Methods

---

The IExternalResourceUIServer type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetDBServerId | Implement this method to return the id of the server which is associated with this UI server. |
|  | HandleBrowseResult | Implement this method to handle results from browsing external resources in the UI. It is recommended that the server only respond in the case of a critical error. |
|  | HandleLoadResourceResults |  |

#### Reference

IExternalResourceUIServer Interface

Autodesk.Revit.UI Namespace