Revit 2026 API

# SlabShapeCreaseArrayIterator Methods

---

The SlabShapeCreaseArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

SlabShapeCreaseArrayIterator Class

Autodesk.Revit.DB Namespace