Revit 2026 API

# FilterStringEndsWith Class

---

Tests whether string values from the document end with a certain string.

SystemObject Autodesk.Revit.DBFilterStringRuleEvaluator Autodesk.Revit.DBFilterStringEndsWith

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterStringEndsWith : FilterStringRuleEvaluator
```
```vb
Public Class FilterStringEndsWith
	Inherits FilterStringRuleEvaluator
```
```cpp
public ref class FilterStringEndsWith : public FilterStringRuleEvaluator
```
```fsharp
type FilterStringEndsWith =
    class
        inherit FilterStringRuleEvaluator
    end
```

The FilterStringEndsWith type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterStringEndsWith | Constructs an instance of FilterStringEndsWith. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

All string comparisons in this class are performed in the case-insensitive manner.

#### Reference

Autodesk.Revit.DB Namespace