Revit 2026 API

# AlphanumericRevisionSettings Class

---

Contains settings that apply to Revisions with the Alphanumeric RevisionNumberType.

SystemObject Autodesk.Revit.DBAlphanumericRevisionSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AlphanumericRevisionSettings : IDisposable
```
```vb
Public Class AlphanumericRevisionSettings
	Implements IDisposable
```
```cpp
public ref class AlphanumericRevisionSettings : IDisposable
```
```fsharp
type AlphanumericRevisionSettings =
    class
        interface IDisposable
    end
```

The AlphanumericRevisionSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AlphanumericRevisionSettings | Constructs an AlphanumericRevisionSettings with a simple, default sequence. |
|  | AlphanumericRevisionSettings(AlphanumericRevisionSettings) | Constructs a new copy of the input AlphanumericRevisionSettings object. |
|  | AlphanumericRevisionSettings(IListString, String, String) | Initializes a new instance of the AlphanumericRevisionSettings class |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Prefix | The prefix string that will be prepended to the number of each revision with Alphanumeric RevisionNumberingType. |
|  | Suffix | The suffix string that will be appended to the number of each revision with Alphanumeric RevisionNumberingType. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AlphanumericRevisionSettings |
|  | GetSequence | Gets a list containing the strings to be used as the numbering sequence for revisions with the Alphanumeric RevisionNumberType. |
|  | IsEqual | Determines whether a specified AlphanumericRevisionSettings is the same as 'this'. |
|  | IsValid | Determines whether the AlphanumericRevisionSettings object is in a valid state. |
|  | SetSequence |  |

#### Reference

Autodesk.Revit.DB Namespace