Revit 2026 API

# SpatialElementBoundaryOptions Class

---

Options that can be passed to a SpatialElementBoundaryCalculator to influence the results of the calculation.

SystemObject Autodesk.Revit.DBSpatialElementBoundaryOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementBoundaryOptions : IDisposable
```
```vb
Public Class SpatialElementBoundaryOptions
	Implements IDisposable
```
```cpp
public ref class SpatialElementBoundaryOptions : IDisposable
```
```fsharp
type SpatialElementBoundaryOptions =
    class
        interface IDisposable
    end
```

The SpatialElementBoundaryOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SpatialElementBoundaryOptions | Constructs default options for calculation of the geometry of spatial elements (rooms, spaces). |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | SpatialElementBoundaryLocation | The boundary of spatial element for geometry calculation. |
|  | StoreFreeBoundaryFaces | Indicates whether to include the free boundary faces in the result. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SpatialElementBoundaryOptions |

#### Reference

Autodesk.Revit.DB Namespace