Revit 2026 API

# MemberForcesServiceData Methods

---

The MemberForcesServiceData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetCurrentElements | Returns the list of Ids of the current elements. |

#### Reference

MemberForcesServiceData Class

Autodesk.Revit.DB.Structure Namespace