Revit 2026 API

# ClipPlane Class

---

A set of parameters representing a clip plane in DirectContext3D.

SystemObject Autodesk.Revit.DB.DirectContext3DClipPlane

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ClipPlane : IDisposable
```
```vb
Public Class ClipPlane
	Implements IDisposable
```
```cpp
public ref class ClipPlane : IDisposable
```
```fsharp
type ClipPlane =
    class
        interface IDisposable
    end
```

The ClipPlane type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ClipPlane | Constructs a copy of the clip plane. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Normal | The plane's normal vector. |
|  | Origin | The plane's origin. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ClipPlane |

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace