Revit 2026 API

# RadioButtonGroupData Class

---

This class contains information necessary to construct a ribbon gallery in the Ribbon.

SystemObject Autodesk.Revit.UIItemData Autodesk.Revit.UIRibbonItemData Autodesk.Revit.UIRadioButtonGroupData

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RadioButtonGroupData : RibbonItemData
```
```vb
Public Class RadioButtonGroupData
	Inherits RibbonItemData
```
```cpp
public ref class RadioButtonGroupData : public RibbonItemData
```
```fsharp
type RadioButtonGroupData =
    class
        inherit RibbonItemData
    end
```

The RadioButtonGroupData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RadioButtonGroupData | Constructs a new instance of RadioButtonGroupData. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.UI Namespace