Revit 2026 API

# CommandMenuItem Methods

---

The CommandMenuItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SetAvailabilityClassName | Set availabilityClassName of CommandMenuItem |
|  | SetToolTip | Set toolTip of CommandMenuItem |

#### Reference

CommandMenuItem Class

Autodesk.Revit.UI Namespace