Revit 2026 API

# SpaceTag Class

---

Provides access to the space tag in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElementTag Autodesk.Revit.DB.MechanicalSpaceTag

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpaceTag : SpatialElementTag
```
```vb
Public Class SpaceTag
	Inherits SpatialElementTag
```
```cpp
public ref class SpaceTag : public SpatialElementTag
```
```fsharp
type SpaceTag =
    class
        inherit SpatialElementTag
    end
```

The SpaceTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Space | The space that the tag is associated with. |
|  | SpaceTagType | The tag type. |

|  | Name | Description |
| --- | --- | --- |

The space Tag object can be queried for space information.

#### Reference

Autodesk.Revit.DB.Mechanical Namespace