Revit 2026 API

# ExternalApplicationArrayIterator Class

---

An iterator to an array of IExternalApplication objects..

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.UIExternalApplicationArrayIterator

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ExternalApplicationArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ExternalApplicationArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ExternalApplicationArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ExternalApplicationArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ExternalApplicationArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalApplicationArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.UI Namespace