Revit 2026 API

# PaperSizeSetIterator Properties

---

The PaperSizeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

PaperSizeSetIterator Class

Autodesk.Revit.DB Namespace