Revit 2026 API

# ExternalResourceMatchOptions Methods

---

The ExternalResourceMatchOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExternalResourceMatchOptions Class

Autodesk.Revit.DB Namespace