Revit 2026 API

# BRepBuilderGeometryId Methods

---

The BRepBuilderGeometryId type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | InvalidGeometryId | Returns an invalid BRepBuilderGeometryId, used as a return value to indicate an error. |

#### Reference

BRepBuilderGeometryId Class

Autodesk.Revit.DB Namespace