Revit 2026 API

# IFCBuiltInCategoryKey Class

---

A key used to represent an item stored in a template.

SystemObject Autodesk.Revit.DBIFCBuiltInCategoryKey

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class IFCBuiltInCategoryKey : IDisposable
```
```vb
Public Class IFCBuiltInCategoryKey
	Implements IDisposable
```
```cpp
public ref class IFCBuiltInCategoryKey : IDisposable
```
```fsharp
type IFCBuiltInCategoryKey =
    class
        interface IDisposable
    end
```

The IFCBuiltInCategoryKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the IFCBuiltInCategoryKey |

#### Reference

Autodesk.Revit.DB Namespace