Revit 2026 API

# EdgeArrayIterator Methods

---

The EdgeArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

EdgeArrayIterator Class

Autodesk.Revit.DB Namespace