Revit 2026 API

# FailureResolution Methods

---

The FailureResolution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FailureResolution Class

Autodesk.Revit.DB Namespace