Revit 2026 API

# ModelCurve Class

---

A model element that exists in 3D space and is visible in all views of a Revit project.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ModelCurve : CurveElement
```
```vb
Public Class ModelCurve
	Inherits CurveElement
```
```cpp
public ref class ModelCurve : public CurveElement
```
```fsharp
type ModelCurve =
    class
        inherit CurveElement
    end
```

The ModelCurve type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsReferenceLine | Indicates if this curve is a reference curve. |
|  | Subcategory | The subcategory. |
|  | TrussCurveType | The truss curve type of this model curve. |

|  | Name | Description |
| --- | --- | --- |
|  | ChangeToReferenceLine | Changes this curve to a reference curve. |
|  | GetVisibility | Gets the visibility for the model curve in a family document. |
|  | SetVisibility | Sets the visibility for the model curve in a family document. |

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBCurveElement Autodesk.Revit.DBModelCurve Autodesk.Revit.DBModelArc Autodesk.Revit.DBModelEllipse Autodesk.Revit.DBModelHermiteSpline Autodesk.Revit.DBModelLine Autodesk.Revit.DBModelNurbSpline