Revit 2026 API

# ApplicationEntryPoint Class

---

For Revit Macros use only.

SystemObject Autodesk.Revit.ApplicationServicesApplication Autodesk.Revit.DB.MacrosApplicationEntryPoint

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ApplicationEntryPoint : Application,
	IEntryPoint
```
```vb
Public MustInherit Class ApplicationEntryPoint
	Inherits Application
	Implements IEntryPoint
```
```cpp
public ref class ApplicationEntryPoint abstract : public Application,
	IEntryPoint
```
```fsharp
[<AbstractClassAttribute>]
type ApplicationEntryPoint =
    class
        inherit Application
        interface IEntryPoint
    end
```

The ApplicationEntryPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationEntryPoint | Initializes a new instance of the ApplicationEntryPoint class |

|  | Name | Description |
| --- | --- | --- |
|  | AddinFolder | The full path to the Revit Macros module. |

|  | Name | Description |
| --- | --- | --- |
|  | FinishInitializationEO | For Revit Macros internal use only. |
|  | Initialize | For Revit Macros internal use only. |
|  | OnShutdownEO | For Revit Macros internal use only. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Macros Namespace