Revit 2026 API

# RebarHandlesData Methods

---

The RebarHandlesData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddCustomHandle | Adds a new handle definition to the rebar. This information is set to the rebar after the API execution is finished successfully. |
|  | Dispose |  |
|  | GetCustomHandles | Gets the handle definitions for the rebar that were added. |
|  | GetEndHandle | Gets the end handle tag. |
|  | GetStartHandle | Gets the start handle tag. |
|  | SetEndHandle | Sets the end handle tag. This information is set to the rebar after the API execution is finished successfully. |
|  | SetStartHandle | Sets the start handle tag. This information is set to the rebar after the API execution is finished successfully. |

#### Reference

RebarHandlesData Class

Autodesk.Revit.DB.Structure Namespace