Revit 2026 API

# ColorOptions Methods

---

The ColorOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetColorOptions | Returns the current Revit instance's ColorOptions. |

#### Reference

ColorOptions Class

Autodesk.Revit.DB Namespace