Revit 2026 API

# PlanTopology Methods

---

The PlanTopology type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetRoomIds | Retrieves room ElementIds of the PlanTopology in the last phase. |

#### Reference

PlanTopology Class

Autodesk.Revit.DB Namespace