Revit 2026 API

# DWFImportOptions Methods

---

The DWFImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetSheetViews | Get sheet views where DWF markups are imported. |
|  | SetSheetViews |  |

#### Reference

DWFImportOptions Class

Autodesk.Revit.DB Namespace