Revit 2026 API

# GroupLoadOptions Class

---

A class containing options for loading a group from a file.

SystemObject Autodesk.Revit.DBGroupLoadOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class GroupLoadOptions : IDisposable
```
```vb
Public Class GroupLoadOptions
	Implements IDisposable
```
```cpp
public ref class GroupLoadOptions : IDisposable
```
```fsharp
type GroupLoadOptions =
    class
        interface IDisposable
    end
```

The GroupLoadOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GroupLoadOptions | Creates a new instance of a GroupLoadOptions object. |

|  | Name | Description |
| --- | --- | --- |
|  | IncludeAttachedDetails | True if attached detail groups should be included, false otherwise. The default value is . |
|  | IncludeGrids | True if grids should be brought in from the input file, false otherwise. The default value is . |
|  | IncludeLevels | True if levels should be brought in from the input file, false otherwise. The default value is . |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ReplaceDuplicatedGroups | If there are groups with the same names in source and destination documents set this property to  to replace existing groups, otherwise the operation will be canceled. The default value is . |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the GroupLoadOptions |
|  | GetDuplicateTypeNamesHandler | Returns current duplicate type names handler or  if none is set. |
|  | SetDuplicateTypeNamesHandler | Sets a custom duplicate type names handler. If this value is not set, the default handler is used. By default, Revit displays a modal dialog with options to either copy new types only, or cancel the operation. |

#### Reference

Autodesk.Revit.DB Namespace