Revit 2026 API

# CurveArrayIterator Class

---

An iterator to a curve array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCurveArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CurveArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CurveArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CurveArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CurveArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace