Revit 2026 API

# WireMaterialTypeSet Methods

---

The WireMaterialTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every wire material type from the set, rendering it empty. |
|  | Contains | Tests for the existence of a wire material type within the set. |
|  | Erase | Removes a specified wire material type from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified wire material type into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

WireMaterialTypeSet Class

Autodesk.Revit.DB.Electrical Namespace