Revit 2026 API

# ObjectAccessException Methods

---

The ObjectAccessException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

ObjectAccessException Class

Autodesk.Revit.Exceptions Namespace