Revit 2026 API

# FilterStringRuleEvaluator Methods

---

The FilterStringRuleEvaluator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Evaluate | Derived classes override this method to implement the test that determines whether the two given string values satisfy the desired condition or not. |

#### Reference

FilterStringRuleEvaluator Class

Autodesk.Revit.DB Namespace