Revit 2026 API

# TopographyEditScope Methods

---

The TopographyEditScope type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Start | Starts a topography surface edit mode for an existing TopographySurface element. |

#### Reference

TopographyEditScope Class

Autodesk.Revit.DB.Architecture Namespace