Revit 2026 API

# ImageView Properties

---

The ImageView type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ImageInstanceId | Id of the image in the view. |

#### Reference

ImageView Class

Autodesk.Revit.DB Namespace