Revit 2026 API

# Wall Methods

---

The Wall type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddAttachment | Attaches the wall to the target. If an attachment already exists with the same "attachmentLocation" value, an exception is thrown. The target should be a roof, floor, ceiling, toposolid, or other wall. |
|  | AllowWrappingAtLocation | Allow end wrapping at the location. |
|  | CanHaveProfileSketch | Checks whether this wall has or can have a profile sketch. |
|  | Create(Document, IListCurve, Boolean) |  |
|  | Create(Document, Curve, ElementId, Boolean) | Creates a new rectangular profile wall within the project using the default wall style. |
|  | Create(Document, IListCurve, ElementId, ElementId, Boolean) |  |
|  | Create(Document, IListCurve, ElementId, ElementId, Boolean, XYZ) |  |
|  | Create(Document, Curve, ElementId, ElementId, Double, Double, Boolean, Boolean) | Creates a new rectangular profile wall within the project using the specified wall type, height, and offset. |
|  | CreateProfileSketch | Creates a new Wall profile Sketch. |
|  | DisallowWrappingAtLocation | Disallow end wrapping at the location. |
|  | Flip | The wall orientation will be flipped. |
|  | GetAttachmentIds | Gets the ids of the target elements that are attached to the Wall. |
|  | GetStackedWallMemberIds | Get the sub walls which belongs to the wall. |
|  | GetValidWrappingLocationIndices | Gets all valid locations for end wrapping. |
|  | GetWrappingLocationAsCurveParameter | Gets the non-normalized (actual) curve parameter of the location. |
|  | GetWrappingLocationAsReferences | Gets an array of references to faces at the location. |
|  | IsValidTargetAttachment | Says whether the element id can be used as a target for a new attachment. |
|  | IsWallCrossSectionValid | Checks whether the desired cross section is valid for the current wall. |
|  | IsWrappingAtLocationAllowed | If end wrapping is allowed at the location. |
|  | RemoveAttachment(ElementId) | Removes any attachment of the wall to the specified target. |
|  | RemoveAttachment(ElementId, AttachmentLocation) | Removes an attachment at the top or base of a wall, if there is one. |
|  | RemoveProfileSketch | Reverts an edited wall to its original shape. |

#### Reference

Wall Class

Autodesk.Revit.DB Namespace