Revit 2026 API

# SpotDimension Class

---

Object representing various types of SpotDimension

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBDimension Autodesk.Revit.DBSpotDimension

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpotDimension : Dimension
```
```vb
Public Class SpotDimension
	Inherits Dimension
```
```cpp
public ref class SpotDimension : public Dimension
```
```fsharp
type SpotDimension =
    class
        inherit Dimension
    end
```

The SpotDimension type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LeaderHasShoulder | True is dimension has leader with shoulder, false otherwise. |
|  | LeaderShoulderPosition | Position of spot dimension's leader shoulder point. |
|  | SpotDimensionType | The dimension style of this dimension. |

|  | Name | Description |
| --- | --- | --- |
|  | CanFlip | Verifies that the direction of the dimension can be flipped. |
|  | Flip | Flips dimension to the other side of the host. |

#### Reference

Autodesk.Revit.DB Namespace