Revit 2026 API

# PolyLine Class

---

A polyline.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBPolyLine

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class PolyLine : GeometryObject
```
```vb
Public Class PolyLine
	Inherits GeometryObject
```
```cpp
public ref class PolyLine : public GeometryObject
```
```fsharp
type PolyLine =
    class
        inherit GeometryObject
    end
```

The PolyLine type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NumberOfCoordinates | Gets the number of the coordinate points. |

|  | Name | Description |
| --- | --- | --- |
|  | Clone | Returns a copy of this polyline. |
|  | Create |  |
|  | Evaluate | Evaluates a parameter on the polyline. |
|  | GetCoordinate | Gets the coordinate point of the specified index. |
|  | GetCoordinates | Gets the coordinate points of the polyline. |
|  | GetOutline | Gets the outline of the polyline. |
|  | GetTransformed | Gets the copy of the polyline which is applied the specified transformation. |

A polyline in space is defined by a set of coordinate points.

#### Reference

Autodesk.Revit.DB Namespace