Revit 2026 API

# PlanTopologySetIterator Methods

---

The PlanTopologySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

PlanTopologySetIterator Class

Autodesk.Revit.DB Namespace