Revit 2026 API

# ElementIsCurveDrivenFilter Class

---

A filter used to match elements which are curve driven.

SystemObject Autodesk.Revit.DBElementFilter Autodesk.Revit.DBElementQuickFilter Autodesk.Revit.DBElementIsCurveDrivenFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementIsCurveDrivenFilter : ElementQuickFilter
```
```vb
Public Class ElementIsCurveDrivenFilter
	Inherits ElementQuickFilter
```
```cpp
public ref class ElementIsCurveDrivenFilter : public ElementQuickFilter
```
```fsharp
type ElementIsCurveDrivenFilter =
    class
        inherit ElementQuickFilter
    end
```

The ElementIsCurveDrivenFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementIsCurveDrivenFilter | Constructs a new instance of a filter to match only curve driven elements. |
|  | ElementIsCurveDrivenFilter(Boolean) | Constructs a new instance of a filter to match only curve driven elements, with the option to match all elements which are not curve driven elements. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

The term "curve driven" indicates that the element's Location property is a LocationCurve. Example elements found by this filter include walls, beams, and curve elements. This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.

#### Reference

Autodesk.Revit.DB Namespace