Revit 2026 API

# CurveNode Class

---

An output node that represents a model curve.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBModelCurveNode Autodesk.Revit.DBCurveNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CurveNode : ModelCurveNode
```
```vb
Public Class CurveNode
	Inherits ModelCurveNode
```
```cpp
public ref class CurveNode : public ModelCurveNode
```
```fsharp
type CurveNode =
    class
        inherit ModelCurveNode
    end
```

The CurveNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetCurve | Returns the geometric curve object corresponding to the node. |

See also: [!:Autodesk::Revit::DB::IModelExportContext::OnCurve].

#### Reference

Autodesk.Revit.DB Namespace