Revit 2026 API

# SpatialElementCalculationLocation Class

---

The Spatial Element Calculation Location is used to specify the room/space where an element should be considered as placed.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBSpatialElementCalculationLocation Autodesk.Revit.DBSpatialElementCalculationPoint Autodesk.Revit.DBSpatialElementFromToCalculationPoints

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SpatialElementCalculationLocation : Element
```
```vb
Public Class SpatialElementCalculationLocation
	Inherits Element
```
```cpp
public ref class SpatialElementCalculationLocation : public Element
```
```fsharp
type SpatialElementCalculationLocation =
    class
        inherit Element
    end
```

The SpatialElementCalculationLocation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MarkerPosition | The position of the spatial element calculation location marker. |

|  | Name | Description |
| --- | --- | --- |

It currently has two types of calculation location: SpatialElementCalculationPoint and SpatialElementFromToCalculationPoints A user can turn on the Spatial Element Calculation Location in the family editor by setting the family's ROOM_CALCULATION_POINT parameter. A user can move the location of the Spatial Element Calculation Location in the family editor. A user can visually verify the location of the Spatial Element Calculation Point by selecting the fixture in the project.

#### Reference

Autodesk.Revit.DB Namespace