Revit 2026 API

# TypeBinding Class

---

TypeBinding objects are used to bind a property to a Revit type, such as a wall type.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBBinding Autodesk.Revit.DBElementBinding Autodesk.Revit.DBTypeBinding

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TypeBinding : ElementBinding
```
```vb
Public Class TypeBinding
	Inherits ElementBinding
```
```cpp
public ref class TypeBinding : public ElementBinding
```
```fsharp
type TypeBinding =
    class
        inherit ElementBinding
    end
```

The TypeBinding type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TypeBinding | Constructs an empty type binding. |
|  | TypeBinding(CategorySet) | Constructs a type binding with the set of categories passed. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

This differs from Instance bindings in that the property is then shared by all instances that use that type. Changing the parameter for one type affects all other instances that use that type.

#### Reference

Autodesk.Revit.DB Namespace