Revit 2026 API

# AssemblyMemberDifference Class

---

Class that describes difference between two assembly members

SystemObject Autodesk.Revit.DBAssemblyMemberDifference Autodesk.Revit.DBAssemblyMemberDifferentCategory Autodesk.Revit.DBAssemblyMemberDifferentGeometry Autodesk.Revit.DBAssemblyMemberDifferentParameters Autodesk.Revit.DBAssemblyMemberDifferentType

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AssemblyMemberDifference : IDisposable
```
```vb
Public Class AssemblyMemberDifference
	Implements IDisposable
```
```cpp
public ref class AssemblyMemberDifference : IDisposable
```
```fsharp
type AssemblyMemberDifference =
    class
        interface IDisposable
    end
```

The AssemblyMemberDifference type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the AssemblyMemberDifference |

Different sub-classes of this class represent different kinds of differences between assembly members and contain additional data for each particular kind of difference.

#### Reference

Autodesk.Revit.DB Namespace