Revit 2026 API

# ExportIFCCategoryKey Methods

---

The ExportIFCCategoryKey type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ExportIFCCategoryKey Class

Autodesk.Revit.DB Namespace