Revit 2026 API

# AddInIdAttribute Class

---

The custom AddInId attribute for Macros macros use only.

SystemObject SystemAttribute Autodesk.Revit.DB.MacrosAddInIdAttribute

**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AddInIdAttribute : Attribute
```
```vb
Public Class AddInIdAttribute
	Inherits Attribute
```
```cpp
public ref class AddInIdAttribute : public Attribute
```
```fsharp
type AddInIdAttribute =
    class
        inherit Attribute
    end
```

The AddInIdAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddInIdAttribute | Constructs a new AddInIdAttribute. |

|  | Name | Description |
| --- | --- | --- |
|  | Value | AddInId guid value. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Macros Namespace