Revit 2026 API

# RevitAPIPreEventArgs Methods

---

The RevitAPIPreEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. |

#### Reference

RevitAPIPreEventArgs Class

Autodesk.Revit.DB.Events Namespace