Revit 2026 API

# CylindricalFace Properties

---

The CylindricalFace type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Axis | Axis of the surface. |
|  | Origin | Origin of the surface. |
|  | Radius | Radii of the surface. |

#### Reference

CylindricalFace Class

Autodesk.Revit.DB Namespace