Revit 2026 API

# LevelAssociationData Class

---

This class holds information related to Level.

SystemObject Autodesk.Revit.DBLevelAssociationData

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LevelAssociationData : IDisposable
```
```vb
Public Class LevelAssociationData
	Implements IDisposable
```
```cpp
public ref class LevelAssociationData : IDisposable
```
```fsharp
type LevelAssociationData =
    class
        interface IDisposable
    end
```

The LevelAssociationData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the LevelAssociationData |
|  | GetAssociatedLevel | Returns the Associated Level id. |
|  | GetLevelAssociationData | Returns LevelAssociationData associated with this element, if it exists. |
|  | GetLevelOffset | Returns the offset from the Associated Level. |
|  | SetAssociatedLevel | Sets the Associated Level. |

#### Reference

Autodesk.Revit.DB Namespace