Revit 2026 API

# TransactWithCentralOptions Class

---

Options to customize Revit behavior when accessing the central model.

SystemObject Autodesk.Revit.DBTransactWithCentralOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TransactWithCentralOptions : IDisposable
```
```vb
Public Class TransactWithCentralOptions
	Implements IDisposable
```
```cpp
public ref class TransactWithCentralOptions : IDisposable
```
```fsharp
type TransactWithCentralOptions =
    class
        interface IDisposable
    end
```

The TransactWithCentralOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TransactWithCentralOptions | Constructs a new TransactWithCentralOptions. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the TransactWithCentralOptions |
|  | GetLockCallback | Gets the callback object that changes Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model. |
|  | SetLockCallback | Sets or resets a callback object that would allow an external application to change Revit's default behavior of endlessly waiting and repeatedly trying to lock a central model. |

#### Reference

Autodesk.Revit.DB Namespace