Revit 2026 API

# FilterStringRule Properties

---

The FilterStringRule type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | RuleString | The user-supplied string against which strings from a Revit document will be tested. |

#### Reference

FilterStringRule Class

Autodesk.Revit.DB Namespace