Revit 2026 API

# CircleLightShape Properties

---

The CircleLightShape type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | EmitDiameter | The emit diameter. |

#### Reference

CircleLightShape Class

Autodesk.Revit.DB.Lighting Namespace