Revit 2026 API

# ProjectLocationSet Class

---

An set that contains project locations.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBProjectLocationSet

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ProjectLocationSet : APIObject,
	IEnumerable
```
```vb
Public Class ProjectLocationSet
	Inherits APIObject
	Implements IEnumerable
```
```cpp
public ref class ProjectLocationSet : public APIObject,
	IEnumerable
```
```fsharp
type ProjectLocationSet =
    class
        inherit APIObject
        interface IEnumerable
    end
```

The ProjectLocationSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ProjectLocationSet | Initializes a new instance of the ProjectLocationSet class |

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of project locations that are in the set. |

|  | Name | Description |
| --- | --- | --- |
|  | Clear | Removes every project location from the set, rendering it empty. |
|  | Contains | Tests for the existence of a project location within the set. |
|  | Erase | Removes a specified project location from the set. |
|  | ForwardIterator | Retrieve a forward moving iterator to the set. |
|  | GetEnumerator | Retrieve a forward moving iterator to the set. |
|  | Insert | Insert the specified project location into the set. |
|  | ReverseIterator | Retrieve a backward moving iterator to the set. |

#### Reference

Autodesk.Revit.DB Namespace