Revit 2026 API

# SchemaException Methods

---

The SchemaException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides InvalidOperationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

SchemaException Class

Autodesk.Revit.Exceptions Namespace