Revit 2026 API

# RebarShapeConstraintRadius Properties

---

The RebarShapeConstraintRadius type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ArcReferenceType | The choice of rule for measuring the radius. |

#### Reference

RebarShapeConstraintRadius Class

Autodesk.Revit.DB.Structure Namespace