Revit 2026 API

# FabricationVersionInfo Methods

---

The FabricationVersionInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

FabricationVersionInfo Class

Autodesk.Revit.DB Namespace