Revit 2026 API

# Fascia Properties

---

The Fascia type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FasciaType | Retrieves/set an object that represents the type of the Fascia. |

#### Reference

Fascia Class

Autodesk.Revit.DB.Architecture Namespace