Revit 2026 API

# PanelTypeSetIterator Properties

---

The PanelTypeSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

PanelTypeSetIterator Class

Autodesk.Revit.DB Namespace