Revit 2026 API

# WallFoundation Methods

---

The WallFoundation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new wall foundation within the project. |

#### Reference

WallFoundation Class

Autodesk.Revit.DB Namespace