Revit 2026 API

# RebarSystemSpanSymbol Class

---

Represents a Rebar System Span Symbol element in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBIndependentTag Autodesk.Revit.DB.StructureRebarSystemSpanSymbol

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class RebarSystemSpanSymbol : IndependentTag
```
```vb
Public Class RebarSystemSpanSymbol
	Inherits IndependentTag
```
```cpp
public ref class RebarSystemSpanSymbol : public IndependentTag
```
```fsharp
type RebarSystemSpanSymbol =
    class
        inherit IndependentTag
    end
```

The RebarSystemSpanSymbol type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of RebarSystemSpanSymbol in the project. |

#### Reference

Autodesk.Revit.DB.Structure Namespace