Revit 2026 API

# RevitServerInternalException Methods

---

The RevitServerInternalException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides RevitServerExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

RevitServerInternalException Class

Autodesk.Revit.Exceptions Namespace