Revit 2026 API

# SpatialElementTag Properties

---

The SpatialElementTag type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HasElbow | Identifies if the tag's leader has an elbow point or not. |
|  | HasLeader | Identifies if a leader is displayed for the tag or not. |
|  | IsOrphaned | Identifies if the tag is orphaned or not. |
|  | IsTaggingLink | Identifies if the tag has reference to a spatial element in a linked document or not. |
|  | LeaderElbow | The position of the leader's elbow (middle point). |
|  | LeaderEnd | The position of the leader's end. |
|  | Location | The location of the tag.(Overrides ElementLocation) |
|  | RotationAngle | The rotation angle of the tag relative to its view |
|  | TagHeadPosition | The position of the tag's head. |
|  | TagOrientation | The orientation of the tag. |
|  | TagText | The text displayed by the tag. |
|  | View | The view in which the tag was placed. |

#### Reference

SpatialElementTag Class

Autodesk.Revit.DB Namespace