Revit 2026 API

# DuctInsulation Class

---

Represents insulation applied to the outside of a given duct , fitting or accessory.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBHostObject Autodesk.Revit.DBMEPCurve Autodesk.Revit.DBInsulationLiningBase Autodesk.Revit.DB.MechanicalDuctInsulation

**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DuctInsulation : InsulationLiningBase
```
```vb
Public Class DuctInsulation
	Inherits InsulationLiningBase
```
```cpp
public ref class DuctInsulation : public InsulationLiningBase
```
```fsharp
type DuctInsulation =
    class
        inherit InsulationLiningBase
    end
```

The DuctInsulation type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates a new instance of duct insulation. |

#### Reference

Autodesk.Revit.DB.Mechanical Namespace