Revit 2026 API

# CableTray Properties

---

The CableTray type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurveNormal | The up-direction vector of the cable tray. |
|  | RungSpace | Distance between two rungs for the ladder cable tray. |

#### Reference

CableTray Class

Autodesk.Revit.DB.Electrical Namespace