Revit 2026 API

# ColorBackgroundSettings Class

---

Represents the rendering color background settings.

SystemObject Autodesk.Revit.DBBackgroundSettings Autodesk.Revit.DBColorBackgroundSettings

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ColorBackgroundSettings : BackgroundSettings
```
```vb
Public Class ColorBackgroundSettings
	Inherits BackgroundSettings
```
```cpp
public ref class ColorBackgroundSettings : public BackgroundSettings
```
```fsharp
type ColorBackgroundSettings =
    class
        inherit BackgroundSettings
    end
```

The ColorBackgroundSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Color | The color of the rendering background. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace