Revit 2026 API

# LeaderArrayIterator Properties

---

The LeaderArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

LeaderArrayIterator Class

Autodesk.Revit.DB Namespace