Revit 2026 API

# Duct Properties

---

The Duct type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DuctType | The duct type of this duct. |
|  | IsPlaceholder | Identifies if the duct is a placeholder or not. |

#### Reference

Duct Class

Autodesk.Revit.DB.Mechanical Namespace