Revit 2026 API

# DeleteElements Class

---

Deletes element(s) related to the failure.

SystemObject Autodesk.Revit.DBFailureResolution Autodesk.Revit.DBDeleteElements

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DeleteElements : FailureResolution
```
```vb
Public Class DeleteElements
	Inherits FailureResolution
```
```cpp
public ref class DeleteElements : public FailureResolution
```
```fsharp
type DeleteElements =
    class
        inherit FailureResolution
    end
```

The DeleteElements type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId) | Creates an instance of the DeleteElements resolution. |
|  | Create(Document, IListElementId) |  |
|  | Create(Document, ISetElementId) |  |

#### Reference

Autodesk.Revit.DB Namespace