Revit 2026 API

# StairsLandingType Class

---

Represents a stairs landing type in Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ArchitectureStairsLandingType

**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class StairsLandingType : ElementType
```
```vb
Public Class StairsLandingType
	Inherits ElementType
```
```cpp
public ref class StairsLandingType : public ElementType
```
```fsharp
type StairsLandingType =
    class
        inherit ElementType
    end
```

The StairsLandingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsMonolithic | True if the stairs landing is monolithic, false otherwise. |
|  | Thickness | Thickness of the stairs landing. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Architecture Namespace