Revit 2026 API

# AreaBasedLoadType Methods

---

The AreaBasedLoadType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates an area based load type. |

#### Reference

AreaBasedLoadType Class

Autodesk.Revit.DB.Electrical Namespace