Revit 2026 API

# InternalOrigin Methods

---

The InternalOrigin type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Get | Gets the internal origin for the document. |

#### Reference

InternalOrigin Class

Autodesk.Revit.DB Namespace