Revit 2026 API

# CorruptModelException Methods

---

The CorruptModelException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

CorruptModelException Class

Autodesk.Revit.Exceptions Namespace