Revit 2026 API

# AssetProperties Methods

---

The AssetProperties type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FindByName | Gets the property with the given name. |
|  | Get | Gets the property at the given index. |
|  | IsValidIndex | Returns true if the provided index is valid. |

#### Reference

AssetProperties Class

Autodesk.Revit.DB.Visual Namespace