Revit 2026 API

# VertexPositionColored Class

---

A geometry vertex specified as a position in space with a color.

SystemObject Autodesk.Revit.DB.DirectContext3DVertex Autodesk.Revit.DB.DirectContext3DVertexPositionColored

**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VertexPositionColored : Vertex
```
```vb
Public Class VertexPositionColored
	Inherits Vertex
```
```cpp
public ref class VertexPositionColored : public Vertex
```
```fsharp
type VertexPositionColored =
    class
        inherit Vertex
    end
```

The VertexPositionColored type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VertexPositionColored | Constructs the vertex from a point and a color. |

|  | Name | Description |
| --- | --- | --- |
|  | Position | The vertex's position. |

|  | Name | Description |
| --- | --- | --- |
|  | GetColor | Gets the vertex's color. |
|  | GetSizeInFloats | Gets the amount of storage that the vertex takes up in a buffer, measured in floats. |
|  | SetColor | Sets the vertex's color. |

The color of these vertices includes a transparency component In order to render them as transparent they must be rendered in the transparent pass See the 'IsTransparentPass' method of DrawContext

#### Reference

Autodesk.Revit.DB.DirectContext3D Namespace