Revit 2026 API

# ParameterSetIterator Properties

---

The ParameterSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

ParameterSetIterator Class

Autodesk.Revit.DB Namespace