Revit 2026 API

# ConnectionValidationInfo Class

---

This object contains information about fabrication connection validations.

SystemObject Autodesk.Revit.DBConnectionValidationInfo

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ConnectionValidationInfo : IDisposable
```
```vb
Public Class ConnectionValidationInfo
	Implements IDisposable
```
```cpp
public ref class ConnectionValidationInfo : IDisposable
```
```fsharp
type ConnectionValidationInfo =
    class
        interface IDisposable
    end
```

The ConnectionValidationInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ConnectionValidationInfo | Constructor. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ConnectionValidationInfo |
|  | GetWarning | Access specific warning number of warnings generated by reload. |
|  | IsValidWarningIndex | Validate warning index. |
|  | ManyWarnings | Returns number of warnings generated by reload. |

#### Reference

Autodesk.Revit.DB Namespace