Revit 2026 API

# LayoutRuleMaximumSpacing Class

---

This class indicate the layout rule of a Beam System is Max-Spacing.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBLayoutRule Autodesk.Revit.DBLayoutRuleMaximumSpacing

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LayoutRuleMaximumSpacing : LayoutRule
```
```vb
Public Class LayoutRuleMaximumSpacing
	Inherits LayoutRule
```
```cpp
public ref class LayoutRuleMaximumSpacing : public LayoutRule
```
```fsharp
type LayoutRuleMaximumSpacing =
    class
        inherit LayoutRule
    end
```

The LayoutRuleMaximumSpacing type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | LayoutRuleMaximumSpacing | Constructor of LayoutRuleMaximumSpacing. |

|  | Name | Description |
| --- | --- | --- |
|  | Spacing | Get or set the spacing of the beam system. |

|  | Name | Description |
| --- | --- | --- |

To use this type of LayoutRule, only the maximum spacing must be set and it must be in (0, 30000).

#### Reference

Autodesk.Revit.DB Namespace