Revit 2026 API

# AssetSetIterator Properties

---

The AssetSetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current |  |

#### Reference

AssetSetIterator Class

Autodesk.Revit.DB.Visual Namespace