Revit 2026 API

# ExternallyTaggedGeometryObject Class

---

Base class for ExternallyTaggedGeometryObject and ExternallyTaggedSolid.

SystemObject Autodesk.Revit.DBExternallyTaggedGeometryObject Autodesk.Revit.DBExternallyTaggedBRep Autodesk.Revit.DBExternallyTaggedNonBRep

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ExternallyTaggedGeometryObject : IDisposable
```
```vb
Public Class ExternallyTaggedGeometryObject
	Implements IDisposable
```
```cpp
public ref class ExternallyTaggedGeometryObject : IDisposable
```
```fsharp
type ExternallyTaggedGeometryObject =
    class
        interface IDisposable
    end
```

The ExternallyTaggedGeometryObject type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExternalId | The external Id of the geometry object. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the ExternallyTaggedGeometryObject |

#### Reference

Autodesk.Revit.DB Namespace