Revit 2026 API

# ColorFillLegend Methods

---

The ColorFillLegend type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create | Creates new instance of ColorFillLegend. |
|  | GetColumnWidths | Returns array of column widths in the legend. |
|  | SetColumnWidths |  |

#### Reference

ColorFillLegend Class

Autodesk.Revit.DB Namespace