Revit 2026 API

# STEPExportOptions Class

---

The export options used by exporting STEP format file.

SystemObject Autodesk.Revit.DBBIMExportOptions Autodesk.Revit.DBSTEPExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class STEPExportOptions : BIMExportOptions
```
```vb
Public Class STEPExportOptions
	Inherits BIMExportOptions
```
```cpp
public ref class STEPExportOptions : public BIMExportOptions
```
```fsharp
type STEPExportOptions =
    class
        inherit BIMExportOptions
    end
```

The STEPExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | STEPExportOptions | Constructs a new instance of STEPExportOptions with default values of all properties. |

|  | Name | Description |
| --- | --- | --- |
|  | ApplicationProtocol | The Application Protocol of the exported STEP file. |
|  | TargetUnit | The unit type of geometry in the resultant STEP file. Default value is ExportUnit::Default. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace