Revit 2026 API

# ConnectionInputPointInfo Methods

---

The ConnectionInputPointInfo type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

ConnectionInputPointInfo Class

Autodesk.Revit.DB.Structure Namespace