Revit 2026 API

# MullionTypeSet Properties

---

The MullionTypeSet type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsEmpty | Test to see if the set is empty. |
|  | Size | Returns the number of mullion types that are in the set. |

#### Reference

MullionTypeSet Class

Autodesk.Revit.DB Namespace