Revit 2026 API

# RelinquishOptions Methods

---

The RelinquishOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

RelinquishOptions Class

Autodesk.Revit.DB Namespace