Revit 2026 API

# AXMImportOptions Class

---

The import options used to import AXM format files.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBAXMImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class AXMImportOptions : BaseImportOptions
```
```vb
Public Class AXMImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class AXMImportOptions : public BaseImportOptions
```
```fsharp
type AXMImportOptions =
    class
        inherit BaseImportOptions
    end
```

The AXMImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AXMImportOptions | Constructs a new instance of AXMImportOptions with default values of all properties. |
|  | AXMImportOptions(AXMImportOptions) | Constructs a new instance of AXMImportOptions as a copy of the provided import options. |

|  | Name | Description |
| --- | --- | --- |
|  | ImportLevels | Indicate if levels are to be imported. False by default. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace