Revit 2026 API

# WorksetFilter Class

---

A base class for a type of filter that accepts or rejects worksets based upon criteria.

SystemObject Autodesk.Revit.DBWorksetFilter Autodesk.Revit.DBWorksetKindFilter

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WorksetFilter : IDisposable
```
```vb
Public Class WorksetFilter
	Implements IDisposable
```
```cpp
public ref class WorksetFilter : IDisposable
```
```fsharp
type WorksetFilter =
    class
        interface IDisposable
    end
```

The WorksetFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IncludeStandaloneWorksetsOnly | True if the results of the filter only match stand-alone worksets; worksets that are not stand-alone will be rejected. |
|  | Inverted | True if the results of the filter are inverted; worksets that would normally be accepted by this filter will be rejected, and worksets that would normally be rejected will be accepted. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the WorksetFilter |

#### Reference

Autodesk.Revit.DB Namespace