Revit 2026 API

# CategoryNameMapIterator Class

---

An iterator to a category name map.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCategoryNameMapIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CategoryNameMapIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CategoryNameMapIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CategoryNameMapIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CategoryNameMapIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CategoryNameMapIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CategoryNameMapIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the category that is the current focus of the iterator. |
|  | Key | Retrieves the category name that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the map. |

#### Reference

Autodesk.Revit.DB Namespace