Revit 2026 API

# CitySetIterator Methods

---

The CitySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

CitySetIterator Class

Autodesk.Revit.DB Namespace