Revit 2026 API

# CorrectionFactor Properties

---

The CorrectionFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Factor | Get factor value of wire correction factor. |

#### Reference

CorrectionFactor Class

Autodesk.Revit.DB.Electrical Namespace