Revit 2026 API

# LayoutRuleFixedDistance Properties

---

The LayoutRuleFixedDistance type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | JustifyType | Get or set the type of justification. |
|  | Spacing | Get or set spacing of the Beam System. |

#### Reference

LayoutRuleFixedDistance Class

Autodesk.Revit.DB Namespace