Revit 2026 API

# TransactionAttribute Class

---

The custom transaction attribute to control the transaction behavior of the external command.

SystemObject SystemAttribute Autodesk.Revit.AttributesTransactionAttribute

**Namespace:** Autodesk.Revit.Attributes**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class TransactionAttribute : Attribute
```
```vb
Public Class TransactionAttribute
	Inherits Attribute
```
```cpp
public ref class TransactionAttribute : public Attribute
```
```fsharp
type TransactionAttribute =
    class
        inherit Attribute
    end
```

The TransactionAttribute type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TransactionAttribute | Constructs a new TransactionAttribute. |

|  | Name | Description |
| --- | --- | --- |
|  | Mode | Transaction mode. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.Attributes Namespace