Revit 2026 API

# AssetPropertyFloat Properties

---

The AssetPropertyFloat type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The value of the property. |

#### Reference

AssetPropertyFloat Class

Autodesk.Revit.DB.Visual Namespace