Revit 2026 API

# FamilyElementVisibility Class

---

Provides access to the visibility parameters of family elements in family document.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBFamilyElementVisibility

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FamilyElementVisibility : APIObject
```
```vb
Public Class FamilyElementVisibility
	Inherits APIObject
```
```cpp
public ref class FamilyElementVisibility : public APIObject
```
```fsharp
type FamilyElementVisibility =
    class
        inherit APIObject
    end
```

The FamilyElementVisibility type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FamilyElementVisibility | Initializes a new instance of the FamilyElementVisibility class |

|  | Name | Description |
| --- | --- | --- |
|  | IsShownInCoarse | Indicates if the instance is display with Coarse detail level in the view of project document. |
|  | IsShownInFine | Indicates if the instance is display with Fine detail level in the view of project document. |
|  | IsShownInFrontBack | Indicates if the instance is display in Front/Back view of project document. |
|  | IsShownInLeftRight | Indicates if the instance is display in Left/Right view of project document. |
|  | IsShownInMedium | Indicates if the instance is display with Medium detail level in the view of project document. |
|  | IsShownInPlanRCPCut | Indicates if the instance is displayed when cut in Plan/RCP (if the category permits). |
|  | IsShownInTopBottom | Indicates if the instance is display in Plan/RCP view of project document. |
|  | IsShownOnlyWhenCut | Indicates if the instance is displayed only if it has been cut. |
|  | VisibilityType | Indicates if the instance is Model or View specific. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace