Revit 2026 API

# VertexStreamPositionNormal Methods

---

The VertexStreamPositionNormal type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddVertex | Inserts a VertexStreamPositionNormal into the stream and associated buffer. |
|  | AddVertices |  |

#### Reference

VertexStreamPositionNormal Class

Autodesk.Revit.DB.DirectContext3D Namespace