Revit 2026 API

# FBXExportOptions Class

---

3D-Studio Max (FBX) Export options.

SystemObject Autodesk.Revit.DBFBXExportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FBXExportOptions
```
```vb
Public Class FBXExportOptions
```
```cpp
public ref class FBXExportOptions
```
```fsharp
type FBXExportOptions = class end
```

The FBXExportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FBXExportOptions | Default constructor. Sets all options to their default values. |

|  | Name | Description |
| --- | --- | --- |
|  | LevelsOfDetailValue | The value of the levels of detail. |
|  | StopOnError | Whether export process should stop when a view fails to export. |
|  | UseLevelsOfDetail | True to use levels of detail, false otherwise. |
|  | WithoutBoundaryEdges | True to export without boundary edges, false otherwise. |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace