Revit 2026 API

# PhaseArrayIterator Properties

---

The PhaseArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

PhaseArrayIterator Class

Autodesk.Revit.DB Namespace