Revit 2026 API

# MultiServerService Properties

---

The MultiServerService type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ExecutionPolicy | Specifies how a multi-server service executes servers during its execution. |

#### Reference

MultiServerService Class

Autodesk.Revit.DB.ExternalService Namespace