Revit 2026 API

# DetailCurveArrayIterator Methods

---

The DetailCurveArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

DetailCurveArrayIterator Class

Autodesk.Revit.DB Namespace