Revit 2026 API

# PointCloudColorSettings Methods

---

The PointCloudColorSettings type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Assign | Assigns values of the source settings to this object. |
|  | Dispose |  |
|  | IsEqual | Check if the contents of two settings are equal. |

#### Reference

PointCloudColorSettings Class

Autodesk.Revit.DB.PointClouds Namespace