Revit 2026 API

# RebarFreeFormAccessor Methods

---

The RebarFreeFormAccessor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddUpdatingSharedParameter | Add existing shared parameter as a dependency for the calculation of the rebar curves. |
|  | CanBeHookNormal | **Obsolete.** A vector can be termination's (e.g. hook, crank) normal if for a bar specified by index, the bar direction is not parallel with the vector. |
|  | CanBeTerminationPlaneNormal | A vector can be termination (e.g. hook, crank) plane normal if for a bar specified by index, the bar direction is not parallel with the vector. |
|  | DisconnectFromServer | Sets the GUID of the API server to invalid value and removes all the server related data from the Rebar (ex. the current constraints and the handle tags are removed). Calling this method will result in a Rebar that will not react to host changes anymore, however it will still have all the properties that it used to have. |
|  | Dispose |  |
|  | GetCouplerIdAtIndex | Gets the id of the Rebar Coupler that is applied to the bar with index barPositionIndex at the specified end. |
|  | GetCrankTypeIdAtIndex | Gets the id of the Rebar Crank Type that is applied to this Rebar at the bar with index barPositionIndex at the specified end. |
|  | GetCustomDistributionPath | Gets the custom distribution path for free form rebar set. |
|  | GetEndTreatmentTypeIdAtIndex | Gets the id of the EndTreatmentType that is applied to the bar with index barPositionIndex at the specified end. |
|  | GetHookOrientationAngle | **Obsolete.** Get the termination's rotation angle at end. The angle is used for both hook and crank. |
|  | GetHookOrientationAngleAtIndex | **Obsolete.** Gets the termnination's rotation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end. The rotation angle it's the same for both hook and crank. |
|  | GetHookOrientationAtIndex | **Obsolete.** Gets the termination's orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end. The orientation it's the same for both hook and crank. |
|  | GetHookPlaneNormalForBarIdx | **Obsolete.** Returns the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. The plane's normal is used for both hook and crank. |
|  | GetHookTypeIdAtIndex | Gets the id of the RebarHookType that is applied to this Rebar at the bar with index barPositionIndex at the specified end. |
|  | GetServerGUID | Returns the GUID of the API server. |
|  | GetShapeIdAtIndex | Gets the Rebar Shape id for the bar with index barPositionIndex. |
|  | GetTerminationOrientationAtIndex | Gets the termination's (e.g. hook, crank ) orientation that is applied to this Rebar at the bar with index barPositionIndex at the specified end. |
|  | GetTerminationPlaneNormalForBarIndex | Gets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. |
|  | GetTerminationRotationAngleAtIndex | Gets the termination (e.g hook,crank) rotation angle that is applied to this Rebar at the bar with index barPositionIndex at the specified end. |
|  | GetUpdatingSharedParameters | Get the shared parameters listed as dependencies in the calculation of the rebar curves |
|  | HasValidAlignedServer | Returns true if the current rebar is created with the Aligned Free Form rebar server, false otherwise. |
|  | HasValidServer | Returns true if the current rebar contains a valid server GUID, false otherwise. |
|  | IsBarMatchedWithShapeInReverseOrder | Checks if the bar at index barPositionIndex it's matched in reversed order with its shape. |
|  | IsUnconstrained | Returns true if the current rebar doesn't contains a valid server GUID, or contains a valid server GUID and no valid constraints. |
|  | RemoveUpdatingSharedParameter | Remove existing shared parameter as a dependency for the calculation of the rebar curves. |
|  | SetCurves(IListCurveLoop) |  |
|  | SetCurves(IListIListCurve) |  |
|  | SetHookOrientationAngle | **Obsolete.** Set the termination's rotation angle at end. The angle will be used for both hook and crank. Will throw exception if the rebar has valid constraints. |
|  | SetHookPlaneNormalForBarIdx | **Obsolete.** Set the plane's normal in which the termination at end of bar with index barPositionIndex will stay. The plane's normal will be used for both hook and crank. Will throw exception if the rebar has valid constraints. |
|  | SetLayoutAsFixedNumber | Sets the Layout Rule property of rebar set to Fixed Number. |
|  | SetLayoutAsMaximumSpacing | Sets the Layout Rule property of rebar set to Maximum Spacing. |
|  | SetLayoutAsMinimumClearSpacing | Sets the Layout Rule property of rebar set to Minimum Clear Spacing. |
|  | SetLayoutAsNumberWithSpacing | Sets the Layout Rule property of rebar set to Number With Spacing. |
|  | SetLayoutAsSingle | Sets the Layout Rule property of rebar set to Single. |
|  | SetReportedShape | This method changes the RebarShape of a Free Form Rebar that is using RebarWorkInstructions.Straight property to the provided RebarShape. |
|  | SetTerminationPlaneNormalForBarIndex | Sets the plane's normal in which the termination (e.g. hook, crank) at end of bar with index barPositionIndex will stay. Will throw exception if the rebar has valid constraints. |

#### Reference

RebarFreeFormAccessor Class

Autodesk.Revit.DB.Structure Namespace