Revit 2026 API

# FaceNode Class

---

An output node that represents a Face.

SystemObject Autodesk.Revit.DBRenderNode Autodesk.Revit.DBFaceNode

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FaceNode : RenderNode
```
```vb
Public Class FaceNode
	Inherits RenderNode
```
```cpp
public ref class FaceNode : public RenderNode
```
```fsharp
type FaceNode =
    class
        inherit RenderNode
    end
```

The FaceNode type exposes the following members.

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetFace | Returns the Face object corresponding to the node. |

See also: [!:Autodesk::Revit::DB::IExportContext::OnFaceBegin].

#### Reference

Autodesk.Revit.DB Namespace