Revit 2026 API

# ElementArrayIterator Class

---

An iterator to an element array.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBElementArrayIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class ElementArrayIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class ElementArrayIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class ElementArrayIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type ElementArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The ElementArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ElementArrayIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the array. |

#### Reference

Autodesk.Revit.DB Namespace