Revit 2026 API

# DWGImportOptions Class

---

The import options used by importing DWG or DXF format file.

SystemObject Autodesk.Revit.DBBaseImportOptions Autodesk.Revit.DBDWGImportOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class DWGImportOptions : BaseImportOptions
```
```vb
Public Class DWGImportOptions
	Inherits BaseImportOptions
```
```cpp
public ref class DWGImportOptions : public BaseImportOptions
```
```fsharp
type DWGImportOptions =
    class
        inherit BaseImportOptions
    end
```

The DWGImportOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DWGImportOptions | Constructs a new instance of DWGImportOptions with default values of all properties. |
|  | DWGImportOptions(DWGImportOptions) | Constructs a new instance of DWGImportOptions as a copy of the import options. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |
|  | GetLineWeights | Gets array of line weights. |
|  | SetLineWeights |  |

#### Reference

Autodesk.Revit.DB Namespace