Revit 2026 API

# Gutter Methods

---

The Gutter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddSegment | Add segments to the gutter.(Overrides HostedSweepAddSegment(Reference)) |

#### Reference

Gutter Class

Autodesk.Revit.DB.Architecture Namespace