Revit 2026 API

# VectorAtPoint Class

---

Stores vectors at one domain point. Each vector corresponds to a "measurement" for which this vector was calculated.

SystemObject Autodesk.Revit.DBValueAtPointBase Autodesk.Revit.DB.AnalysisVectorAtPoint

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class VectorAtPoint : ValueAtPointBase
```
```vb
Public Class VectorAtPoint
	Inherits ValueAtPointBase
```
```cpp
public ref class VectorAtPoint : public ValueAtPointBase
```
```fsharp
type VectorAtPoint =
    class
        inherit ValueAtPointBase
    end
```

The VectorAtPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | VectorAtPoint(IListXYZ) | Initializes a new instance of the VectorAtPoint class |
|  | VectorAtPoint(VectorAtPoint) | Creates a copy of the given VectorAtPoint instance. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Analysis Namespace