Revit 2026 API

# FilterNumericLess Class

---

Tests whether numeric values from the document are less than a certain value

SystemObject Autodesk.Revit.DBFilterNumericRuleEvaluator Autodesk.Revit.DBFilterNumericLess

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class FilterNumericLess : FilterNumericRuleEvaluator
```
```vb
Public Class FilterNumericLess
	Inherits FilterNumericRuleEvaluator
```
```cpp
public ref class FilterNumericLess : public FilterNumericRuleEvaluator
```
```fsharp
type FilterNumericLess =
    class
        inherit FilterNumericRuleEvaluator
    end
```

The FilterNumericLess type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | FilterNumericLess | Constructs an instance of FilterNumericLess. |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace