Revit 2026 API

# SolidCurveIntersectionOptions Class

---

This class contains the options used to calculate the intersection between a solid and a curve.

SystemObject Autodesk.Revit.DBSolidCurveIntersectionOptions

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class SolidCurveIntersectionOptions : IDisposable
```
```vb
Public Class SolidCurveIntersectionOptions
	Implements IDisposable
```
```cpp
public ref class SolidCurveIntersectionOptions : IDisposable
```
```fsharp
type SolidCurveIntersectionOptions =
    class
        interface IDisposable
    end
```

The SolidCurveIntersectionOptions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | SolidCurveIntersectionOptions | Constructs a new SolidCurveIntersectionMode with default settings. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | ResultType | The type of results expected by the calculation. The default is CurveSegmentsInside. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the SolidCurveIntersectionOptions |

#### Reference

Autodesk.Revit.DB Namespace