Revit 2026 API

# ElementClassFilter Methods

---

The ElementClassFilter type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetElementClass | The class for the filter. |

#### Reference

ElementClassFilter Class

Autodesk.Revit.DB Namespace