Revit 2026 API

# WireConduitType Properties

---

The WireConduitType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Name |  |

#### Reference

WireConduitType Class

Autodesk.Revit.DB.Electrical Namespace