Revit 2026 API

# ModelPath Methods

---

The ModelPath type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Compare | Compares this ModelPath with another |
|  | Dispose |  |
|  | GetModelGUID | A GUID identifying the Revit cloud model. |
|  | GetProjectGUID | A GUID identifying the BIM 360 Docs or Autodesk Docs project to which the model is associated. |

#### Reference

ModelPath Class

Autodesk.Revit.DB Namespace