Revit 2026 API

# LightGroup Class

---

This class represents a set of lights grouped together for easier management of various lighting scenarios

SystemObject Autodesk.Revit.DB.LightingLightGroup

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class LightGroup : IDisposable
```
```vb
Public Class LightGroup
	Implements IDisposable
```
```cpp
public ref class LightGroup : IDisposable
```
```fsharp
type LightGroup =
    class
        interface IDisposable
    end
```

The LightGroup type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Id | The ElementId of the LightGroup |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | Name | The name of the LightGroup |

|  | Name | Description |
| --- | --- | --- |
|  | AddLight | Add a new light instance to the group |
|  | Dispose | Releases all resources used by the LightGroup |
|  | GetLights | Get the set of contained light instances The set of light instances |
|  | RemoveLight | Remove the given light instance from the set of light instances in this group |

#### Reference

Autodesk.Revit.DB.Lighting Namespace