Revit 2026 API

# CylindricalHelix Class

---

A cylindrical helix.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBGeometryObject Autodesk.Revit.DBCurve Autodesk.Revit.DBCylindricalHelix

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class CylindricalHelix : Curve
```
```vb
Public Class CylindricalHelix
	Inherits Curve
```
```cpp
public ref class CylindricalHelix : public Curve
```
```fsharp
type CylindricalHelix =
    class
        inherit Curve
    end
```

The CylindricalHelix type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | BasePoint | The base point of the axis of the cylindrical helix. |
|  | Height | Height of the cylindrical helix. |
|  | IsRightHanded | True if the helix is right handed, false if the helix is left handed. |
|  | Pitch | The pitch of the cylindrical helix. |
|  | Radius | The radius of the cylindrical helix. |
|  | XVector | The X direction vector. |
|  | YVector | The Y direction vector. |
|  | ZVector | The Z direction vector, which is same as the axis direction vector. |

|  | Name | Description |
| --- | --- | --- |
|  | Create | Create a cylindrical helix. |

The helix winds around a cylinder making constant angle with the axis of the cylinder. In this release, CylindricalHelix curves are used only in specific applications in stairs and railings, and should not be used or encountered when accessing curves of other Revit elements and geometry.

#### Reference

Autodesk.Revit.DB Namespace