Revit 2026 API

# CategorySetIterator Methods

---

The CategorySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

CategorySetIterator Class

Autodesk.Revit.DB Namespace