Revit 2026 API

# InSessionPrintSetting Methods

---

The InSessionPrintSetting type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

InSessionPrintSetting Class

Autodesk.Revit.DB Namespace