Revit 2026 API

# CitySetIterator Class

---

An iterator to a city set.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DBCitySetIterator

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public abstract class CitySetIterator : APIObject,
	IEnumerator
```
```vb
Public MustInherit Class CitySetIterator
	Inherits APIObject
	Implements IEnumerator
```
```cpp
public ref class CitySetIterator abstract : public APIObject,
	IEnumerator
```
```fsharp
[<AbstractClassAttribute>]
type CitySetIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
```

The CitySetIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CitySetIterator | For Internal Use Only. |

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

|  | Name | Description |
| --- | --- | --- |
|  | MoveNext | Move the iterator one item forward. |
|  | Reset | Bring the iterator back to the start of the set. |

#### Reference

Autodesk.Revit.DB Namespace