Revit 2026 API

# NullParameterValue Class

---

A class that represent an empty (null) value of a parameter element.

SystemObject Autodesk.Revit.DBParameterValue Autodesk.Revit.DBNullParameterValue

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class NullParameterValue : ParameterValue
```
```vb
Public Class NullParameterValue
	Inherits ParameterValue
```
```cpp
public ref class NullParameterValue : public ParameterValue
```
```fsharp
type NullParameterValue =
    class
        inherit ParameterValue
    end
```

The NullParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | NullParameterValue | Default constructor |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB Namespace