Revit 2026 API

# FilledRegion Methods

---

The FilledRegion type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Create(Document, ElementId, ElementId, IListCurveLoop) |  |
|  | Create(Document, ElementId, SketchPlane, IListCurveLoop) |  |
|  | CreateMaskingRegion(Document, ElementId, IListCurveLoop) |  |
|  | CreateMaskingRegion(Document, SketchPlane, IListCurveLoop) |  |
|  | GetBoundaries | Gets the boundaries. |
|  | GetValidLineStyleIdsForFilledRegion | Gets the line style Ids which are permitted to be assigned to a filled region. |
|  | IsValidFilledRegionTypeId | Indicates whether the given Id is a valid filled region type Id. |
|  | IsValidLineStyleIdForFilledRegion | Indicates whether the given Id is a valid line style Id. |
|  | SetLineStyleId | Sets the line style Id for all boundaries. |

#### Reference

FilledRegion Class

Autodesk.Revit.DB Namespace