Revit 2026 API

# AssemblyMemberDifferentType Properties

---

The AssemblyMemberDifferentType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | TypeId1 | Type id of the first assembly member |
|  | TypeId2 | Type id of the second assembly member |

#### Reference

AssemblyMemberDifferentType Class

Autodesk.Revit.DB Namespace