Revit 2026 API

# StringParameterValue Properties

---

The StringParameterValue type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Value | The stored value |

#### Reference

StringParameterValue Class

Autodesk.Revit.DB Namespace