Revit 2026 API

# TemperatureRatingType Class

---

**Note: This API is now obsolete.**

Represents temperature rating type definition information.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.ElectricalTemperatureRatingType

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("TemperatureRatingType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use TemperatureRating instead. TemperatureRatings will be created by TemperatureRatingTypes properly during document upgrade.")]
public class TemperatureRatingType : ElementType
```
```vb
<ObsoleteAttribute("TemperatureRatingType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use TemperatureRating instead. TemperatureRatings will be created by TemperatureRatingTypes properly during document upgrade.")>
Public Class TemperatureRatingType
	Inherits ElementType
```
```cpp
[ObsoleteAttribute(L"TemperatureRatingType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use TemperatureRating instead. TemperatureRatings will be created by TemperatureRatingTypes properly during document upgrade.")]
public ref class TemperatureRatingType : public ElementType
```
```fsharp
[<ObsoleteAttribute("TemperatureRatingType is deprecated in Revit 2026 and will be removed in a future version of Revit. Please use TemperatureRating instead. TemperatureRatings will be created by TemperatureRatingTypes properly during document upgrade.")>]
type TemperatureRatingType =
    class
        inherit ElementType
    end
```

The TemperatureRatingType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CorrectionFactors | Get all correction factors defined in this temperature rating type and its corresponding material type. |
|  | InsulationTypes | Get all insulation types defined in this temperature rating type and its corresponding material type. |
|  | IsInUse | Indicate whether the temperature rating type is in use. |
|  | MaterialType | Get the material type information which this temperature rating type belongs to. |
|  | Name | Get name of temperature rating type. (Overrides ElementTypeName) |
|  | WireSizes | Get all electrical wire sizes defined in this temperature rating type and its corresponding material type. |

|  | Name | Description |
| --- | --- | --- |
|  | AddCorrectionFactor | Add a new electrical correction factor type to this temperature rating type. The given temperature value should be quantified in the document's selected unit of electrical temperature. |
|  | AddInsulationType | Add a new kind of insulation type into this temperature rating type. |
|  | AddWireSize | Add a new kind of wire size type into this temperature rating type. |
|  | RemoveCorrectionFactor | Remove an existing correction factor from this temperature rating type in Revit MEP project. |
|  | RemoveInsulationType | Remove an existing insulation type from this temperature rating type. |
|  | RemoveWireSize | Remove an existing wire size type from this temperature rating type. |

Temperature rating type is defined based on corresponding wire material type. It includes type information such as wire size, insulation type, correction factor, etc. Only the temperature rating types which are retrieved from WireMaterialType can work well, so don't retrieve it from Revit document directly.

#### Reference

Autodesk.Revit.DB.Electrical Namespace