Revit 2026 API

# RebarShapeTerminationsData Methods

---

The RebarShapeTerminationsData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | GetDocument | Gets the document containing the end treatment ids. |

#### Reference

RebarShapeTerminationsData Class

Autodesk.Revit.DB.Structure Namespace