Revit 2026 API

# AnalyticalBusData Properties

---

The AnalyticalBusData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CurrentRating | The current rating value of the analytical bus. |
|  | TotalConnectedCurrent | The total connected current of the analytical bus. |

#### Reference

AnalyticalBusData Class

Autodesk.Revit.DB.Electrical Namespace