Revit 2026 API

# InvalidOperationException Methods

---

The InvalidOperationException type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetObjectData | Retrieves data needed to serialize the target object.(Overrides ApplicationExceptionGetObjectData(SerializationInfo, StreamingContext)) |

#### Reference

InvalidOperationException Class

Autodesk.Revit.Exceptions Namespace