Revit 2026 API

# WireMaterialType Methods

---

The WireMaterialType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | AddGroundConductorSize | Add new electrical ground conductor size type into this material type. |
|  | AddTemperatureRatingType | Add a new temperature rating type into material type. |
|  | RemoveGroundConductorSize | Remove an existing ground conductor size from this material type. |
|  | RemoveTemperatureRatingType | Remove an existing temperature rating type from this material type. |

#### Reference

WireMaterialType Class

Autodesk.Revit.DB.Electrical Namespace