Revit 2026 API

# HemisphericalLightDistribution Class

---

This class encapsulates a hemispherical light distribution.

SystemObject Autodesk.Revit.DB.LightingLightDistribution Autodesk.Revit.DB.LightingHemisphericalLightDistribution

**Namespace:** Autodesk.Revit.DB.Lighting**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HemisphericalLightDistribution : LightDistribution
```
```vb
Public Class HemisphericalLightDistribution
	Inherits LightDistribution
```
```cpp
public ref class HemisphericalLightDistribution : public LightDistribution
```
```fsharp
type HemisphericalLightDistribution =
    class
        inherit LightDistribution
    end
```

The HemisphericalLightDistribution type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HemisphericalLightDistribution | Creates a hemispherical light distribution object. |
|  | HemisphericalLightDistribution(HemisphericalLightDistribution) | Creates a copy of the given hemispherical light distribution |

|  | Name | Description |
| --- | --- | --- |

|  | Name | Description |
| --- | --- | --- |

#### Reference

Autodesk.Revit.DB.Lighting Namespace