Revit 2026 API

# SlabShapeVertexArrayIterator Properties

---

The SlabShapeVertexArrayIterator type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Current | Retrieves the item that is the current focus of the iterator. |

#### Reference

SlabShapeVertexArrayIterator Class

Autodesk.Revit.DB Namespace