Revit 2026 API

# DuctFittingAndAccessoryPressureDropItem Methods

---

The DuctFittingAndAccessoryPressureDropItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |

#### Reference

DuctFittingAndAccessoryPressureDropItem Class

Autodesk.Revit.DB.Mechanical Namespace