Revit 2026 API

# ElementType Class

---

Base class for all Types within Autodesk Revit.

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType More

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class ElementType : Element
```
```vb
Public Class ElementType
	Inherits Element
```
```cpp
public ref class ElementType : public Element
```
```fsharp
type ElementType =
    class
        inherit Element
    end
```

The ElementType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CanBeCopied | Determine if this ElementType can create a copy |
|  | CanBeDeleted | Determine if this ElementType can be deleted |
|  | CanBeRenamed | Determine if this ElementType can be renamed |
|  | FamilyName | Gets the family name of this element type. |
|  | Name | Set the name for the ElementType.(Overrides ElementName) |

|  | Name | Description |
| --- | --- | --- |
|  | Duplicate | Duplicates an existing element type and assigns it a new name. |
|  | GetPreviewImage | Get the preview image of an element. This image is similar to what is seen in the Revit UI when selecting the type of an element. |
|  | GetSimilarTypes | Obtains a set of types that are similar to this type. |
|  | IsSimilarType | Checks if given type is similar to this type. |
|  | IsValidDefaultFamilyType | Identifies if this type is a valid default family type for the given family category id. |

Element types are usually non user visible elements that define instances. For example a wall type is a type that is not visible until an instance of the wall is created.

#### Reference

Autodesk.Revit.DB Namespace

SystemObject Autodesk.Revit.DBElement Autodesk.Revit.DBElementType Autodesk.Revit.DB.AnalysisConceptualConstructionType Autodesk.Revit.DB.ArchitectureContinuousRailType Autodesk.Revit.DB.ArchitectureCutMarkType Autodesk.Revit.DB.ArchitectureRailingType Autodesk.Revit.DB.ArchitectureStairsLandingType Autodesk.Revit.DB.ArchitectureStairsPathType Autodesk.Revit.DB.ArchitectureStairsRunType Autodesk.Revit.DB.ArchitectureStairsType Autodesk.Revit.DB.ArchitectureTopographyLinkType Autodesk.Revit.DBAssemblyType Autodesk.Revit.DBBeamSystemType Autodesk.Revit.DBBrowserOrganization Autodesk.Revit.DBCADLinkType Autodesk.Revit.DBDimensionType Autodesk.Revit.DBDirectShapeType Autodesk.Revit.DB.ElectricalCableType Autodesk.Revit.DB.ElectricalDistributionSysType Autodesk.Revit.DB.ElectricalInsulationType Autodesk.Revit.DB.ElectricalTemperatureRatingType Autodesk.Revit.DB.ElectricalVoltageType Autodesk.Revit.DB.ElectricalWireMaterialType Autodesk.Revit.DB.ElectricalWireType Autodesk.Revit.DBFabricationPartType Autodesk.Revit.DBGroupType Autodesk.Revit.DBHostObjAttributes Autodesk.Revit.DBImageType Autodesk.Revit.DBInsertableObject Autodesk.Revit.DBLineAndTextAttrSymbol Autodesk.Revit.DB.MechanicalDuctInsulationType Autodesk.Revit.DB.MechanicalDuctLiningType Autodesk.Revit.DB.MechanicalMechanicalEquipmentSetType Autodesk.Revit.DB.MechanicalMEPBuildingConstruction Autodesk.Revit.DB.MechanicalSystemZoneElementType Autodesk.Revit.DBMEPAnalyticalConnectionType Autodesk.Revit.DBMEPSystemType Autodesk.Revit.DBModelTextType Autodesk.Revit.DBMultiReferenceAnnotationType Autodesk.Revit.DB.PlumbingFluidType Autodesk.Revit.DB.PlumbingPipeInsulationType Autodesk.Revit.DB.PlumbingPipeScheduleType Autodesk.Revit.DBPointCloudType Autodesk.Revit.DBRevitLinkType Autodesk.Revit.DBSiteLocation Autodesk.Revit.DB.StructureAnalyticalLinkType Autodesk.Revit.DB.StructureAreaReinforcementType Autodesk.Revit.DB.StructureEndTreatmentType Autodesk.Revit.DB.StructureFabricAreaType Autodesk.Revit.DB.StructureFabricSheetType Autodesk.Revit.DB.StructureFabricWireType Autodesk.Revit.DB.StructureLoadTypeBase Autodesk.Revit.DB.StructurePathReinforcementType Autodesk.Revit.DB.StructureRebarBarType Autodesk.Revit.DB.StructureRebarBendingDetailType Autodesk.Revit.DB.StructureRebarContainerType Autodesk.Revit.DB.StructureRebarCoverType Autodesk.Revit.DB.StructureRebarHookType Autodesk.Revit.DB.StructureRebarShape Autodesk.Revit.DB.StructureStructuralConnectionApprovalType Autodesk.Revit.DB.StructureStructuralConnectionHandlerType Autodesk.Revit.DB.StructureStructuralConnectionType Autodesk.Revit.DBTilePattern Autodesk.Revit.DBViewFamilyType