Revit 2026 API

# EdgeEndPoint Methods

---

The EdgeEndPoint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Dispose |  |
|  | Equals(EdgeEndPoint) | Determines whether this EdgeEndPoint is equal to another. |
|  | Evaluate | Evaluate the end point of the edge in 3d coordinates. |

#### Reference

EdgeEndPoint Class

Autodesk.Revit.DB Namespace