Revit 2026 API

# InitialFluxIntensity Properties

---

The InitialFluxIntensity type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Flux | The flux intensity value. |

#### Reference

InitialFluxIntensity Class

Autodesk.Revit.DB.Lighting Namespace