Revit 2026 API

# DocumentOpeningEventArgs Properties

---

The DocumentOpeningEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | DocumentType | Type of the document, e.g. Project or Template. |
|  | PathName | Path of the document to be opened. |

#### Reference

DocumentOpeningEventArgs Class

Autodesk.Revit.DB.Events Namespace